nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
//---------- RAW_DATATRANS--------
RAW_DATATRANS   RawTrans_Com1;
RAW_DATATRANS   RawTrans_Com2;   

//---------- POS_STR  ----------------
POS_STR   Posit_Str;  //  位置字符串  



//------- 车辆负载状态 ---------------
u8  CarLoadState_Flag=1;//选中车辆状态的标志   1:空车   2:半空   3:重车

//------- 多媒体信息类型---------------
u8  Multimedia_Flag=1;//需要上传的多媒体信息类型   1:视频   2:音频   3:图像
u8  SpxBuf[SpxBuf_Size];  
u16 Spx_Wr=0,Spx_Rd=0;
u8  Duomeiti_sdFlag=0; 


u8      Jia_GPS_spdFlag=0;  //  假gps spd Flag
u16     Speed_gps_jiashi=0;   //  假时GPS 真速度

//------- 录音开始或者结束---------------
u8  Recor_Flag=1; //  1:录音开始   2:录音结束


//----------808协议 -------------------------------------------------------------------------------------	
u8		SIM_code[6];							   // 要发送的IMSI	号码
u8		IMSI_CODE[15]="000000000000000";							//SIM 卡的IMSI 号码
u8		Warn_Status[4]		=
{
		0x00, 0x00,0x00,0x00
}; //  报警标志位状态信息
u8  Warn_MaskWord[4]		=
{
		0x00, 0x00,0x00,0x00
};   //  报警屏蔽字    
u8  Text_MaskWord[4]=
	{
			0x00, 0x00,0x00,0x00
	};	 //  文本屏蔽字    
u8  Key_MaskWord[4]=
	{
			0x00, 0x00,0x00,0x00
	};	 //   关键字屏蔽字    
	

u8		Car_Status[4]		=
{
		0x00, 0x00,0x00,0x00 
}; //  车辆状态信息	
T_GPS_Info_GPRS 	Gps_Gprs,Bak_GPS_gprs;	 
T_GPS_Info_GPRS	Temp_Gps_Gprs; 
u8   A_time[6]; // 定位时刻的时间

u8      ReadPhotoPageTotal=0;
u8      SendPHPacketFlag=0; ////收到中心启动接收下一个block时置位


//-------- 紧急报警 -------- 
u8		warn_flag= 0;		  
u8		f_Exigent_warning= 0;//0;     //脚动 紧急报警装置 (INT0 PD0)
u8		Send_warn_times= 0;     //   设备向中心上报报警次数，最大3 次
u32  	fTimer3s_warncount=0;


//------  车门开关拍照 -------
DOORCamera   DoorOpen;    //  开关车门拍照

//------- 北斗扩展协议  ------------
GNSS_RAW     GNSS_rawdata; //  GNSS 详细数据上报
BD_EXTEND     BD_EXT;     //  北斗扩展协议  
DETACH_PKG   Detach_PKG; // 分包重传相关
SET_QRY         Setting_Qry; //  终端参数查询
u32     CMD_U32ID=0; 
PRODUCT_ATTRIBUTE   ProductAttribute;// 终端属性
HUMAN_CONFIRM_WARN   HumanConfirmWarn;// 人工确认报警

// ---- 拐点 -----
u16  Inflexion_Current=0;
u16  Inflexion_Bak=0;      
u16  Inflexion_chgcnter=0; //变化计数器
u16  InflexLarge_or_Small=0;     // 判断curent 和 Bak 大小    0 equql  1 large  2 small  
u16  InflexDelta_Accumulate=0;  //  差值累计 

// ----休眠状态  ------------
u8  SleepState=0;  //   0  不休眠ACC on            1  休眠Acc Off 
u8  SleepConfigFlag=0; //  休眠时发送鉴权标志位
u16    Spd_sleep=0;  //  休眠情况下的速度
u32    spd_sleepDur=10;  // 非法位移  
u16    Sleep_IO_state=0; //   休眠情况下的IO 状态


//---- 固定文件大小 --- 
u32 mp3_fsize=5616;
u8  mp3_sendstate=0;
u32 wmv_fsize=25964;
u8  wmv_sendstate=0;

//-------------------   公共 ---------------------------------------		
static u8 GPSsaveBuf[40];     // 存储GPS buffer
static u8	ISP_buffer[520];
static u16 GPSsaveBuf_Wr=0;


POSIT Posit[60];           // 每分钟位置信息存储
u8    PosSaveFlag=0;      // 存储Pos 状态位 

NANDSVFlag   NandsaveFlg;
A_AckFlag    Adata_ACKflag;  // 无线GPRS协议 接收相关 RS232 协议返回状态寄存器
TCP_ACKFlag  SD_ACKflag;     // 无线GPRS协议返回状态标志 
u32  SubCMD_8103H=0;            //  02 H命令 设置记录仪安装参数回复 子命令
u32  SubCMD_FF01H=0;            //  FF02 北斗信息扩展
u32  SubCMD_FF03H=0;     //  FF03  设置扩展终端参数设置1
u8   Fail_Flag=0;

u8  SubCMD_10H=0;            //  10H   设置记录仪定位告警参数
u8  OutGPS_Flag=0;     //  0  默认  1  接外部有源天线
u8   Spd_senor_Null=0;  // 手动传感器速度为0
u32  Centre_DoubtRead=0;     //  中心读取事故疑点数据的读字段 
u32  Centre_DoubtTotal=0;    //  中心读取事故疑点的总字段
u8   Vehicle_RunStatus=0;    //  bit 0: ACC 开 关             1 开  0关
                             //  bit 1: 通过速度传感器感知    1 表示行驶  0 表示停止   
                             //  bit 2: 通过gps速度感知       1 表示行驶  0 表示停止  
u8   Status_TiredwhRst=0;    //  当复位时 疲劳驾驶的状态   0 :停车  1:停车但没触发 2:触发了还没结束                              



u32   SrcFileSize=0,DestFilesize=0,SrcFile_read=0;
u32    SleepCounter=0; 

u16   DebugSpd=0;   //调试用GPS速度  
u8    MMedia2_Flag=0;  // 上传固有音频 和实时视频  的标志位    0 传固有 1 传实时


u8 tts_bro_tired_flag=0;   // 为了认证  ， 只播报一次 疲劳驾驶已经解除



//-----  ISP    远程下载相关 -------
ISP_BD  BD_ISP; //  BD   升级包    

//------ IC 卡模块 ---
IC_MODULE   IC_MOD;  //IC 模块


unsigned short int   FileTCB_CRC16=0;
unsigned short int   Last_crc=0,crc_fcs=0;  

//---------  中心应答  -----------
u8                      Send_Rdy4ok=0;  
unsigned char      Rstart_time=0;     


//---------- SMS SD ------------------
SMS_SD  SMS_send;



//---------------  速度脉冲相关--------------
u16  Delta_1s_Plus=0;
u16  Delta_1s_Plus2=0; 
u16  Sec_counter=0;

LENGTH_BUF  Rx_reg;
LENGTH_BUF app_rx; 

u8  Buf_700H_buffer[700]; 





void K_AdjustUseGPS(u32 sp, u32  sp_DISP);  // 通过GPS 校准  K 值  (车辆行驶1KM 的脉冲数目) 
u16  Protocol_808_Encode(u8 *Dest,u8 *Src, u16 srclen);
void Protocol_808_Decode(void);  // 解析指定buffer :  UDP_HEX_Rx  
void Photo_send_end(void);
void Sound_send_end(void);
void Video_send_end(void);  
unsigned short int CRC16_file(unsigned short int num);  
void Spd_ExpInit(void);
void AvrgSpd_MintProcess(u8 hour,u8 min, u8 sec) ; 
u32   Distance_Point2Line(u32 Cur_Lat, u32  Cur_Longi,u32 P1_Lat,u32 P1_Longi,u32 P2_Lat,u32 P2_Longi);
void  RouteRail_Judge(u8* LatiStr,u8* LongiStr);  

//  A.  Total  

void delay_us(u16 j)
{
	u8 i;
	  while(j--)
	  	{
	  	i=3;
	  	while(i--);
	  	}  
}

void delay_ms(u16 j )
{
  while(j--)
  	{
           DF_delay_us(2000); // 1000
  	} 
}

 u8  Do_SendGPSReport_GPRS(void)   
{  	
  unsigned short int crc_file=0;
  u16 count=0,str_len=0;
  u8 i=0;
  u8  reg_gps[30],reg_wr=0;  
  u8  packet_type = 0;
  
             // 1.  GNSS 详细数据上传---------------------------------------------------- 
           if((1==GNSS_rawdata.WorkEnable)&&(GNSS_rawdata.save_status))  
           	{
           	      if((GNSS_rawdata.save_status&(1<<GNSS_rawdata.rd_num))&&(GNSS_rawdata.SendFlag==1))   // 检查当前rd   数值状态
           	      	{
           	      	     str_len=strlen(GNSS_rawdata.Raw[GNSS_rawdata.rd_num]);
           	      	     // for(count=0;count<str_len;count++)
           	      	            // rt_kprintf("%c",GNSS_rawdata.Raw[GNSS_rawdata.rd_num][count]); 
           	      	      Stuff_GNSSRawData_0900H(GNSS_rawdata.Raw[GNSS_rawdata.rd_num],str_len);           
           	      	      //---------------------------
                           GNSS_rawdata.rd_num++;
			      if(GNSS_rawdata.rd_num>3)
				  	GNSS_rawdata.rd_num=0;
			      GNSS_rawdata.save_status&=~(1<<GNSS_rawdata.rd_num); //clear		 

				        GNSS_rawdata.SendFlag=0;
           	      	}
          		    	return true;	 
           	}
           //2.  鉴权--------------------------------------------------------------------
            if(DEV_Login.Operate_enable !=2) 
			 	{                  
				  if(1==DEV_Login.Enable_sd)
					  {
						Stuff_DevLogin_0102H();   //  鉴权   ==2 时鉴权完毕
						DEV_Login.Enable_sd=0;
						//------ 发送鉴权不判断 ------------------
						//DEV_Login.Operate_enable=2;  //  不用判断鉴权了   
						return true; 
					  }
			 	}
            // 3. 多媒体数据上传
            if(MediaObj.Media_transmittingFlag==2)
            {
			    if(1==MediaObj.SD_Data_Flag) 
			 	{
                                 Stuff_MultiMedia_Data_0801H();     
				     MediaObj.SD_Data_Flag=0; 
                                  return true;
			 	}
			   return true; // 按照808 协议要求 ，传输多媒体过程中不允许发送别的信息包
            } 
	     //  4.   终端注册		
            if(1==DEV_regist.Enable_sd) 
               {									
                  Stuff_RegisterPacket_0100H(0);   // 注册
                   JT808Conf_struct.Msg_Float_ID=0;
                  Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));   
		    DEV_regist.Enable_sd=0;
		  //  JT808Conf_struct.Regsiter_Status=1; //标注注册，但不存储	 	  
                return true;
               }
	     // 5.  终端注销		
            if(1==DEV_regist.DeRegst_sd)
            	{
            	  Stuff_DeviceDeregister_0101H(); 
                  DEV_regist.DeRegst_sd=0;		     		  
				  return true;
            	}
	     //  6.  终端心跳包		
            if((1==JT808Conf_struct.DURATION.Heart_SDFlag)&&(DataLink_Status())&&(SleepState==0)&&(stopNormal==0)) //  心跳
            	{
                  Stuff_DeviceHeartPacket_0002H();
                  JT808Conf_struct.DURATION.Heart_SDFlag=0;
				  JT808Conf_struct.DURATION.TCP_SD_state=1;  //发送完后置 1   
				  return true;  
            	} 
		// 7.  休眠时终端心跳包	
            if((1==SleepConfigFlag)&&(DataLink_Status())&&(SleepState==1)) //  休眠时心跳
            	{
                   Stuff_DevLogin_0102H();   //  鉴权   ==2 时鉴权完毕
                  rt_kprintf("\r\n	 休眠时用鉴权做心跳包 ! \r\n");  
                  SleepConfigFlag=0;  
				  return true;   
            	} 
            //  8.   定位数据批量上传 
            if(1==SD_ACKflag.f_BD_BatchTrans_0704H)  //  定位数据批量上传 
            	{
                     Stuff_BatchDataTrans_BD_0704H();  
                     SD_ACKflag.f_BD_BatchTrans_0704H=0;  
                     return true;
            	}
	      // 9.  中心拍照命令应答		
	     if(1==SD_ACKflag.f_BD_CentreTakeAck_0805H)   // 中心拍照命令应答
	     	{
                     Stuff_CentreTakeACK_BD_0805H();
                     SD_ACKflag.f_BD_CentreTakeAck_0805H=0;
			  return true;		  
	     	}
	    //   10.  终端属性上传	 
            if(1==SD_ACKflag.f_BD_DeviceAttribute_8107)  //  终端属性上传
            	{
            	        Stuff_DeviceAttribute_BD_0107H();
                      SD_ACKflag.f_BD_DeviceAttribute_8107=0;
			  return true;
            	}
	     //   11.  位置信息查询		
            if(1==SD_ACKflag.f_CurrentPosition_0201H)    // 位置信息查询
            	{
                  Stuff_Current_Data_0201H();
				  SD_ACKflag.f_CurrentPosition_0201H=0;
				  return true;
            	} 
	    //   12.   事件报告		
            if(1==SD_ACKflag.f_CurrentEventACK_0301H)   //  事件报告
            	{
                  Stuff_EventACK_0301H();
				  SD_ACKflag.f_CurrentEventACK_0301H=0;
				  return true;                  
            	}
		//  13. 提问应答 		            
	         if(2==ASK_Centre.ASK_SdFlag)      //  提问应答 
	             	{
	                  Stuff_ASKACK_0302H();
	                  ASK_Centre.ASK_SdFlag=0; 
	                  return true;  
	             	}             	
             	 // 14. 车辆应答控制
             if(1==Vech_Control.ACK_SD_Flag)   //  车辆应答控制
             	{
                  Stuff_ControlACK_0500H(); 
				  Vech_Control.ACK_SD_Flag=0;
		return true;
	}
	//  15.  行车记录仪数据上传
	     //------------ Error  state --------------
           if(Recode_Obj.Error)
           	{

               Stuff_RecoderACK_0700H_Error();
			   Recode_Obj.Error=0;
			   Recode_Obj.SD_Data_Flag = 0;
			   Recode_Obj.CountStep	= 0;
			     rt_kprintf("\r\n  记录仪CoutStepFlag=0--3 \r\n");
			   return true;
           	} 
    // ----------------  透传数据--------
    if(RawTrans_Com1.Enable_SD_Flag==1)
    {
        Stuff_DataTrans_0900_BD_Serial1();
        RawTrans_Com1.Enable_SD_Flag=0;
		return true; 
    }
	
    if(RawTrans_Com2.Enable_SD_Flag==1)
    {
        Stuff_DataTrans_0900_BD_Serial2();
        RawTrans_Com2.Enable_SD_Flag=0;
		return true; 
    }
		   
    //-----------------------------------------
	if((1==Recode_Obj.SD_Data_Flag)&&(1==Recode_Obj.CountStep))
	{
		//  1. clear   one  packet  flag
		switch( Recode_Obj.CMD )
		{
			/*                divide  not  stop    2013-6-20  */
			//----------------------------------------------------
			   case 0x08:
			   case 0x09:
			   case 0x10:
			   case 0x11:
			   case 0x12:
			   //case 0x15:
			 //---------------------------------------------------
			case 0x00:
		    case 0x01:
		    case 0x02:
		    case 0x03:	
		    case 0x04:
		    case 0x05:
		    case 0x06: 
			case 0x07:
			case 0x13:
			case 0x14:    //   上边是查询的

			 case 0x82: //	  中心设置车牌号  
			 case 0x83://  记录仪初次安装时间
			 case 0x84:// 设置信号量配置信息
			 case 0xC2: //设置记录仪时钟
			 case 0xC3: //车辆速度脉冲系数（特征系数）
			 case 0xC4: //   设置初始里程
			//------------------------
				Recode_Obj.SD_Data_Flag = 0;
				Recode_Obj.CountStep= 0;
				  rt_kprintf("\r\n  记录仪CoutStepFlag=0--2 \r\n");
				break;
			default:
				      break;
		}
		//  2.  stuff   recorder   infomation
		//  judge  packet  type
		if( Recode_Obj.Devide_Flag==1 )
		{
			packet_type = Packet_Divide;
		} else
		{
			packet_type = Packet_Normal;
		}  

		Stuff_RecoderACK_0700H( packet_type); //   行车记录仪数据上传
		
		rt_kprintf( "\r\n 记录仪 CMD_ID =0x%2X \r\n", Recode_Obj.CMD );
		if( packet_type == Packet_Divide )
		{
			rt_kprintf( "\r\n current =%d  Total: %d \r\n", Recode_Obj.Current_pkt_num, Recode_Obj.Total_pkt_num );
		}
		//  3. step  by  step  send   from  00H  ---  07H


		if( Recode_Obj.CountStep==1 )
		{
			Recode_Obj.CountStep=2;
			Recode_Obj.timer = 0;
			rt_kprintf( "\r\n 记录仪定时发送----CountStep"); 
		}

