nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
        return true;  
	  } 

        
		  // 16. 消息点播	 
			 if(SD_ACKflag.f_MsgBroadCast_0303H==1)  // 消息点播
			 	{
                   Stuff_MSGACK_0303H(); 
                   SD_ACKflag.f_MsgBroadCast_0303H=0;
                   return true;
			 	}
		 //17. 多媒体事件信息上传	 
			 if(1==MediaObj.SD_media_Flag)
			 	{
				   Stuff_MultiMedia_InfoSD_0800H();  // 多媒体事件信息上传
				   MediaObj.SD_media_Flag=0;
                   return true;    
			 	}	
		//  18.数据透传 做远程下载	 
             if(CAN_trans.canid_0705_sdFlag)
             	{ 
                  Stuff_CANDataTrans_BD_0705H();
		    CAN_trans.canid_0705_sdFlag=0; // clear 		   
               //   DataTrans_Init();     //clear 
                  return true;
             	} 	
		 // 19. 多媒体索引上报 	 
             if(SD_ACKflag.f_MediaIndexACK_0802H)
             	{
                   Stuff_MultiMedia_IndexAck_0802H();   // 多媒体索引上报 
                   SD_ACKflag.f_MediaIndexACK_0802H=0;
				   return true;
             	}	
		  // 20.驾驶员信息上报	 
		 if(SD_ACKflag.f_DriverInfoSD_0702H)
		{
			 	   Stuff_DriverInfoSD_0702H();  //  驾驶员信息上报
                   SD_ACKflag.f_DriverInfoSD_0702H=0;
                   return true;
		 }
		 //   21.电子运单 
	        if(SD_ACKflag.f_Worklist_SD_0701H)
		  {
			 	   Stuff_Worklist_0701H();  //   电子运单 
                   SD_ACKflag.f_Worklist_SD_0701H=0;
                   return true;
		  }
		//    22. 终端通用应答	
	        if(SD_ACKflag.f_CentreCMDack_0001H)
	         {
                               Stuff_DevCommmonACK_0001H();        
				   if(SD_ACKflag.f_CentreCMDack_0001H==2)  //  修改IP设置了需要重拨
				   	{   Close_DataLink();   rt_kprintf("\r\n Datalink end =>中心修改IP\r\n");  }  //  AT_END    
				   else	   
				   if(SD_ACKflag.f_CentreCMDack_0001H==3) //   远程复位
				   	{
                      Systerm_Reset_counter=Max_SystemCounter;
					//  reset();
					  ISP_resetFlag=2;    //   借助远程下载重启机制复位系统
				   	}
				   else
				   if(SD_ACKflag.f_CentreCMDack_0001H==5) //   关闭数据通信
				   	{
				   	   Close_DataLink();  
                                      Stop_Communicate();   
					   rt_kprintf("\r\n Datalink end =>关闭通信n\r\n"); 				  
				   	}				 
                               SD_ACKflag.f_CentreCMDack_0001H=0; 
				   SD_ACKflag.f_CentreCMDack_resualt=0;    

				    if(Stop_Dial==1)
				    	{
				    	      redial();
										 Stop_Dial=0; 
										 idip("clear"); 

				    	} 
				   
                   return true;    
				}  	 
		//  23.   查询终端参数	
	        if(SD_ACKflag.f_SettingPram_0104H)
	        	{
	        	  if(SD_ACKflag.f_SettingPram_0104H==1)
	        	      Stuff_SettingPram_0104H(SD_ACKflag.f_SettingPram_0104H);
				  else
				  if(SD_ACKflag.f_SettingPram_0104H==2)
				  	  Sub_stuff_AppointedPram_0106();     
				  
                   SD_ACKflag.f_SettingPram_0104H=0;    
				   return true;
	        	}	
              //  24 .  终端升级结果上报
              if(1==SD_ACKflag.f_BD_ISPResualt_0108H)
              	{
                                
				Stuff_ISP_Resualt_BD_0108H();
                           SD_ACKflag.f_BD_ISPResualt_0108H=0;
				return true;		   
              	}
		//  25.  IC 卡透传消息
		if((1==IC_MOD.Trans_0900Flag)&&(1==TCP2_Connect))
			{
                            Stuff_DataTrans_0900_BD_ICinfo(); 
				IC_MOD.Trans_0900Flag=0;			 
                            return true;
			} 
		//           位置数据上报  

		     //--------------------------------------------------------------------------------------
                   if(app_que_enable==1)
                   {
                           //--------save 				   
                         // if(PositionSD_Status()&&(DEV_Login.Operate_enable==2)&&((enable==BD_EXT.Trans_GNSS_Flag)||(DispContent==6))||(Current_UDP_sd&&PositionSD_Status()&&(DEV_Login.Operate_enable==2))||((DF_LOCK==enable)&&PositionSD_Status()&&(DEV_Login.Operate_enable==2)))	  //首次定位再发 
                          if(Current_UDP_sd&&PositionSD_Status())	  //首次定位再发 
				{
                        	      //  clear  flag
                        	      PositionSD_Disable();
				      Current_UDP_sd=0; 
				      // stuff   	 content
				      memset(app_rx.body,0,sizeof(app_rx.body));
				      app_rx.wr=Reg_save_gps(app_rx.body);    
				       //  send queue	   
                                   rt_mq_send(&mq_APPs, (void*)&app_rx,  app_rx.wr+2);    
				       AppQue.write_num++; 
					rt_kprintf("\r\n msg-save len=%d\r\n ", app_rx.wr);   
                        	}  
				  return true; 		  
                   }	   
		       //-----------------------------------------------------------------------------------
			// if((Current_SD_Duration<=10)||(Current_State==1))   // 调试时30  实际是10 Current_SD_Duration
			// {	
			if(stopNormal==2)  
				return  true;
			 if(PositionSD_Status()&&(DEV_Login.Operate_enable==2)&&((enable==BD_EXT.Trans_GNSS_Flag)||(DispContent==6))||(Current_UDP_sd&&PositionSD_Status()&&(DEV_Login.Operate_enable==2))||((DF_LOCK==enable)&&PositionSD_Status()&&(DEV_Login.Operate_enable==2)))	  //首次定位再发 
			   //  if((PositionSD_Status())&&(DataLink_Status())&&(DEV_Login.Operate_enable==2))	                                                                                                                     // DF  锁定发送当前位置信息  
		      {
		                  PositionSD_Disable();
				    Current_UDP_sd=0; 
                              //1.   时间超前判断
                              //if(Time_FastJudge()==false)
					//		return false;		
				  // 2. 			  
			 	   Stuff_Current_Data_0200H();  // 上报即时数据  				   
				   //----应答次数 ----		   
				  // ACKFromCenterCounter++; // 只关注应答报数，不关心应答时间 
				   //---------------------------------------------------------------------------------
                      if(SleepState==1)  	
					  {   
					      rt_kprintf("\r\n休眠时发送时间 %d-%d-%d %02d:%02d:%02d\r\n", time_now.year+2000, time_now.month, time_now.day, \
					      time_now.hour, time_now.min, time_now.sec); 
					  } 	
				   if(DispContent)	
					    rt_kprintf("\r\n 发送 GPS -current !\r\n");     
				   
