nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
 //-------------- 计算算平均速度 ----------------
 AvrgSpd_MintProcess(hour,min,sec); 
}


//---------  GGA --------------------------
void HDop_pro(u8 *tmpinfo)
{ 
 float dop;
 
  dop=atof((char *)tmpinfo);				        
  HDOP_value=dop;		 //  Hdop 数值

}

void  GPS_Delta_DurPro(void)    //告GPS 触发上报处理函数
{
    if(line_warn_enable==1)
	{	rt_kprintf("\r\n  %d-%d-%d %d:%d:%d %s",Temp_Gps_Gprs.Date[0],Temp_Gps_Gprs.Date[1],Temp_Gps_Gprs.Date[2],\
		Temp_Gps_Gprs.Time[0],Temp_Gps_Gprs.Time[1],Temp_Gps_Gprs.Time[2],gps_log); 
    	}
	
	 sprintf(Posit_Str.DateTime,"%d-%d-%d %d:%d:%d",Temp_Gps_Gprs.Date[0],Temp_Gps_Gprs.Date[1],Temp_Gps_Gprs.Date[2],\
		Temp_Gps_Gprs.Time[0],Temp_Gps_Gprs.Time[1],Temp_Gps_Gprs.Time[2]);
	 
	// rt_kprintf("\r\n  Datatime: %s |%s|%s|\r\n",Posit_Str.DateTime,Posit_Str.Lati_Str,Posit_Str.Longi_Str); 
	//warn_msg_sd();

  if(1==JT808Conf_struct.SD_MODE.DUR_TOTALMODE)   // 定时上报模式
  {
	 	//----- 上一包数据记录的时间
		fomer_time_seconds = ( u32 ) ( BakTime[0] * 60 * 60 ) + ( u32 ) ( BakTime[1] * 60 ) + ( u32 ) BakTime[2];  
		
		//-----  当前数据记录的时间
		tmp_time_secnonds = ( u32 ) ( CurrentTime[0] * 60 * 60 ) + ( u32 ) ( CurrentTime[1] * 60 ) + ( u32 )  CurrentTime[2];
		
		//一天86400秒
		
		if ( tmp_time_secnonds > fomer_time_seconds )
		{
				delta_time_seconds = tmp_time_secnonds - fomer_time_seconds;
				//systemTickGPS_Clear();
		}
		else if(tmp_time_secnonds < fomer_time_seconds)
		{
				delta_time_seconds = 86400 - fomer_time_seconds + tmp_time_secnonds;
				//systemTickGPS_Clear();
		}
		else 
		 {
			 // systemTickGPS_Set();  
			  UDP_dataPacket_flag=0X03; 
			  StatusReg_GPS_V();
		 }	
		
		if((SleepState==1)&&(delta_time_seconds==(Current_SD_Duration-5)))  //  --  休眠时 先发鉴权
		   {
			  SleepConfigFlag=1;  //发送前5 发送一包鉴权
		   }            
		
		if((delta_time_seconds >= Current_SD_Duration)&&(local_trig==0))//limitSend_idle 
		  {
             if( JT808Conf_struct.RT_LOCK.Lock_state==1)
             	{
             	          JT808Conf_struct.RT_LOCK.Lock_Dur+=Current_SD_Duration;
						   if(JT808Conf_struct.RT_LOCK.Lock_KeepCnter>JT808Conf_struct.RT_LOCK.Lock_KeepDur)
						   	{
							   Current_SD_Duration=30;
							   JT808Conf_struct.RT_LOCK.Lock_state=0;
							   Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
						   	} 
             	} 
		  
			  PositionSD_Enable();    
			  Current_UDP_sd=1;     // 每次都是即时上报
			  if(SleepState==1)
					  Current_UDP_sd=1;	 
			  memcpy(BakTime,CurrentTime,3); // update   

			 if(stopNormal==1) 
				{
				    gps_sd_coutner++;
				    rt_kprintf("\r\n %d    %d-%d-%d %d:%d:%d %s",gps_sd_coutner,Temp_Gps_Gprs.Date[0],Temp_Gps_Gprs.Date[1],Temp_Gps_Gprs.Date[2],\
					Temp_Gps_Gprs.Time[0],Temp_Gps_Gprs.Time[1],Temp_Gps_Gprs.Time[2],gps_log); 
			    	}
			else
				 gps_sd_coutner=0;
			 // rt_kprintf("\r\ntmp_time=%d,fomer_time=%d,delta_time=%d,Current=%d",tmp_time_secnonds,fomer_time_seconds,delta_time_seconds,Current_SD_Duration);
		  }
  	}  
  
    //------------------------------ do this every  second-----------------------------------------    
	memcpy((char*)&Gps_Gprs,(char*)&Temp_Gps_Gprs,sizeof(Temp_Gps_Gprs));  

   //------  电子围栏 判断  ----------
  /*  if((Temp_Gps_Gprs.Time[2]%20)==0) //   认证时不检测圆形电子围栏
    {
        CycleRail_Judge(Temp_Gps_Gprs.Latitude,Temp_Gps_Gprs.Longitude);
		//rt_kprintf("\r\n --- 判断圆形电子围栏");
    }	*/
    // if((Temp_Gps_Gprs.Time[2]==5)||(Temp_Gps_Gprs.Time[2]==25)||(Temp_Gps_Gprs.Time[2]==45)) //  
  //  if(Temp_Gps_Gprs.Time[2]%2==0)//    认证时要求2 秒
  // {
          RectangleRail_Judge(Temp_Gps_Gprs.Latitude,Temp_Gps_Gprs.Longitude);
		//rt_kprintf("\r\n -----判断矩形电子围栏"); 
//    }


if(line_warn_enable==1)    
            RouteLineWarn_judge(Temp_Gps_Gprs.Latitude,Temp_Gps_Gprs.Longitude);    

 /*	
      if((Temp_Gps_Gprs.Time[2]%3)==0) //     路线判断
    {
          // printf("\r\n --- 判断圆形电子围栏");
           RouteRail_Judge(Temp_Gps_Gprs.Latitude,Temp_Gps_Gprs.Longitude);
    }
 */  
	//rt_kprintf("\r\n Delta_seconds %d \r\n",delta_time_seconds);    
}

void local_time(void)
{ 
      	if(local_trig==1)    // 	GPS 时间
	{
           local_timer++;	  
	  
		if((SleepState==1)&&(local_timer==(Current_SD_Duration-5)))  //  --  休眠时 先发鉴权
		   {
			  SleepConfigFlag=1;  //发送前5 发送一包鉴权
		   }            
		
		if((local_timer >= Current_SD_Duration)&&(local_trig==0))//limitSend_idle
		  {
			  PositionSD_Enable();    
			 // if(SleepState==1)
			          Current_UDP_sd=1;	 
			  local_timer=0;// clear
			  
			    memcpy(BakTime,CurrentTime,3); // update   
			  rt_kprintf("\r\n-->local time trig\r\n");
		  }
	}	
} 

void  Exact_Test_time(void)
{
      	if(local_trig==2)    // 	GPS 时间 
	{
           local_timer++;	
	    if(local_timer>=9)  //900ms
	    	{
	    	   local_timer=0;
		   PositionSD_Enable();    
	           // if(SleepState==1)
	           Current_UDP_sd=1;	 
		    local_timer=0;// clear			  
		     memcpy(BakTime,CurrentTime,3); // update   	 
		     rt_kprintf("\r\n->DWJD-\r\n");    
	    	}

      	}
}

//----------------------------------------------------------------------------------------------------
void  SpeedSensorProcess(void)   // 通过汽车的速度传感器获得 速度 并计算里程
{
  u32  Distance_1s_m=0;  // 一秒钟运行 多少米
//  u32 sp=0;
  //  1. 用K值计算速度   -----------------------------------------------------------
     /*
           K 表示 每公里 脉冲数 
           1米/脉冲数 :   K/1000 
           Delta_1s_Plus: 每秒钟采集到的脉冲数    
           每秒行驶米数:  Delta_1s_Plus *1000/K
           => Delta_1s_Plus *1000/K*3.6*10 单位:0.1  km/h  =>Delta_1s_Plus *36000/K  单位:0.1 km/h
      */
    Speed_cacu=(Delta_1s_Plus*36000)/JT808Conf_struct.Vech_Character_Value;  // 通过计算得到的速度 
    GPS_speed=Speed_cacu;  //把计算得到的传感器速度给 协议 寄存器
    Distance_1s_m=(Delta_1s_Plus*1000)/JT808Conf_struct.Vech_Character_Value;  // 每秒运行多少米
  // 2. 计算里程相关  -------------------------------------------------------------
          //------------------------------------
		ModuleStatus|=Status_Pcheck;	
		 
   
		  //------- GPS  里程计算  -------- 
		  JT808Conf_struct.Distance_m_u32+=Distance_1s_m;	// 除以3600 是m/s 
		  if(JT808Conf_struct.Distance_m_u32>0xFFFFFF)
				   JT808Conf_struct.Distance_m_u32=0;	   //里程最长这么多米	   

