nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
}

u8  Reg_save_gps(u8 *instr)
{
    u8  wr=0;
   				   // 1. 告警状态   4 Bytes
				   memcpy( ( char * ) instr + wr, ( char * )Warn_Status,4 );   
				   wr += 4;  
                              // 2. 车辆状态   4 Bytes
				   memcpy( ( char * ) instr + wr, ( char * )Car_Status,4 );   
				   wr += 4; 
				   // 3.   纬度     4 Bytes
				   memcpy( ( char * ) instr + wr, ( char * )Gps_Gprs.Latitude, 4 );//纬度   modify by nathan
				   wr += 4;
				   // 4.   经度     4 Bytes
				   memcpy( ( char * ) instr + wr, ( char * )  Gps_Gprs.Longitude, 4 );	 //经度    东经  Bit 7->0	西经 Bit 7 -> 1
				   wr += 4;
				   // 5.  高度	  2 Bytes    m
				   instr[wr++]=(GPS_Hight>>8);	// High 			   
				   instr[wr++]=(u8)GPS_Hight;  // Low  
				   // 6.  速度	  2 Bytes     0.1Km/h
				   instr[wr++]=(Speed_gps>>8);	// High 			   
				   instr[wr++]=(u8)Speed_gps;  // Low 
				   // 7.  方向	  2 Bytes	    1度 				   
				   instr[wr++]=(GPS_direction>>8);	//High
				   instr[wr++]=GPS_direction; // Low				   
				   // 8.  日期时间	  6 Bytes 
				    instr[wr++]=(((Gps_Gprs.Date[0])/10)<<4)+((Gps_Gprs.Date[0])%10);  	   	
				   instr[wr++]=((Gps_Gprs.Date[1]/10)<<4)+(Gps_Gprs.Date[1]%10); 
				   instr[wr++]=((Gps_Gprs.Date[2]/10)<<4)+(Gps_Gprs.Date[2]%10);
				   instr[wr++]=((Gps_Gprs.Time[0]/10)<<4)+(Gps_Gprs.Time[0]%10);
				   instr[wr++]=((Gps_Gprs.Time[1]/10)<<4)+(Gps_Gprs.Time[1]%10);
				   instr[wr++]=((Gps_Gprs.Time[2]/10)<<4)+(Gps_Gprs.Time[2]%10);    

				   return wr;

}

void  App_mq_Read_Process(void)
{
      char ch;  
//-----------------------------------------------------
	rt_err_t	res;

	   if(AppQue.sd_enable_flag==0) 
	   {
	          res = rt_mq_recv( &mq_APPs,(void*)&Rx_reg, 30, RT_TICK_PER_SECOND/50 ); //等待100ms,实际上就是变长的延时,最长100ms
		  if(res== RT_EOK )                                                       //收到一包数据 
		  {  
		             	rt_kprintf("\r\n app msg  wr=%d  rd=%d \r\n",AppQue.write_num,AppQue.read_num);   
				Stuff_AppMq_Data_0200H(Rx_reg.body); 
				AppQue.sd_enable_flag=1; 
				AppQue.abnormal_counter=0; 
		  }  
	   } 

}

void App_mq_NoAck_counter(void)  // Que  方式下 没有新的应答超时判断
{
    if((AppQue.sd_enable_flag==1)&&(AppQue.read_num!=AppQue.write_num))
    	{
             AppQue.abnormal_counter++;
	      if(AppQue.abnormal_counter>=4)  // 2s 
	      	{
	      	    AppQue.abnormal_counter=0;
		    AppQue.re_send_flag=1;
	      	}
    	}

}

u8  App_mq_Resend(void)    // 启动Queue 重发
{
         if(AppQue.re_send_flag==1)
         {
              rt_kprintf("\r\n + msg_resend ->app msg  wr=%d  rd=%d \r\n",AppQue.write_num,AppQue.read_num);  
              Stuff_AppMq_Data_0200H(Rx_reg.body);  
              AppQue.re_send_flag=2;  // enable   wait for  Ack
		  return true;	  	   
           }
	  else	 
	         return false;	
}

void  RAW_TransInit(void)
{
   RawTrans_Com1.datalen=0;
   RawTrans_Com1.Enable_SD_Flag=0;
   RawTrans_Com1.TYPE=0;

   
   RawTrans_Com2.datalen=0;
   RawTrans_Com2.Enable_SD_Flag=0;
   RawTrans_Com2.TYPE=0; 

}

//----------------------------------------------------------------------
u8  Protocol_Head(u16 MSG_ID, u8 Packet_Type)
{
    u16  CurrentID=0; 
     //----  clear --------------
       Original_info_Wr=0;
	//	1. Head  
	
	    //  original info
	   Original_info[Original_info_Wr++]=(MSG_ID>>8); // 消息ID 
	   Original_info[Original_info_Wr++]=(u8)MSG_ID;
	   
	   Original_info[Original_info_Wr++]=0x00; // 分包、加密方式、状态位 
	   Original_info[Original_info_Wr++]=28; // 消息体长度   位置信息长度为28个字节
	   
	   memcpy(Original_info+Original_info_Wr,SIM_code,6); // 终端手机号 ，设备标识ID	BCD
	   Original_info_Wr+=6;  


    switch(Recode_Obj.CMD)
    {
        case 0x08:CurrentID=0x8000+Recode_Obj.Current_pkt_num;
			      Original_info[Original_info_Wr++]   = ( CurrentID>> 8 ); 					  //消息流水号
				  Original_info[Original_info_Wr++]   =CurrentID;
			       break;
		case 0x09:CurrentID=0x9000+Recode_Obj.Current_pkt_num;
					Original_info[Original_info_Wr++]	= ( CurrentID>> 8 );					//消息流水号
					Original_info[Original_info_Wr++]	=CurrentID;

                   break;
		case 0x10:
			       CurrentID=0xA000+Recode_Obj.Current_pkt_num;
				   Original_info[Original_info_Wr++]   = ( CurrentID>> 8 ); 				   //消息流水号
				   Original_info[Original_info_Wr++]   =CurrentID;

			       break;
		case 0x11:
			       CurrentID=0xB000+Recode_Obj.Current_pkt_num;
				   Original_info[Original_info_Wr++]   = ( CurrentID>> 8 ); 				   //消息流水号
				   Original_info[Original_info_Wr++]   =CurrentID;
			       break;
		case 0x12:
			       CurrentID=0xC000+Recode_Obj.Current_pkt_num;
				   Original_info[Original_info_Wr++]   = ( CurrentID>> 8 ); 				   //消息流水号
				   Original_info[Original_info_Wr++]   =CurrentID;
			       break;
		case  0x15:
			      CurrentID=0xD000+Recode_Obj.Current_pkt_num;
			      Original_info[Original_info_Wr++]   = ( CurrentID>> 8 ); 					  //消息流水号
				  Original_info[Original_info_Wr++]   =CurrentID;
 
				   break;  
		default:	
			      
				  Original_info[Original_info_Wr++]   = ( JT808Conf_struct.Msg_Float_ID >> 8 ); 					  //消息流水号
				  Original_info[Original_info_Wr++]   = JT808Conf_struct.Msg_Float_ID;
				  break;

    } 


       if(Packet_Type==Packet_Divide) 
       	{
            switch (MediaObj.Media_Type)
	         {
		          case 0 : // 图像
		                  MediaObj.Media_totalPacketNum=Photo_sdState.Total_packetNum;  // 图片总包数
						  MediaObj.Media_currentPacketNum=Photo_sdState.SD_packetNum;  // 图片当前报数
						  MediaObj.Media_ID=1;   //  多媒体ID
						  MediaObj.Media_Channel=Camera_Number;  // 图片摄像头通道号
				          break;
				  case 1 : // 音频
						  MediaObj.Media_totalPacketNum=Sound_sdState.Total_packetNum;	// 音频总包数
						  MediaObj.Media_currentPacketNum=Sound_sdState.SD_packetNum;  // 音频当前报数
						  MediaObj.Media_ID=1;	 //  多媒体ID
						  MediaObj.Media_Channel=1;  // 音频通道号   

				          break;
				  case 2 : // 视频
						  MediaObj.Media_totalPacketNum=Video_sdState.Total_packetNum;	// 视频总包数
						  MediaObj.Media_currentPacketNum=Video_sdState.SD_packetNum;  // 视频当前报数
						  MediaObj.Media_ID=1;	 //  多媒体ID
						  MediaObj.Media_Channel=1;  // 视频通道号 
				          break;
				  case	3:																					  //行车记录仪
							  MediaObj.Media_totalPacketNum   = Recode_Obj.Total_pkt_num;							  // 记录仪总包数
							  MediaObj.Media_currentPacketNum = Recode_Obj.Current_pkt_num; 						  // 记录仪当前报数
						  
							  break; 
				  		  
				  default:
				  	      return false;
		         }
			 
			 Original_info[Original_info_Wr++]=(MediaObj.Media_totalPacketNum&0xff00)>>8;//总block
			 Original_info[Original_info_Wr++]=(u8)MediaObj.Media_totalPacketNum;//总block
			 
			 
			 Original_info[Original_info_Wr++]=((MediaObj.Media_currentPacketNum)&0xff00)>>8;//当前block
			 Original_info[Original_info_Wr++]=(u8)((MediaObj.Media_currentPacketNum)&0x00ff);//当前block

