nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
       	}  
	    return true;

}  

void Protocol_End(u8 Packet_Type,u8 LinkNum)   
{                   
 u16 packet_len=0;  
 u16  i=0;		//要发送的UDP 数据内容的长度
 u8   Gfcs=0;
 u16   Msg_bodyLen=0; //  协议里的消息只表示消息体     不包含消息头 消息头默认长度是12 , 分包消息头长度 20   
 
   Gfcs=0;				   //  计算从消息头开始到校验前数据的异或和  808协议校验  1Byte
   //---  填写信息长度 ---
   if(Packet_Normal==Packet_Type)
   {
     Msg_bodyLen=Original_info_Wr-12;
     Original_info[2]=(Msg_bodyLen>>8) ;
     Original_info[3]=Msg_bodyLen;
   }
   else
    if(Packet_Divide==Packet_Type)
   {
     Msg_bodyLen=Original_info_Wr-16;
	// rt_kprintf("\r\n Divide Infolen=%d  \r\n",Msg_bodyLen);  
     Original_info[2]=(Msg_bodyLen>>8)|0x20 ;  // Bit 13  0x20 就是Bit 13
     Original_info[3]=Msg_bodyLen;  
   }
   //---- 计算校验  -----
   for(i=0;i<Original_info_Wr;i++)  
		Gfcs^=Original_info[i]; 
   Original_info[Original_info_Wr++]=Gfcs;  // 填写G校验位     


  // 1.stuff start
   GPRS_infoWr_Tx=0;	
   GPRS_info[GPRS_infoWr_Tx++]=0x7e;   // Start 标识位
    if(Packet_Divide==Packet_Type)
   {   
       //rt_kprintf("\r\n Tx=%d  Divide Infolen=%d  \r\n",GPRS_infoWr_Tx,Original_info_Wr);   
	  /* rt_kprintf("\r\n PacketContent: ");
				   for(i=0;i<Original_info_Wr;i++)
                       rt_kprintf(" %X",Original_info[i]);    
				   rt_kprintf("\r\n");
	  */
   }
  // 2.  convert 
   packet_len=Protocol_808_Encode(GPRS_info+GPRS_infoWr_Tx,Original_info,Original_info_Wr);
   GPRS_infoWr_Tx+=packet_len;	   
    if(Packet_Divide==Packet_Type)
   {
	 //rt_kprintf("\r\n Divide  Send Infolen=%d  \r\n",packet_len);  
	 
	/* rt_kprintf("\r\n EncodeContent: ");
	 for(i=0;i<packet_len;i++)
                       rt_kprintf(" %X",GPRS_info[i+1]);      
	rt_kprintf("\r\n"); 
	*/
	//rt_kprintf("\r\n GPRStx  Send Infolen=%d  \r\n",GPRS_infoWr_Tx+1);    
   }
   GPRS_info[GPRS_infoWr_Tx++]=0x7e;  //  End  标识
  //  4. Send   

    // 4.1 发送信息内容1
     if(DispContent==2)
	 {
	    rt_kprintf("\r\n App to GSM info:");    
	    for(i=0;i<GPRS_infoWr_Tx;i++)
			 rt_kprintf(" %02X",GPRS_info[i]);  
		rt_kprintf("\r\n"); 
	 }
    // 4.2   MsgQueue
    WatchDog_Feed();
   Gsm_rxAppData_SemRelease(GPRS_info,GPRS_infoWr_Tx,LinkNum);  
   //--------消息序号 递增 --------
   JT808Conf_struct.Msg_Float_ID++;   
  //------------------------------  
} 

//--------------------------------------------------------------------------------------
u8  Stuff_DevCommmonACK_0001H(void)      
{    
	// 1. Head
	  if(!Protocol_Head(MSG_0x0001,Packet_Normal))  return false;     //终端通用应答
	 // 2. content  is null 
	   //   float ID
	    Original_info[Original_info_Wr++]=(u8)(Centre_FloatID>>8);
	    Original_info[Original_info_Wr++]=(u8)Centre_FloatID;
	    //  cmd  ID
	    Original_info[Original_info_Wr++]=(u8)(Centre_CmdID>>8);
	    Original_info[Original_info_Wr++]=(u8)Centre_CmdID;   
		//   resualt
	    Original_info[Original_info_Wr++]=SD_ACKflag.f_CentreCMDack_resualt;
	 //  3. Send 
	 Protocol_End(Packet_Normal ,0);
	  if(DispContent)
	      rt_kprintf("\r\n	Common CMD ACK! \r\n");  
	 return true;    
}


//其中，  key  为终端产生私钥也就是终端制造商 ID，M1、IA1、IC1 为平台根据终端厂商分配的认证密钥
u8  encrypt_lock2_encode( u32 key,  u32  M1,  u32  IA1,  u32 IC1,  unsigned char *buf, u32 len )
{ 
    u32 mkey=0;  
    int i =0 ;
  
	if ( key == 0 ) key = 1 ;
	// 处理加密
	mkey = M1;
	if (0==mkey) mkey=1;
	// 开始加密处理
	while ( i < len )
	{
		key = IA1*( key%mkey) + IC1 ;
		buf[i++] ^= (unsigned char)( (key>>20) & 0xFF );
	}
	return true ;
}


u8  Stuff_AccountPacket_0110H(u8  LinkNum,u8 data)  
{
	u8  i=0;
	u16  start_jiami = 0;
	u32 len_jiami = 0;
	//u8  end_jiami;
// 1. Head
  if(!Protocol_Head(MSG_0x0110,Packet_Normal)) 
 	return false; 
 	 //加密标识
 	Original_info[Original_info_Wr++]=data;  
 	 //加密密钥               
    Original_info[Original_info_Wr++] = 0x00;     // 70420                
    Original_info[Original_info_Wr++] = 0x01;
    Original_info[Original_info_Wr++] = 0x13;
    Original_info[Original_info_Wr++] = 0x14;
	//车主联系号码
    start_jiami=Original_info_Wr;  //  加密信息起始地址
    memcpy(Original_info+Original_info_Wr,"15122865297",11);  
    Original_info_Wr+=11;
	Original_info[Original_info_Wr++] =0x00;  //  补齐12   位
    //省域ID
    Original_info[Original_info_Wr++]= 1 ; //(u8)(JT808Conf_struct.Vechicle_Info.Dev_ProvinceID>>8);
    Original_info[Original_info_Wr++]= 0x10 ; //(u8)JT808Conf_struct.Vechicle_Info.Dev_ProvinceID;
   //县市域ID
    Original_info[Original_info_Wr++]=(u8)(1010>>8);
    Original_info[Original_info_Wr++]=(u8)1010;
    //制造商ID
    memcpy(Original_info+Original_info_Wr,"70420",5);                           
    Original_info_Wr+=5;
    //终端型号20个字节位数不足的后补0
    memcpy(Original_info+Original_info_Wr,"TW703",5);  
    Original_info_Wr+=5;      
    for(i=0;i<15;i++)
    {
		Original_info[Original_info_Wr++]=0x00;		
	}
    // 终端ID   7 Bytes      
    memcpy(Original_info+Original_info_Wr,IMSI_CODE+8,7);    
    Original_info_Wr+=7; 
    //车牌颜色
    Original_info[Original_info_Wr++]=2;//  2  黄色JT808Conf_struct.Vechicle_Info.Dev_Color;
    //车牌号码
	//车牌
	memcpy(Original_info+Original_info_Wr,JT808Conf_struct.Vechicle_Info.Vech_Num,9);  
	Original_info_Wr+=9;
    //车辆vin
    memcpy(Original_info+Original_info_Wr,JT808Conf_struct.Vechicle_Info.Vech_VIN,17);
	Original_info_Wr+=17;
	// 获取加密信息长度 
	len_jiami =Original_info_Wr-start_jiami;//strlen(Original_info)-start_jiami+1;
	rt_kprintf("wo yao kai hu le ......"); 
	if(0x00 != data)//是否加密(不执行这个函数就正常)
		{ 
		    OutPrint_HEX("加密前信息",Original_info+start_jiami,len_jiami);
		                        // key      M1            IA1          IC1
			encrypt_lock2_encode(70420,22185791,23898412,87946901,Original_info+start_jiami,len_jiami);
			OutPrint_HEX("加密后信息",Original_info+start_jiami,len_jiami);
		}
	rt_kprintf("yi jing kai hu le ......"); 
	//  3. Send 
    Protocol_End(Packet_Normal,LinkNum);
}


//-------------------------------------------------------------------------
u8  Stuff_RegisterPacket_0100H(u8  LinkNum)  
{  
  u8  i=0;
// 1. Head
  if(!Protocol_Head(MSG_0x0100,Packet_Normal)) 
 	return false; 	
    
  // 2. content 
    //  province ID
    Original_info[Original_info_Wr++]=0x00;//(u8)(JT808Conf_struct.Vechicle_Info.Dev_ProvinceID>>8);
    Original_info[Original_info_Wr++]=10;;//(u8)JT808Conf_struct.Vechicle_Info.Dev_ProvinceID;
    //  county  ID
    Original_info[Original_info_Wr++]=(u8)(1010>>8);
    Original_info[Original_info_Wr++]=(u8)1010;   
	//  product Name	
    memcpy(Original_info+Original_info_Wr,"70420",5);   
    Original_info_Wr+=5;
	//  终端型号 20 Bytes      -- 补充协议里做更改
	memcpy(Original_info+Original_info_Wr,"TW703",5);  
    Original_info_Wr+=5;      
    for(i=0;i<15;i++)
	 Original_info[Original_info_Wr++]=0x00;	 
    //  终端ID   7 Bytes    ,    
    memcpy(Original_info+Original_info_Wr,IMSI_CODE+8,7);    
    Original_info_Wr+=7;  
	//  车牌颜色  
	Original_info[Original_info_Wr++]=JT808Conf_struct.Vechicle_Info.Dev_Color;
	
	if(JT808Conf_struct.Vechicle_Info.Dev_Color!=0)
	{
		//  车牌
		memcpy(Original_info+Original_info_Wr,JT808Conf_struct.Vechicle_Info.Vech_Num,13);  
		Original_info_Wr+=13;
	}
	else
	{
	       rt_kprintf("\r\n  车辆颜色:0     Need Vin\r\n");
		// 车辆VIN 
		memcpy(Original_info+Original_info_Wr,JT808Conf_struct.Vechicle_Info.Vech_VIN,17);
		Original_info_Wr+=17;
    }

 
 //  3. Send 
  Protocol_End(Packet_Normal,LinkNum);   
  if(DispContent)
  {      
       rt_kprintf("\r\n	SEND Reigster Packet! \r\n");  
	 rt_kprintf("\r\n  注册发送时间 %d-%d-%d %02d:%02d:%02d\r\n", time_now.year+2000, time_now.month, time_now.day, \
      time_now.hour, time_now.min, time_now.sec);
   

