nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
  }

 
 //  3. Send 
  Protocol_End(Packet_Normal,LinkNum);   
  if(DispContent)
 rt_kprintf("\r\n	SEND Reigster Packet! \r\n");  
 return true;  

}
//--------------------------------------------------------------------------------------
u8  Stuff_DeviceHeartPacket_0002H(void)      
{  
  
	// 1. Head
	if(!Protocol_Head(MSG_0x0002,Packet_Normal))  
 	  return false; 
	 // 2. content  is null
	 
	 //  3. Send 
	 Protocol_End(Packet_Normal ,0);
	  if(DispContent)
	 rt_kprintf("\r\n	Send Dev Heart! \r\n");    
	 return true;  

}
//--------------------------------------------------------------------------------------
u8  Stuff_DeviceDeregister_0101H(void)      
{    
	// 1. Head
	if(!Protocol_Head(MSG_0x0003,Packet_Normal)) 
 	  return false; //终端注销 
	 // 2. content  is null 
	 //  3. Send 
	 Protocol_End(Packet_Normal ,0);
	  if(DispContent)
	 rt_kprintf("\r\n	Deregister  注销! \r\n");  
	 return true;    
}
//------------------------------------------------------------------------------------
u8  Stuff_DevLogin_0102H(void)      
{    
	// 1. Head
	if(!Protocol_Head(MSG_0x0102,Packet_Normal))  
 	  return false; //终端鉴权 
	 // 2. content  
	  
	 memcpy(Original_info+Original_info_Wr,JT808Conf_struct.ConfirmCode,strlen((const char*)JT808Conf_struct.ConfirmCode));   // 鉴权码  string Type
	 Original_info_Wr+=strlen((const char*)JT808Conf_struct.ConfirmCode); 
	 //  3. Send 
	 Protocol_End(Packet_Normal ,0);
	  if(DispContent)
	 rt_kprintf("\r\n	 发送鉴权! \r\n");   
	 return true;    
}

//--------------------------------------------------------------------------------------
u8  Stuff_Normal_Data_0200H(void)   
{
   u8 status=0,U8_STUFF=0;
  u8 spd_sensorReg[2];
  u32  Dis_01km=0;
 //  1. Head  
   if(!Protocol_Head(MSG_0x0200,Packet_Normal)) 
 	  return false;    
 // 2. content 
 if(Api_cycle_read(Original_info+Original_info_Wr, 31)==false)            
   return false;
 Original_info_Wr+=28;   // 内容只有28 
 memcpy(spd_sensorReg,Original_info+Original_info_Wr,2);// 把读取传感器速度 
 

	//----------- 附加信息  ------------
    //  附加信息 1  -----------------------------    
	//	附加信息 ID
	Original_info[Original_info_Wr++]=0x03; // 行驶记录仪的速度
	//	附加信息长度
	Original_info[Original_info_Wr++]=2;
	//	类型
	Original_info[Original_info_Wr++]=(u8)(Speed_cacu>>8); 
	Original_info[Original_info_Wr++]=(u8)(Speed_cacu);	     
	//rt_kprintf("\r\n GPS速度=%d km/h , 传感器速度=%d km/h\r\n",Speed_gps,Speed_cacu); 
     //  附加信息 2  -----------------------------	  
	 //  附加信息 ID
	 Original_info[Original_info_Wr++]=0x01; // 车上的行驶里程
	 //  附加信息长度
	 Original_info[Original_info_Wr++]=4; 
	 //  类型
	 Dis_01km=JT808Conf_struct.Distance_m_u32/100;
	 Original_info[Original_info_Wr++]=(Dis_01km>>24); 
	 Original_info[Original_info_Wr++]=(Dis_01km>>16); 
	 Original_info[Original_info_Wr++]=(Dis_01km>>8); 
	 Original_info[Original_info_Wr++]=Dis_01km; 
  
   
	//  附加信息 3 
  if(Warn_Status[1]&0x10) 
   {
       //  附加信息 ID
       Original_info[Original_info_Wr++]=0x12; //  进出区域/路线报警
        //  附加信息长度 
         Original_info[Original_info_Wr++]=6;
	 //  类型
	 Original_info[Original_info_Wr++]=InOut_Object.TYPE;
	 Original_info[Original_info_Wr++]=(InOut_Object.ID>>24);
	 Original_info[Original_info_Wr++]=(InOut_Object.ID>>16);
	 Original_info[Original_info_Wr++]=(InOut_Object.ID>>8);
	 Original_info[Original_info_Wr++]=InOut_Object.ID;
	 Original_info[Original_info_Wr++]=InOut_Object.InOutState;  
	 rt_kprintf("\r\n ----- 0x0200 current 附加信息 \r\n");    
   }

    //  附件信息4
    if(Warn_Status[3]&0x02)
    {      
	  //  附加信息 ID
	  Original_info[Original_info_Wr++]=0x11; //  进出区域/路线报警
	  //  附加信息长度 
	  Original_info[Original_info_Wr++]=1; 
	  //  类型
	  Original_info[Original_info_Wr++]=0; //  无特定位置   

    }
     // 5. 附加信息 
       Original_info[Original_info_Wr++]=0x25; //ID  扩展车辆信号状态位
       Original_info[Original_info_Wr++]=4;//LEN
	Original_info[Original_info_Wr++]=0x00;
       Original_info[Original_info_Wr++]=0x00;
	Original_info[Original_info_Wr++]=0x00;
	Original_info[Original_info_Wr++]=BD_EXT.Extent_IO_status; 
     //6. 附加信息  :
	//  附加信息 7  -----------------------------	  
	 //  附加信息 ID
	 Original_info[Original_info_Wr++]=0x2B; //模拟量
	 //  附加信息长度
	 Original_info[Original_info_Wr++]=4; 
	 //  类型
	 Original_info[Original_info_Wr++]= (AD_2through[1]>>8);  // AD1 
	 Original_info[Original_info_Wr++]=AD_2through[1];  
         Original_info[Original_info_Wr++]= (AD_2through[0]>>8);  // AD0 
	 Original_info[Original_info_Wr++]=AD_2through[0];   
       //  附加信息 8  -----------------------------	  
	 //  附加信息 ID
	 Original_info[Original_info_Wr++]=0x30; //无线通信网络信号强度
	 //  附加信息长度
	 Original_info[Original_info_Wr++]=1; 
	 //  类型
	 Original_info[Original_info_Wr++]=ModuleSQ; 

	 //  附加信号 9  ---------------------------------
	 Original_info[Original_info_Wr++]= 0x31; // GNSS 定位卫星颗数 
	 Original_info[Original_info_Wr++]=1;  // len
	 Original_info[Original_info_Wr++]=Satelite_num;

	    //  附加信号 10  ---------------------------------
	 Original_info[Original_info_Wr++]= 0x02; // 油量信息
	 Original_info[Original_info_Wr++]=2;  // len
	 Original_info[Original_info_Wr++]=(Oil_volum>>8);  
	 Original_info[Original_info_Wr++]=(Oil_volum);  

	 
     //  附加信号 11  ----------------------------------
     if(SleepState==1)
      {
          Original_info[Original_info_Wr++]= 0x2A; // I/O 状态
	      Original_info[Original_info_Wr++]=2;  // len
	      Original_info[Original_info_Wr++]=(Sleep_IO_state>>8);  
	      Original_info[Original_info_Wr++]=(Sleep_IO_state);   
      }
	
	 
 //  3. Send 
 Protocol_End(Packet_Normal ,0);


 return true; 

}
u8  Stuff_AppMq_Data_0200H(u8 *instr)   
{
   u8 status=0,U8_STUFF=0;
  u32  Dis_01km=0;
 //  1. Head  
   if(!Protocol_Head(MSG_0x0200,Packet_Normal)) 
 	  return false;    
 // 2. content 
    memcpy(Original_info+Original_info_Wr,instr,28);            
    Original_info_Wr+=28;   // 内容只有28 
 

	//----------- 附加信息  ------------
    //  附加信息 1  -----------------------------    
	//	附加信息 ID
	Original_info[Original_info_Wr++]=0x03; // 行驶记录仪的速度
	//	附加信息长度
	Original_info[Original_info_Wr++]=2;
	//	类型
	Original_info[Original_info_Wr++]=(u8)(Speed_cacu>>8); 
	Original_info[Original_info_Wr++]=(u8)(Speed_cacu);	     
	//rt_kprintf("\r\n GPS速度=%d km/h , 传感器速度=%d km/h\r\n",Speed_gps,Speed_cacu); 
     //  附加信息 2  -----------------------------	  
	 //  附加信息 ID
	 Original_info[Original_info_Wr++]=0x01; // 车上的行驶里程
	 //  附加信息长度
	 Original_info[Original_info_Wr++]=4; 
	 //  类型
	 Dis_01km=JT808Conf_struct.Distance_m_u32/100;
	 Original_info[Original_info_Wr++]=(Dis_01km>>24); 
	 Original_info[Original_info_Wr++]=(Dis_01km>>16); 
	 Original_info[Original_info_Wr++]=(Dis_01km>>8); 
	 Original_info[Original_info_Wr++]=Dis_01km;   
  
   
