nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
 return true; 

}

u8 Paramater_0106_stuff(u32 cmdid, u8 *deststr)
{
    u8  reg_str[30];
	 u32  reg_u32=0;
	
   switch (cmdid)
   	{
		   //	参数列表
		case  MSG_0x0001:   
			  //  A.1 心跳包间隔   
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x01;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.Heart_Dur>>24);   // 参数值 
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.Heart_Dur>>16);
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.Heart_Dur>>8);
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.Heart_Dur);	 
			break;
	    case  MSG_0x0002:
			 //  A.2 TCP  消息应答间隔	 
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x02;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.TCP_ACK_Dur>>24);	 // 参数值 
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.TCP_ACK_Dur>>16);
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.TCP_ACK_Dur>>8);
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.TCP_ACK_Dur);	   
			  break;
	   case  MSG_0x0003:
			   //  A.3 TCP	消息重传次数   
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x03;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.TCP_ReSD_Num>>24);   // 参数值 
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.TCP_ReSD_Num>>16);
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.TCP_ReSD_Num>>8);
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.TCP_ReSD_Num); 		
	         break;
	   case  0x0004:
				  //  A.4	UDP 应答超时
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				  Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x04;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=(5>>24);	 // 参数值 
			Original_info[Original_info_Wr++]=(5>>16);
			Original_info[Original_info_Wr++]=(5>>8);
			Original_info[Original_info_Wr++]=(5);		
	         break;
	   case  0x0005:		   
				  //  A.5	UDP 重传次数
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				  Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x05;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.UDP_ReSD_Num>>24);   // 参数值 
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.UDP_ReSD_Num>>16);
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.UDP_ReSD_Num>>8);
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.UDP_ReSD_Num); 		
	        break;
	   case 0x0006:			   
				  //  A.6	SMS消息应答超时时间
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				  Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x06;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=0;   // 参数值 
			Original_info[Original_info_Wr++]=0;
			Original_info[Original_info_Wr++]=0;
			Original_info[Original_info_Wr++]=5;		
	         break;
	   case  0x0007:    
	
				  //  A.7	SMS 消息重传次数
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				  Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x07;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=0;   // 参数值 
			Original_info[Original_info_Wr++]=0;
			Original_info[Original_info_Wr++]=0;
			Original_info[Original_info_Wr++]=3;	
			break;
	   case  0x0010:
				 //   A.8  APN 字符串
				 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x10;
			Original_info[Original_info_Wr++]=strlen((const char*)APN_String); // 参数长度
			memcpy( ( char * ) Original_info+ Original_info_Wr, ( char * )APN_String,strlen((const char*)APN_String)); // 参数值
			Original_info_Wr+=strlen((const char*)APN_String);
	        break;
	   case 0x0011:		
				   //	A.9  APN 用户名
				 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x11;
			Original_info[Original_info_Wr++]=4; // 参数长度
			memcpy( ( char * ) Original_info+ Original_info_Wr, "user",4); // 参数值
			Original_info_Wr+=4;
	        break;
	   case 0x0012:		
				   //	A.10  APN 密码
				 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x12;
			Original_info[Original_info_Wr++]=4; // 参数长度
			memcpy( ( char * ) Original_info+ Original_info_Wr, "user",4); // 参数值
			Original_info_Wr+=4;
	        break;
       case 0x0013:			
				 //   A.11	 主服务器IP    
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				  Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x13;    
													 // 参数长度		
	
		   memset(reg_str,0,sizeof(reg_str));	  //  填写域名
		   memcpy(reg_str,"jt1.gghypt.net",strlen((char const*)"jt1.gghypt.net"));
		 // memcpy(reg_str,"fde.0132456.net",strlen((char const*)"jt1.gghypt.net"));
		   Original_info[Original_info_Wr++]=strlen((const char*)reg_str);
			  memcpy( ( char * ) Original_info+ Original_info_Wr, ( char * )reg_str,strlen((const char*)reg_str));	// 参数值	 
		   Original_info_Wr+=strlen((const char*)reg_str);
	       break;
	   case 0x0014:	   
					 //   A.12	 BAK  APN 字符串
				 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x14;
			Original_info[Original_info_Wr++]=strlen((const char*)"UNINET"); // 参数长度
			memcpy( ( char * ) Original_info+ Original_info_Wr,"UNINET",6); // 参数值
			Original_info_Wr+=6;
			break;
			
	  case 0x0015:
				   //	A.13 BAK APN 用户名
				 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x15;
			Original_info[Original_info_Wr++]=4; // 参数长度
			memcpy( ( char * ) Original_info+ Original_info_Wr, "user",4); // 参数值
			Original_info_Wr+=4;
			break;
	  case 0x0016:
				   //	A.14  BAK  APN 密码
				 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x16;
			Original_info[Original_info_Wr++]=4; // 参数长度
			memcpy( ( char * ) Original_info+ Original_info_Wr, "user",4); // 参数值
			Original_info_Wr+=4;
	        break;
     case 0x0017:			
						//	A.15   备用IP		 
				 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
				  Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x17;    
													 // 参数长度				
		  memset(reg_str,0,sizeof(reg_str));	 //  填写域名
		  memcpy(reg_str,DomainNameStr_aux,strlen((char const*)DomainNameStr_aux));
		 // memcpy(reg_str,"fde.0132456.net",strlen((char const*)"jt1.gghypt.net"));
		   Original_info[Original_info_Wr++]=strlen((const char*)reg_str);
			  memcpy( ( char * ) Original_info+ Original_info_Wr, ( char * )reg_str,strlen((const char*)reg_str));	// 参数值	 
		   Original_info_Wr+=strlen((const char*)reg_str);
	      break;
			
     case 0x0018:			  
	
