nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
				 //  A.16  主服务TCP端口
				 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x18;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=0x00;   // 参数值
			Original_info[Original_info_Wr++]=0x00; 
			Original_info[Original_info_Wr++]=(7008>>8); 
			Original_info[Original_info_Wr++]=7008; 
			break;
     case 0x0019:			
															
				//	A.17  备用服务TCP端口
				 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x19;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=0x00;   // 参数值
			Original_info[Original_info_Wr++]=0x00; 
			Original_info[Original_info_Wr++]=(7008>>8); 
			Original_info[Original_info_Wr++]=7008; 
			break;

	case 0x001a:		
	
				 //  A.18  IC卡认证 主服务器地址
				 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x1A;
			Original_info[Original_info_Wr++]=0  ; // 参数长度
	
			//memcpy(( char * ) Original_info+ Original_info_Wr,"202.96.42.113",13);
			//Original_info_Wr+=13;
			 break;
	case 0x001b:
							//	A.19  IC卡认证 主服务器TCP
				 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x1B;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=0x00;   // 参数值
			Original_info[Original_info_Wr++]=0x00; 
			Original_info[Original_info_Wr++]=0x00; 
			Original_info[Original_info_Wr++]=0x00;  
			break;
	case 0x001c:
								//	A.20  IC卡认证 主服务器UDP
				 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x1C;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=0x00;   // 参数值
			Original_info[Original_info_Wr++]=0x00; 
			Original_info[Original_info_Wr++]=0x00; 
			Original_info[Original_info_Wr++]=0x00;  
			break;
	case 0x001d:		
	
					   //  A.21  IC卡认证  备用服务器地址
				 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes  
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x1D;
			Original_info[Original_info_Wr++]=0  ; // 参数长度
	
			//memcpy(( char * ) Original_info+ Original_info_Wr,"202.96.42.114",13);
			//Original_info_Wr+=13;
	         break;
	case 0x0020:		
	
								 //  A.22  位置汇报策略
				 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x20;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=0x00;   // 参数值
			Original_info[Original_info_Wr++]=0x00; 
			Original_info[Original_info_Wr++]=0x00; 
			Original_info[Original_info_Wr++]=JT808Conf_struct.SD_MODE.Send_strategy; 
			break;
	case 0x0021:
															   //  A.23  位置汇报方案
		    Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
		    Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x21;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=0x00;   // 参数值
			Original_info[Original_info_Wr++]=0x00; 
			Original_info[Original_info_Wr++]=0x00; 
			Original_info[Original_info_Wr++]=JT808Conf_struct.PositionSd_Stratage; 
			break;
	case 0x0022:
												  //  A.24 驾驶员未登录 汇报间隔
				 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x22;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=0x00;   // 参数值
			Original_info[Original_info_Wr++]=0x00; 
			Original_info[Original_info_Wr++]=0x00; 
			Original_info[Original_info_Wr++]=30; 
			break;
	case 0x0027:		
	
													   //  A.25  休眠时汇报间隔
				 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x27;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			JT808Conf_struct.DURATION.Sleep_Dur=300;
			Original_info[Original_info_Wr++]=(300>>24);   // 参数值  
			Original_info[Original_info_Wr++]=(300>>16);
			Original_info[Original_info_Wr++]=(300>>8);
			Original_info[Original_info_Wr++]=(300);	
			break;
	case 0x0028:		 
											//	A.26 紧急报警时 
				 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x28;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=0x00;   // 参数值
			Original_info[Original_info_Wr++]=0x00; 
			Original_info[Original_info_Wr++]=0x00; 
			Original_info[Original_info_Wr++]=10; 
			break;		 
	case 0x0029:
			 //   A.27	  缺省时间上报间隔
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x29;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.Default_Dur>>24);	 // 参数值 
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.Default_Dur>>16);
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.Default_Dur>>8);
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.Default_Dur);	   
			break;
	case 0x002c:
				 //   A.28	  缺省距离上报间隔
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x2c;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			//JT808Conf_struct.DISTANCE.Defalut_DistDelta=500;
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DISTANCE.Defalut_DistDelta>>24);   // 参数值 
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DISTANCE.Defalut_DistDelta>>16);
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DISTANCE.Defalut_DistDelta>>8);
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DISTANCE.Defalut_DistDelta);	 
	        break;
	case 0x002d:			 
					 //   A.29	  驾驶员未登录间隔
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x2d;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DISTANCE.Defalut_DistDelta>>24);   // 参数值 
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DISTANCE.Defalut_DistDelta>>16);
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DISTANCE.Defalut_DistDelta>>8);
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DISTANCE.Defalut_DistDelta);	 
			break;
	case 0x002e:
	
