nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
					 //   A.30	休眠时汇报距离间隔
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x2e;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DISTANCE.Defalut_DistDelta>>24);   // 参数值 
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DISTANCE.Defalut_DistDelta>>16);
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DISTANCE.Defalut_DistDelta>>8);
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DISTANCE.Defalut_DistDelta);	 
			break;
	case 0x002f:
						 //   A.31	  紧急报警时 定距离
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x2f;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=(200>>24);   // 参数值 
			Original_info[Original_info_Wr++]=(200>>16);
			Original_info[Original_info_Wr++]=(200>>8);
			Original_info[Original_info_Wr++]=(200);	 
			break;
	case 0x0030:
						  //   A.32 	拐点补传角度
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x30;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=(45>>24);   // 参数值 
			Original_info[Original_info_Wr++]=(45>>16);
			Original_info[Original_info_Wr++]=(45>>8);
			Original_info[Original_info_Wr++]=(45); 	
	       break;
	case 0x0031:
				//	 A.33	  电子围栏半径
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x31;
			Original_info[Original_info_Wr++]=2  ; // 参数长度
		  // 参数值 
			Original_info[Original_info_Wr++]=(500>>8);
			Original_info[Original_info_Wr++]=(500);	 
	        break;
	case 0x0040:
				 //   A.34	  设置求助号码
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x40;
			Original_info[Original_info_Wr++]=0  ; // 参数长度
			break;
	case 0x0041:
					//	 A.35	 复位电话号码
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x41;
			Original_info[Original_info_Wr++]=0  ; // 参数长度
			break;
	
	case 0x0042:
				 //   A.36	  恢复出厂设置电话号码
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x42;
			Original_info[Original_info_Wr++]=0  ; // 参数长度
	         break;
	case 0x0043:
					   //  A37	监控平台SMS 短息号码
				 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x43;
			Original_info[Original_info_Wr++]=5  ; // 参数长度
	
			memcpy(( char * ) Original_info+ Original_info_Wr,"10086",5);
			Original_info_Wr+=5;
	        break;
    case 0x0044:	
					
				 //   A.38	  sms 短息报警号码
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				  Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x44;
			Original_info[Original_info_Wr++]=0  ; // 参数长度
	        break;
	case 0x0045:
							//	 A.39	接听策略
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				  Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x45;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
				  Original_info[Original_info_Wr++]=1;	// ACC on 自动接听
	        break;
	case 0x0046:
	
								   //	A.40	 每次通话时长
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x46;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=(120>>24);   // 参数值 
			Original_info[Original_info_Wr++]=(120>>16);
			Original_info[Original_info_Wr++]=(120>>8);
			Original_info[Original_info_Wr++]=(120);  
			break;
	case 0x0047:
	
								  //   A.41    每月通话时长
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x47;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=(36000>>24);	 // 参数值 
			Original_info[Original_info_Wr++]=(36000>>16);
			Original_info[Original_info_Wr++]=(36000>>8);
			Original_info[Original_info_Wr++]=(36000);	 
			break;
	case 0x0048:
	
					 //   A42	 设置监听号码
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				  Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x48;
			Original_info[Original_info_Wr++]=0  ; // 参数长度
	        break;
	case 0x0049:
			  //   A.43    平台监管特权号码
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				  Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x49;
			Original_info[Original_info_Wr++]=0  ; // 参数长度
	         break;
	case 0x0050:
	
			//	 A.44	 报警屏蔽字
		            Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
              Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x50;
		Original_info[Original_info_Wr++]=4  ; // 参数长度
		Original_info[Original_info_Wr++]=Warn_MaskWord[0];
		Original_info[Original_info_Wr++]=Warn_MaskWord[1];
		Original_info[Original_info_Wr++]=Warn_MaskWord[2];
		Original_info[Original_info_Wr++]=Warn_MaskWord[3]; 
	        break;
	case 0x0051:
	
		  //   A.45  报警	发送Sms  开关
				Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
				Original_info[Original_info_Wr++]=0x00;
		  Original_info[Original_info_Wr++]=0x00;
		  Original_info[Original_info_Wr++]=0x51;
				  Original_info[Original_info_Wr++]=4  ; // 参数长度
		  Original_info[Original_info_Wr++]=Text_MaskWord[0];
		  Original_info[Original_info_Wr++]=Text_MaskWord[1];
		  Original_info[Original_info_Wr++]=Text_MaskWord[2];
		  Original_info[Original_info_Wr++]=Text_MaskWord[3]; 
			break;
	case 0x0052:
	
	 //   A.46	  报警拍照开关
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				  Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x52;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x01;
			break;
	case 0x0053:
	
	 //   A.47	报警拍照存储标志
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				  Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x53;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			break;
	case 0x0054:
	
	 //   A.48	  关键报警标志
		   Original_info[Original_info_Wr++]=0x00;	 // 参数ID 4Bytes
		   Original_info[Original_info_Wr++]=0x00;
	 Original_info[Original_info_Wr++]=0x00;
	 Original_info[Original_info_Wr++]=0x54;
	 Original_info[Original_info_Wr++]=4  ; // 参数长度
	 Original_info[Original_info_Wr++]=Key_MaskWord[0];
	 Original_info[Original_info_Wr++]=Key_MaskWord[1];
	 Original_info[Original_info_Wr++]=Key_MaskWord[2];
	 Original_info[Original_info_Wr++]=Key_MaskWord[3];
			break;
	case 0x0055:
			
	   //	A.49   最大速度门限
			Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x55;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			JT808Conf_struct.Speed_warn_MAX=100;
			Original_info[Original_info_Wr++]=( JT808Conf_struct.Speed_warn_MAX>>24);	// 参数值
			Original_info[Original_info_Wr++]=( JT808Conf_struct.Speed_warn_MAX>>16);  
			Original_info[Original_info_Wr++]=( JT808Conf_struct.Speed_warn_MAX>>8);
			Original_info[Original_info_Wr++]=( JT808Conf_struct.Speed_warn_MAX);
			break;
	case 0x0056:
	
			   //	A.50	 超速持续时间
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				  Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x56;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=JT808Conf_struct.Spd_Exd_LimitSeconds;
			break;
	case 0x0057:
			
			 //  A.51	连续驾驶门限
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				  Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x57;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_DrvKeepingSec>>24);	 // 参数值
			Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_DrvKeepingSec>>16);	
			Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_DrvKeepingSec>>8);
			Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_DrvKeepingSec);
			break;
	case 0x0058:
	
