nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
	 //   A.64	饱和度
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				  Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x73;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=64;
			break;
	case 0x0074:
	
	
	 //   A.65	色度
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				  Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x74;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=127;
			break;
	case 0x0080:
	
	 //   A.66	 车辆里程表读数
		   Original_info[Original_info_Wr++]=0x00;	 // 参数ID 4Bytes
		   Original_info[Original_info_Wr++]=0x00;
	 Original_info[Original_info_Wr++]=0x00;
	 Original_info[Original_info_Wr++]=0x64;
	 Original_info[Original_info_Wr++]=4  ; // 参数长度
	 reg_u32=JT808Conf_struct.Distance_m_u32/100;
	 Original_info[Original_info_Wr++]=(reg_u32>>24);	 // 参数值
	 Original_info[Original_info_Wr++]=(reg_u32>>16);	
	 Original_info[Original_info_Wr++]=(reg_u32>>8);
	 Original_info[Original_info_Wr++]=(reg_u32);		  
			break;
	case 0x0081:
	
	
	
	 //   A.67	 车辆所在省域
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				  Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x81;
			Original_info[Original_info_Wr++]=2  ; // 参数长度
				 Original_info[Original_info_Wr++]=(u8)(10>>8);
				  Original_info[Original_info_Wr++]=(u8)10;
				  break;
	case 0x0082:
	
	//	 A.68	车辆所在市域
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				  Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x82;
			Original_info[Original_info_Wr++]=2  ; // 参数长?
			   //  county  ID
				  Original_info[Original_info_Wr++]=(u8)(1010>>8);
				  Original_info[Original_info_Wr++]=(u8)1010;	
				  break;
	case 0x0083:
	
														
		   //	A.69   车牌号
			Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x83;
			Original_info[Original_info_Wr++]=strlen((const char*)JT808Conf_struct.Vechicle_Info.Vech_Num); // 参数长度
			memcpy( ( char * ) Original_info+ Original_info_Wr, ( char * )JT808Conf_struct.Vechicle_Info.Vech_Num,strlen((const char*)JT808Conf_struct.Vechicle_Info.Vech_Num) ); // 参数值
			Original_info_Wr+=strlen((const char*)JT808Conf_struct.Vechicle_Info.Vech_Num); 
			break;
	case 0x0084:
			
	//	 A.70	车辆颜色
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				  Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x84;
			Original_info[Original_info_Wr++]=1  ; // 参数长?
			Original_info[Original_info_Wr++]=JT808Conf_struct.Vechicle_Info.Dev_Color;
			break;
	case 0x0090:
	
	//	 A.71	GNSS  模式设置
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				  Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x90;
			Original_info[Original_info_Wr++]=1  ; // 参数长?
	
		   if( GpsStatus.Position_Moule_Status==1)
				 Original_info[Original_info_Wr++]=2;
		   
		   if( GpsStatus.Position_Moule_Status==2)
			  Original_info[Original_info_Wr++]=1;	 
		   
		   if( GpsStatus.Position_Moule_Status==3) 
			  Original_info[Original_info_Wr++]=3;	   
		   break;
	case 0x0091:
	
	//	 A.72	GNSS 波特率设置
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				  Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x91;
			Original_info[Original_info_Wr++]=1  ; // 参数长?
			Original_info[Original_info_Wr++]=2;
			break;
	case 0x0092:
	
	//	 A.73	GNSS nmea  输出更新频率
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				  Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x92;
			Original_info[Original_info_Wr++]=1  ; // 参数长?
			Original_info[Original_info_Wr++]=1;
			break;
	case 0x0093:
	
	 //   A74	车辆里程表读数
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				  Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x93;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=1;
			break;
	case 0x0094:
	
	//	 A.75  GNSS定位上传方式
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				  Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x94;
			Original_info[Original_info_Wr++]=1  ; // 参数长?
			Original_info[Original_info_Wr++]=0;
			break;
	case 0x0095:
	
	 //   A76	模块详细数据上传设置
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				  Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x95;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0;
			break;
	case 0x0100:
	
	 //   A77	CAN1   采集间隔
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				  Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x01;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			break;
	case 0x0101:
	
	 //   A78	CAN1   上传间隔
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				  Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x01;
			Original_info[Original_info_Wr++]=0x01;
			Original_info[Original_info_Wr++]=2  ; // 参数长度
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			break;
	case 0x0102:
	
	 //   A79	 CAN2	采集间隔
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				  Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x01;
			Original_info[Original_info_Wr++]=0x02;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0;		
			break;
	case 0x0103:
	
	 //   A80  CAN2   上传间隔
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				  Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x01;
			Original_info[Original_info_Wr++]=0x03;
			Original_info[Original_info_Wr++]=2  ; // 参数长度
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
	        break;
	case 0x0110:
	
	
	 //   A81  CAN	总线ID 单独采集设置
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				  Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x01;
			Original_info[Original_info_Wr++]=0x10;
			Original_info[Original_info_Wr++]=8 ; // 参数长度
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0;
				  Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0;		 
			break;
	 default:
	 	    break;
   	}

