nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
	Original_info[Original_info_Wr++]=ProductAttribute._10_FirmWareVer_len;      
	memcpy( ( char * ) Original_info+ Original_info_Wr,(u8*)ProductAttribute._11_FirmWare,ProductAttribute._10_FirmWareVer_len);
	Original_info_Wr+=ProductAttribute._10_FirmWareVer_len; 

	Original_info[Original_info_Wr++]=ProductAttribute._12_GNSSAttribute;
	Original_info[Original_info_Wr++]=ProductAttribute._13_ComModuleAttribute;

	 /*
	  infoLen=sizeof(ProductAttribute);
	  memcpy( ( char * ) Original_info+ Original_info_Wr,(u8*)&ProductAttribute,infoLen);
	  Original_info_Wr+=infoLen;	 
        */
	  
	 //  3. Send 
	 Protocol_End(Packet_Normal ,0);
	  if(DispContent)
	 rt_kprintf("\r\n	发送终端属性 \r\n");    

    return true;
}
u8  Stuff_ISP_Resualt_BD_0108H(void)
{
   // 1. Head
	if(!Protocol_Head(MSG_0x0108,Packet_Normal)) 
 	  return false; 
	 // 2. content   
	 BD_ISP.ISP_running=0; // clear
         //----------------------------------------------------
         Original_info[Original_info_Wr++]=BD_ISP.Update_Type; // 升级类型
	  Original_info[Original_info_Wr++]=0;//BD_ISP.Update_Type;  // 升级结果
	 
	 //  3. Send 
	 Protocol_End(Packet_Normal ,0);
	  if(DispContent)
	 rt_kprintf("\r\n	远程升级结果上报 \r\n");    

}
u8  Stuff_BatchDataTrans_BD_0704H(void)
{
   // 1. Head
	if(!Protocol_Head(MSG_0x0704,Packet_Normal)) 
 	     return false; 
	 // 2. content   
             // 2.1   数据项个数
             Original_info[Original_info_Wr++]=1;   
	       // 2.2   位置数据类型
             Original_info[Original_info_Wr++]=0;   //  0: 正常上报  1: 盲区补报
	      // 2.3   位置汇报数据项
	      	// 1. 告警标志  4
		memcpy( ( char * ) Original_info+ Original_info_Wr, ( char * )Warn_Status,4 );    
		Original_info_Wr += 4;
		// 2. 状态  4
		memcpy( ( char * ) Original_info+ Original_info_Wr, ( char * )Car_Status,4 );   
		Original_info_Wr += 4;
		// 3.  纬度
	       memcpy( ( char * ) Original_info+ Original_info_Wr,( char * )  Gps_Gprs.Latitude, 4 );//纬度   modify by nathan
		Original_info_Wr += 4;
		// 4.  经度
		memcpy( ( char * ) Original_info+ Original_info_Wr, ( char * )  Gps_Gprs.Longitude, 4 );	  //经度    东经  Bit 7->0   西经 Bit 7 -> 1
		Original_info_Wr += 4;
		// 5.  高程
		Original_info[Original_info_Wr++]=(u8)(GPS_Hight<<8);
		Original_info[Original_info_Wr++]=(u8)GPS_Hight;
		// 6.  速度    0.1 Km/h
		Original_info[Original_info_Wr++]=(u8)(Speed_gps>>8);//(GPS_speed>>8); 
		Original_info[Original_info_Wr++]=(u8)(Speed_gps);//GPS_speed;     
		// 7. 方向   单位 1度
		Original_info[Original_info_Wr++]=(GPS_direction>>8);  //High 
		Original_info[Original_info_Wr++]=GPS_direction; // Low
		// 8.  日期时间	
		Original_info[Original_info_Wr++]=(((Gps_Gprs.Date[0])/10)<<4)+((Gps_Gprs.Date[0])%10);		
		Original_info[Original_info_Wr++]=((Gps_Gprs.Date[1]/10)<<4)+(Gps_Gprs.Date[1]%10); 
		Original_info[Original_info_Wr++]=((Gps_Gprs.Date[2]/10)<<4)+(Gps_Gprs.Date[2]%10);
		Original_info[Original_info_Wr++]=((Gps_Gprs.Time[0]/10)<<4)+(Gps_Gprs.Time[0]%10);
		Original_info[Original_info_Wr++]=((Gps_Gprs.Time[1]/10)<<4)+(Gps_Gprs.Time[1]%10);
		Original_info[Original_info_Wr++]=((Gps_Gprs.Time[2]/10)<<4)+(Gps_Gprs.Time[2]%10);	 
     
	 //  3. Send 
	  Protocol_End(Packet_Normal ,0);
	  if(DispContent)
	          rt_kprintf("\r\n	定位数据批量上传\r\n");    

}
u8  Stuff_CANDataTrans_BD_0705H(void)
{
      u16   DataNum=0,i=0;
      u32   read_rd=0; 	  
   // 1. Head
	if(!Protocol_Head(MSG_0x0705,Packet_Normal)) 
 	  return false; 
	 // 2. content   
        // 数据项个数
        DataNum=(CAN_trans.canid_1_SdWr>>3);  // 除以8 
        Original_info[Original_info_Wr++]=(DataNum>>8);
	 Original_info[Original_info_Wr++]=DataNum;
	 Can_sdnum+=DataNum;  
	 //接收时间
        Original_info[Original_info_Wr++]=((time_now.hour/10)<<4)+(time_now.hour%10);
	 Original_info[Original_info_Wr++]=((time_now.min/10)<<4)+(time_now.min%10);
	 Original_info[Original_info_Wr++]=((time_now.sec/10)<<4)+(time_now.sec%10);    
	 Original_info[Original_info_Wr++]=(Can_same%10);//0x00;  // ms 毫秒  
	 Original_info[Original_info_Wr++]=0x00;    
	 //  CAN 总线数据项
	 read_rd=0;
        for(i=0;i<DataNum;i++)
        {	
           /*
		Original_info[Original_info_Wr++]= (CAN_trans.canid_1_Filter_ID>>24)|0x40;// 返回透传数据的类型 
		Original_info[Original_info_Wr++]=(CAN_trans.canid_1_Filter_ID>>16);
		Original_info[Original_info_Wr++]=(CAN_trans.canid_1_Filter_ID>>8);
		Original_info[Original_info_Wr++]=CAN_trans.canid_1_Filter_ID;        
	  */     
		
		Original_info[Original_info_Wr++]= (CAN_trans.canid_1_ID_SdBUF[i]>>24)|0x40;// 返回透传数据的类型 
		Original_info[Original_info_Wr++]=(CAN_trans.canid_1_ID_SdBUF[i]>>16);
		Original_info[Original_info_Wr++]=(CAN_trans.canid_1_ID_SdBUF[i]>>8);
		Original_info[Original_info_Wr++]=CAN_trans.canid_1_ID_SdBUF[i];   
		
		//--------------------------------------------------------------------------
		memcpy(Original_info+Original_info_Wr,CAN_trans.canid_1_Sdbuf+read_rd,8);    
		Original_info_Wr+=8;
		read_rd+=8;  
        }	 
	 CAN_trans.canid_1_SdWr=0;   
	 //  3. Send 
	 Protocol_End(Packet_Normal ,0);
	  if(DispContent)
	 rt_kprintf("\r\n	CAN 总线数据上传 数据项=%d   Rxnum=%d  Sd_num=%d  Can_loudiao=%d  Can_notsame=%d Same=%d\r\n",DataNum,Can_RXnum,Can_sdnum,Can_loudiao,Can_same,Can_notsame);       

}
u8  Stuff_CentreTakeACK_BD_0805H(void)
{
   // 1. Head
	if(!Protocol_Head(MSG_0x0805,Packet_Normal)) 
 	  return false; 
	 // 2. content   	    
	     //   float ID
	    Original_info[Original_info_Wr++]=(u8)(Centre_FloatID>>8);  //  应答流水号
	    Original_info[Original_info_Wr++]=(u8)Centre_FloatID; 
           Original_info[Original_info_Wr++]=(u8)SingleCamra_TakeResualt_BD;   // 中心应答结果
           Original_info[Original_info_Wr++]=0x00;  //  成功拍照多媒体个数    1
	    Original_info[Original_info_Wr++]=1; 
           Original_info[Original_info_Wr++]=0;   // 多媒体ID 列表
           Original_info[Original_info_Wr++]=0; 
	    Original_info[Original_info_Wr++]=0; 	
           Original_info[Original_info_Wr++]=1;   
		//  3. Send 
	 Protocol_End(Packet_Normal ,0);
	  if(DispContent)
	         rt_kprintf("\r\n	摄像头立即拍照应答 \r\n");     

