nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
/*bitter:最后一包发送fcs*/
#if 1
	if( PaketType == Packet_Divide )
	{
		Recode_Obj.fcs ^= Sfcs;
		if( Recode_Obj.Current_pkt_num == Recode_Obj.Total_pkt_num )
		{
			Original_info[Original_info_Wr++] = Recode_Obj.fcs; // 填写FCS
		}
	}else
	{
		Original_info[Original_info_Wr++] = Sfcs;               // 填写FCS
	}
#endif

	//  3. Send
	Protocol_End( PaketType, 0 );

	//  4.     如果是分包 判断结束
    if( Recode_Obj.Devide_Flag== 1 )   // 不给应答
	{
		if(Recode_Obj.Current_pkt_num >=Recode_Obj.Total_pkt_num )
		{
			Recorder_init( );           //  clear
		}else
		{
			Recode_Obj.Current_pkt_num++;
		}
	}

	if( DispContent )
	{
		rt_kprintf( "\r\n	SEND Recorder Data ! \r\n");
	}

	return true;
}

//------------------------------------------------------------------

u8  Stuff_GNSSRawData_0900H(u8*Instr , u16  len)      
{  
	
	// 1. Head
	 if(!Protocol_Head(MSG_0x0900,Packet_Normal)) 
 	      return false; 
	 // 2. content   
	 Original_info[Original_info_Wr++]=0x00;// 返回透传数据的类型
	 memcpy(Original_info+Original_info_Wr,Instr,len);
	 Original_info_Wr+=len;    
	 //  3. Send 
	 Protocol_End(Packet_Normal ,0);
        if(DispContent)
	        rt_kprintf("\r\n	发送透传  \r\n");    
	 return true; 

}

//----------------------------------------------------------------------
u8  Stuff_MultiMedia_InfoSD_0800H(void)      
{  
  
	// 1. Head
	if(!Protocol_Head(MSG_0x0800,Packet_Normal)) 
 	  return false; 
	 // 2. content          
		 switch (MediaObj.Media_Type)
		  {
		   case 0 : // 图像
				   MediaObj.Media_totalPacketNum=Photo_sdState.Total_packetNum;  // 图片总包数
				   MediaObj.Media_currentPacketNum=Photo_sdState.SD_packetNum;	// 图片当前报数
				   MediaObj.Media_ID=1;   //  多媒体ID
				   MediaObj.Media_Channel=Camera_Number;  // 图片摄像头通道号
				   break;
		   case 1 : // 音频
		          
				  MediaObj.Media_totalPacketNum=Sound_sdState.Total_packetNum;	// 图片总包数
				  MediaObj.Media_currentPacketNum=Sound_sdState.SD_packetNum;  // 图片当前报数
				  MediaObj.Media_ID=1;	 //  多媒体ID
				  MediaObj.Media_Channel=1;  // 图片摄像头通道号
		         // rt_kprintf(" \r\n 申请上传音频信息 \r\n");  
				   break;
		   case 2 : // 视频
		          MediaObj.Media_totalPacketNum=Video_sdState.Total_packetNum;	// 图片总包数
				  MediaObj.Media_currentPacketNum=Video_sdState.SD_packetNum;  // 图片当前报数
				  MediaObj.Media_ID=1;	 //  多媒体ID
				  MediaObj.Media_Channel=1;  // 图片摄像头通道号
		         // rt_kprintf(" \r\n 申请上传视频信息 \r\n");  
		 
		 
				   break;
		   default:
				   return false;
		  }
	 
	   //  MediaID
	   Original_info[Original_info_Wr++]=(MediaObj.Media_ID>>24);// 返回事件ID
	   Original_info[Original_info_Wr++]=(MediaObj.Media_ID>>16);
       Original_info[Original_info_Wr++]=(MediaObj.Media_ID>>8);    	
	   Original_info[Original_info_Wr++]=MediaObj.Media_ID;
	   //  Type	   
	   Original_info[Original_info_Wr++]=MediaObj.Media_Type;
	   //  MediaCode Type 
	    Original_info[Original_info_Wr++]=MediaObj.Media_CodeType;
	    Original_info[Original_info_Wr++]=MediaObj.Event_Code;
	    Original_info[Original_info_Wr++]=MediaObj.Media_Channel;
	   
	   
	 //  3. Send 
	Protocol_End(Packet_Normal ,0);
	  if(DispContent)
	 rt_kprintf("\r\n	发送多媒体事件信息上传  \r\n");    
	 return true; 

}

//--------------------------------------------------------------------------
u8  Stuff_MultiMedia_Data_0801H(void)      
{  
	u16 inadd=0,readsize=0;//,soundpage=0,sounddelta=0;
//	u8  instr[SpxGet_Size];  

	  
	//  rt_kprintf("\r\n  1--- pic_total_num:  %d	current_num:  %d  MediaObj.Media_Type: %d \r\n ",MediaObj.Media_totalPacketNum,MediaObj.Media_currentPacketNum,MediaObj.Media_Type);
	 // 1. Head 
	 if(!Protocol_Head(MSG_0x0801,Packet_Divide))   
 	  return false;    
	 // 2. content1  ==>  MediaHead   
	 if(MediaObj.Media_currentPacketNum==1)
	 {
	   //  MediaID
	   Original_info[Original_info_Wr++]=(MediaObj.Media_ID>>24);//  多媒体ID
	   Original_info[Original_info_Wr++]=(MediaObj.Media_ID>>16);
          Original_info[Original_info_Wr++]=(MediaObj.Media_ID>>8);    	
	   Original_info[Original_info_Wr++]=MediaObj.Media_ID;
	   //  Type	   
	   Original_info[Original_info_Wr++]=MediaObj.Media_Type;    // 多媒体类型
	   //  MediaCode Type 
	    Original_info[Original_info_Wr++]=MediaObj.Media_CodeType; // 多媒体编码格式
	    Original_info[Original_info_Wr++]=MediaObj.Event_Code;     // 多媒体事件编码
	    Original_info[Original_info_Wr++]=MediaObj.Media_Channel;  // 通道ID  


	    //  Position Inifo	    
		//  告警标志  4
		memcpy( ( char * ) Original_info+ Original_info_Wr, ( char * )Warn_Status,4 );    
		Original_info_Wr += 4;
		// . 状态  4
		memcpy( ( char * ) Original_info+ Original_info_Wr, ( char * )Car_Status,4 );   
		Original_info_Wr += 4;
		//   纬度
	    memcpy( ( char * ) Original_info+ Original_info_Wr,( char * )  Gps_Gprs.Latitude, 4 );//纬度   modify by nathan
		Original_info_Wr += 4;
		//   经度
		memcpy( ( char * ) Original_info+ Original_info_Wr, ( char * )  Gps_Gprs.Longitude, 4 );	  //经度    东经  Bit 7->0   西经 Bit 7 -> 1
		Original_info_Wr += 4;
		//   高程
		Original_info[Original_info_Wr++]=(u8)(GPS_Hight<<8);
		Original_info[Original_info_Wr++]=(u8)GPS_Hight;
		//   速度    0.1 Km/h
		Original_info[Original_info_Wr++]=(u8)(Speed_gps>>8);//(GPS_speed>>8); 
		Original_info[Original_info_Wr++]=(u8)(Speed_gps);//GPS_speed;     
		//   方向   单位 1度
		Original_info[Original_info_Wr++]=(GPS_direction>>8);  //High 
		Original_info[Original_info_Wr++]=GPS_direction; // Low
		//   日期时间	
		Original_info[Original_info_Wr++]=(((Gps_Gprs.Date[0])/10)<<4)+((Gps_Gprs.Date[0])%10);		
		Original_info[Original_info_Wr++]=((Gps_Gprs.Date[1]/10)<<4)+(Gps_Gprs.Date[1]%10); 
		Original_info[Original_info_Wr++]=((Gps_Gprs.Date[2]/10)<<4)+(Gps_Gprs.Date[2]%10);
		Original_info[Original_info_Wr++]=((Gps_Gprs.Time[0]/10)<<4)+(Gps_Gprs.Time[0]%10);
		Original_info[Original_info_Wr++]=((Gps_Gprs.Time[1]/10)<<4)+(Gps_Gprs.Time[1]%10);
		Original_info[Original_info_Wr++]=((Gps_Gprs.Time[2]/10)<<4)+(Gps_Gprs.Time[2]%10);	 

		  if(1==MediaObj.Media_Type)    //  音频头
		 { 
			//  AMR 文件头     23 21 41 4D 52 0A
	              Original_info[Original_info_Wr++]=0x23;
	              Original_info[Original_info_Wr++]=0x21;
			Original_info[Original_info_Wr++]=0x41;
			Original_info[Original_info_Wr++]=0x4D;
			Original_info[Original_info_Wr++]=0x52;
			Original_info[Original_info_Wr++]=0x0A;  
	  	}	
	 } 	
      // 4. content3  ==> Media Info
     switch (MediaObj.Media_Type) 
         {
          case 0 : // 图像
                   
