nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
     #if   1       //  new  BD format  
	 //  状态
	 if(IC_MOD.IC_Status==1)
	 	  JT808Conf_struct.Driver_Info.BD_IC_status=0x01;
	else
		  JT808Conf_struct.Driver_Info.BD_IC_status=0x02;
        Original_info[Original_info_Wr++]=JT808Conf_struct.Driver_Info.BD_IC_status;   
	 memcpy(Original_info+Original_info_Wr,JT808Conf_struct.Driver_Info.BD_IC_inoutTime,6);   
	 Original_info_Wr+=6;   
	 Original_info[Original_info_Wr++]=JT808Conf_struct.Driver_Info.BD_IC_rd_res;  //卡片被拔出
	 Original_info[Original_info_Wr++]=JT808Conf_struct.Driver_Info.BD_DriveName_Len; //  姓名长度
	 memcpy(Original_info+Original_info_Wr,JT808Conf_struct.Driver_Info.BD_DriveName,JT808Conf_struct.Driver_Info.BD_DriveName_Len); 
        Original_info_Wr+=JT808Conf_struct.Driver_Info.BD_DriveName_Len;		
        memcpy(Original_info+Original_info_Wr,JT808Conf_struct.Driver_Info.BD_Drv_CareerID,20); //  从业资格证编码
        Original_info_Wr+=20;
	 Original_info[Original_info_Wr++]=JT808Conf_struct.Driver_Info.BD_Confirm_agentID_Len; 
         memcpy(Original_info+Original_info_Wr,JT808Conf_struct.Driver_Info.BD_Confirm_agentID,JT808Conf_struct.Driver_Info.BD_Confirm_agentID_Len);
        Original_info_Wr+=JT808Conf_struct.Driver_Info.BD_Confirm_agentID_Len;
         memcpy(Original_info+Original_info_Wr,JT808Conf_struct.Driver_Info.BD_ExpireDate,4);  //YYYYMMDD		Original_info_Wr+=i;
	  Original_info_Wr+=4;	
     #endif 	 
	 
	 // 3. Send 
	 Protocol_End(Packet_Normal ,0);
	  if(DispContent)
	 rt_kprintf("\r\n	Send Driver Info \r\n");    
	 return true; 

}
//---------------------------------------------------------------------------------
u8  Stuff_Worklist_0701H(void)      
{  
    u32  listlen=215;
	 // 1. Head
	 if(!Protocol_Head(MSG_0x0701,Packet_Normal)) 
 	    return false; 
	
	 // 2. content     
        //   信息长度
	    // listlen=207;
	    listlen=8;
		 Original_info[Original_info_Wr++]=(listlen>>24);// 返回事件ID
		 Original_info[Original_info_Wr++]=(listlen>>16);
		 Original_info[Original_info_Wr++]=(listlen>>8);		  
		 Original_info[Original_info_Wr++]=listlen;

	  memcpy(Original_info+Original_info_Wr,"电子运单",8);  
         Original_info_Wr+=8;		

	/*	
        memcpy(Original_info+Original_info_Wr,"托运单位:天津七一二通信广播有限公司 电话:022-26237216  ",55);
        Original_info_Wr+=55;		
        memcpy(Original_info+Original_info_Wr,"承运单位:天津物流运输公司 电话:022-86692666  ",45);
        Original_info_Wr+=45;
		memcpy(Original_info+Original_info_Wr,"物品名称:GPS车载终端  包装方式:  箱式   每箱数量: 20   总量: 30箱  ",67);
        Original_info_Wr+=67;
		memcpy(Original_info+Original_info_Wr,"车型:箱式小货车 运达日期 :  2012-1-11   ",40); 
        Original_info_Wr+=40; 
        */
		
	 // 3. Send 
	Protocol_End(Packet_Normal ,0);
	  if(DispContent)
	 rt_kprintf("\r\n	Send Worklist  \r\n");    
	 return true; 


}
//------------------------------------------------------------------------------------
u8 Stuff_DataTrans_0900_BD_GNSSData(void)
{  
  u16  TX_NUM=0,Rec_Num=0,i=0;	 
  u8   Gfcs=0;
  //---------------------------------------------
   // 1. Head
   if(!Protocol_Head(MSG_0x0900,Packet_Normal)) 
	 return false; 
	// 2. content	
	//	应答流水号
         Original_info[Original_info_Wr++]=0x00;// 返回透传数据的类型 1	表示远程下载
	// 3. 内容
	 // GNSS 信息
	//	4. Send 
    Protocol_End(Packet_Normal,1 ); 
   if(DispContent)
   	{
               rt_kprintf("\r\n	 发送透传 GNSS Data\r\n");       
   	}   
   return true; 

}

u8 Stuff_DataTrans_0900_BD_ICinfo(void)
{  
  u16  TX_NUM=0,Rec_Num=0,i=0;	 
  u8   Gfcs=0;
  //---------------------------------------------
   // 1. Head
   if(!Protocol_Head(MSG_0x0900,Packet_Normal)) 
	 return false; 
	// 2. content	
	//	应答流水号
         Original_info[Original_info_Wr++]=0x0B;//IC 卡信息
	// 3. 内容
	 // IC 信息
	 memcpy(Original_info+Original_info_Wr,IC_MOD.IC_Tx40H,64); //IC 64 字节信息
	 Original_info_Wr+=64; 
	//	4. Send 
    Protocol_End(Packet_Normal,1 ); 
   if(DispContent)
   	{
               rt_kprintf("\r\n	 发送透传IC 卡信息\r\n");        
   	}   
   return true; 
}

u8 Stuff_DataTrans_0900_BD_Serial1(void)
{  
  u16  TX_NUM=0,Rec_Num=0,i=0;	 
  u8   Gfcs=0;
  //---------------------------------------------
   // 1. Head
   if(!Protocol_Head(MSG_0x0900,Packet_Normal)) 
	 return false; 
	// 2. content	
	//	应答流水号
         Original_info[Original_info_Wr++]=0x41;// 串口1 透传消息
	// 3. 内容
	 // 串口1 信息
	   memcpy(Original_info+Original_info_Wr,RawTrans_Com1.RawData,RawTrans_Com1.datalen);
	   Original_info_Wr+=RawTrans_Com1.datalen; 
	//	4. Send 
    Protocol_End(Packet_Normal,0 ); 
   if(DispContent)
   	{
               rt_kprintf("\r\n	 发送透传串口1信息\r\n");       
   	}   
   return true; 
}

u8 Stuff_DataTrans_0900_BD_Serial2(void)
{  
  u16  TX_NUM=0,Rec_Num=0,i=0;	 
  u8   Gfcs=0;
  //---------------------------------------------
   // 1. Head
   if(!Protocol_Head(MSG_0x0900,Packet_Normal)) 
	 return false; 
	// 2. content	
	//	应答流水号
         Original_info[Original_info_Wr++]=0x42;// 串口2 透传消息
	// 3. 内容
	 // 串口2  信息
	   memcpy(Original_info+Original_info_Wr,RawTrans_Com2.RawData,RawTrans_Com2.datalen);
	   Original_info_Wr+=RawTrans_Com2.datalen;    
	//	4. Send 
    Protocol_End(Packet_Normal,0 ); 
   if(DispContent)
   	{
               rt_kprintf("\r\n	 发送透传串口2 信息\r\n");       
   	}   
   return true; 
}
//----------------------------------------------
u8  Update_HardSoft_Version_Judge(u8 * instr)
{
     //   读取第50 页信息
     	  Device_type=((u32)instr[1]<<24)+((u32)instr[2]<<16)+((u32)instr[3]<<8)+(u32)instr[4];
	  Firmware_ver=((u32)instr[5]<<24)+((u32)instr[6]<<16)+((u32)instr[7]<<8)+(u32)instr[8];
	  rt_kprintf("	\r\n 设备类型: %x  软件版本:%x \r\n",Device_type,Firmware_ver); 
	 
	 if(Device_type!=STM32F407_Recoder_32MbitDF)   
	  { 
		 rt_kprintf( "\r\n 设备类型不匹配不予更新" );
		 return false;
	  }  		   
        else
		  return true;


}




 //-------------------- ISP Check  ---------------------------------------------
void  ISP_file_Check(void)
{
   
         memset(ISP_buffer,0,sizeof(ISP_buffer));
	  ISP_Read(ISP_APP_Addr,ISP_buffer,PageSIZE);
	  /*
		   序号   字节数	名称			  备注
		  1 		  1    更新标志 	 1 表示需要更新   0 表示不需要更新
		  2-5			  4   设备类型				 0x0000 0001  ST712   TWA1
											0x0000 0002   STM32  103  新A1
											0x0000 0003   STM32  101  简易型
											0x0000 0004   STM32  A3  sst25
											0x0000 0005   STM32  行车记录仪 
		  6-9		 4	   软件版本 	 每个设备类型从  0x0000 00001 开始根据版本依次递增
		  10-29 	  20	日期		' mm-dd-yyyy HH:MM:SS'
		  30-31 	  2    总页数		   不包括信息页
		  32-35 	  4    程序入口地址    
		  36-200	   165	  预留	  
		  201-		  n    文件名  
	 
	  */
	  //------------   Type check  ---------------------
	  Device_type=((u32)ISP_buffer[1]<<24)+((u32)ISP_buffer[2]<<16)+((u32)ISP_buffer[3]<<8)+(u32)ISP_buffer[4];
	  Firmware_ver=((u32)ISP_buffer[5]<<24)+((u32)ISP_buffer[6]<<16)+((u32)ISP_buffer[7]<<8)+(u32)ISP_buffer[8];
	  rt_kprintf("	\r\n 设备类型: %x  软件版本:%x \r\n",Device_type,Firmware_ver); 
	 
	 if(Device_type!=STM32F407_Recoder_32MbitDF)   
	  { 
		 rt_kprintf( "\r\n 设备类型不匹配不予更新" );
		 ISP_buffer[0]=0;	 // 不更新下载的程序
		  ISP_Write(ISP_APP_Addr,ISP_buffer,PageSIZE); 
	  }  		   
	 	 
	  rt_kprintf( "\r\n 文件日期: " );					  
	  rt_kprintf("%20s",(const char*)(ISP_buffer+10));	 
	  rt_kprintf( "\r\n");	
	  rt_kprintf( "\r\n 文件名: " );
	  rt_kprintf("%100s",(const char*)(ISP_buffer+201));      
	  rt_kprintf( "\r\n");	
	 if(Device_type==STM32F407_Recoder_32MbitDF)         
	 {
		Systerm_Reset_counter= (Max_SystemCounter-5);	 // 准备重启更新最新程序
		ISP_resetFlag=1;//准备重启 
		rt_kprintf( "\r\n 准备重启更新程序!\r\n" );	 
	 }	 
   
