nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
 }



//----------------------------------------------------------------------------------
void Stuff_O200_Info_Only( u8* Instr) 
{
   u8  Infowr=0;
   
	// 1. 告警标志  4
	memcpy( ( char * ) Instr+ Infowr, ( char * )Warn_Status,4 );    
	Infowr += 4;
	// 2. 状态  4
	memcpy( ( char * ) Instr+ Infowr, ( char * )Car_Status,4 );   
	Infowr += 4;
	// 3.  纬度
    memcpy( ( char * ) Instr+ Infowr,( char * )  Gps_Gprs.Latitude, 4 );//纬度   modify by nathan
	Infowr += 4;
	// 4.  经度
	memcpy( ( char * ) Instr+ Infowr, ( char * )  Gps_Gprs.Longitude, 4 );	  //经度    东经  Bit 7->0   西经 Bit 7 -> 1
	Infowr += 4;
	// 5.  高程
	Instr[Infowr++]=(u8)(GPS_Hight<<8);
	Instr[Infowr++]=(u8)GPS_Hight;
	// 6.  速度    0.1 Km/h
	Instr[Infowr++]=(u8)(Speed_gps>>8);
	Instr[Infowr++]=(u8)Speed_gps;   
	// 7. 方向   单位 1度
	Instr[Infowr++]=(GPS_direction>>8);  //High 
	Instr[Infowr++]=GPS_direction; // Low
	// 8.  日期时间	
	Instr[Infowr++]=(((Gps_Gprs.Date[0])/10)<<4)+((Gps_Gprs.Date[0])%10);		
	Instr[Infowr++]=((Gps_Gprs.Date[1]/10)<<4)+(Gps_Gprs.Date[1]%10); 
	Instr[Infowr++]=((Gps_Gprs.Date[2]/10)<<4)+(Gps_Gprs.Date[2]%10);
	Instr[Infowr++]=((Gps_Gprs.Time[0]/10)<<4)+(Gps_Gprs.Time[0]%10);
	Instr[Infowr++]=((Gps_Gprs.Time[1]/10)<<4)+(Gps_Gprs.Time[1]%10);
	Instr[Infowr++]=((Gps_Gprs.Time[2]/10)<<4)+(Gps_Gprs.Time[2]%10);	

}
//-----------------------------------------------------
u8  Save_MediaIndex( u8 type, u8* name, u8 ID,u8 Evencode)
{
  u8   i=0;

  if((type!=1)&&(type!=0))
    return false;
  
  //----- 查找无效位置 ----
  for(i=0;i<8;i++)
  {
	  if(type==0)  // 图像
	  {		
		   Api_RecordNum_Read(pic_index,i,(u8*)&MediaIndex, sizeof(MediaIndex));    
	  }
	  else
	  if(type==1) // 音频
	  {
	         Api_RecordNum_Read(voice_index,1,(u8*)&MediaIndex, sizeof(MediaIndex));    
	  }    
	  if(MediaIndex.Effective_Flag==0)
	  	 break;
  }
   if(i==8)  // 如果都满了则从第一个开始
   	   i=0;
  //----  填写信息 -------------
  memset((u8*)&MediaIndex,0,sizeof(MediaIndex));
  MediaIndex.MediaID= JT808Conf_struct.Msg_Float_ID;   
  MediaIndex.Type=type;
  MediaIndex.ID=ID;
  MediaIndex.Effective_Flag=1;
  MediaIndex.EventCode=Evencode;
  memcpy(MediaIndex.FileName,name,strlen((const char*)name));
  Stuff_O200_Info_Only(MediaIndex.PosInfo);
  
  if(type==0)  // 图像
  {
        Api_RecordNum_Write(pic_index,i,(u8*)&MediaIndex, sizeof(MediaIndex));    
  }
  else
  if(type==1) // 音频
  {
       Api_RecordNum_Write(voice_index,i,(u8*)&MediaIndex, sizeof(MediaIndex));    
  }
  return true;
  
}
//------------------------------------------------------------------
u8  CentreSet_subService_8103H(u32 SubID, u8 infolen, u8 *Content )
{  
 
  u8    i=0;
  u8    reg_str[80];
  u8    reg_in[20];
  u32   resualtu32=0;
  

   rt_kprintf("\r\n    收到中心设置命令 SubID=%X \r\n",SubID);  
	   
  switch(SubID)
   {
     case 0x0001:  // 终端心跳包发送间隔  单位:s
                    if(infolen!=4)
						break;					
					JT808Conf_struct.DURATION.Heart_Dur=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8) +Content[3];
                                    Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
                                   rt_kprintf("\r\n 心跳包间隔: %d s\r\n",JT808Conf_struct.DURATION.Heart_Dur);
                    break;
	 case 0x0002:  // TCP 消息应答超时时间  单位:s	                
                    if(infolen!=4)
						break;					
					JT808Conf_struct.DURATION.TCP_ACK_Dur=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8) +Content[3];
                    Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
					rt_kprintf("\r\n TCP消息应答间隔: %d s\r\n",JT808Conf_struct.DURATION.TCP_ACK_Dur); 
	                break;
	 case 0x0003:  //  TCP 消息重传次数	                
                    if(infolen!=4)
						break;					
					JT808Conf_struct.DURATION.TCP_ReSD_Num=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8) +Content[3];
                    Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
					rt_kprintf("\r\n TCP重传次数: %d\r\n",JT808Conf_struct.DURATION.TCP_ReSD_Num); 
	                break;
	 case 0x0004:  // UDP 消息应答超时时间  单位:s	                
                    if(infolen!=4)
						break;					
					JT808Conf_struct.DURATION.UDP_ACK_Dur=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8) +Content[3];
                    Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
                    rt_kprintf("\r\n UDP应答超时: %d\r\n",JT808Conf_struct.DURATION.UDP_ACK_Dur);
	                break;
	 case 0x0005:  //  UDP 消息重传次数	                
                    if(infolen!=4)
						break;					
					JT808Conf_struct.DURATION.UDP_ReSD_Num=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8) +Content[3];
                    Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
					rt_kprintf("\r\n UDP重传次数: %d\r\n",JT808Conf_struct.DURATION.UDP_ReSD_Num); 
					break;
	 case 0x0010:  //  主服务器APN 
                                    if(infolen==0)
					  	break;
					  memset(APN_String,0,sizeof(APN_String));					  
					  memcpy(APN_String,(char*)Content,infolen);  
					  memset((u8*)SysConf_struct.APN_str,0,sizeof(APN_String));	
					  memcpy((u8*)SysConf_struct.APN_str,(char*)Content,infolen);  
					 Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));


                                     DataLink_APN_Set(APN_String,1); 
									 
	                break; 
	 case 0x0013:  //  主服务器地址  IP 或域名
                      memset(reg_in,0,sizeof(reg_in)); 
					  memcpy(reg_in,Content,infolen);
                        rt_kprintf("\r\n  不允许修改 主IP 和域名: %s \r\n",reg_in);
                       Fail_Flag=1;
                       break;// 平台不让修改域名和IP 
					  
					 //----------------------------	
					 
					 i =str2ip((char*)reg_in, RemoteIP_main);
					 if (i <= 3)
					 {
					  rt_kprintf("\r\n  域名: %s \r\n",reg_in); 
					  
					  memset(DomainNameStr,0,sizeof(DomainNameStr));					  
					  memset(SysConf_struct.DNSR,0,sizeof(DomainNameStr));
					  memcpy(DomainNameStr,(char*)Content,infolen);   
					  memcpy(SysConf_struct.DNSR,(char*)Content,infolen);   
					 Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));

                                     //----- 传给 GSM 模块------
                                    DataLink_DNSR_Set(SysConf_struct.DNSR,1); 

									 
