nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
	 case 0x002C:   //  缺省距离汇报间隔  单位 米
	                if(infolen!=4)
						break;					
					JT808Conf_struct.DISTANCE.Defalut_DistDelta=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8) +Content[3];
                    Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
					rt_kprintf("\r\n 缺省距离汇报间隔: %d m\r\n",JT808Conf_struct.DISTANCE.Defalut_DistDelta); 
	                break;
	 case 0x002D:   //  驾驶员未登录汇报距离间隔 单位 米
	               if(infolen!=4)
						break;					
					JT808Conf_struct.DISTANCE.NoDrvLogin_Dist=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8) +Content[3];
                    Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct)); 
					rt_kprintf("\r\n 驾驶员未登录汇报距离: %d m\r\n",JT808Conf_struct.DISTANCE.NoDrvLogin_Dist); 
	                break;
	 case 0x002E:   //  休眠时汇报距离间隔  单位 米
	               if(infolen!=4)
						break;					
					JT808Conf_struct.DISTANCE.Sleep_Dist=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8) +Content[3];
                    Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
					rt_kprintf("\r\n 休眠时定距上报间隔: %d m\r\n",JT808Conf_struct.DISTANCE.Sleep_Dist); 
	                break;
	 case 0x002F:   //  紧急报警时汇报距离间隔  单位 米
	               if(infolen!=4)
						break;					
					JT808Conf_struct.DISTANCE.Emergen_Dist=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8) +Content[3];
                    Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
					rt_kprintf("\r\n 紧急报警时定距上报间隔: %d m\r\n",JT808Conf_struct.DISTANCE.Emergen_Dist); 
	                break;
	 case 0x0030:   //  拐点补传角度 , <180
                    if(infolen!=4)
						break;					
					JT808Conf_struct.DURATION.SD_Delta_maxAngle=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8) +Content[3];
                    Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
					rt_kprintf("\r\n 拐点补传角度: %d 度\r\n",JT808Conf_struct.DISTANCE.Emergen_Dist);  
	                break;
  
	 case 0x0040:   //   监控平台电话号码  
	                 if(infolen==0)
					 	 break;
					i=strlen((const char*)JT808Conf_struct.LISTEN_Num);
					rt_kprintf("\r\n old: %s \r\n",JT808Conf_struct.LISTEN_Num);
					 
					memset(JT808Conf_struct.LISTEN_Num,0,sizeof(JT808Conf_struct.LISTEN_Num));
					memcpy(JT808Conf_struct.LISTEN_Num,Content,infolen);											
					Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));  
 					rt_kprintf("\r\n new: %s \r\n",JT808Conf_struct.LISTEN_Num);
                     
	                //CallState=CallState_rdytoDialLis;  // 准备开始拨打监听号码 
	                rt_kprintf("\r\n 设置监控平台号码: %s \r\n",JT808Conf_struct.LISTEN_Num);   

	                break;
	 case 0x0041:   //   复位电话号码，可采用此电话号码拨打终端电话让终端复位
                    if(infolen==0)
					 	 break;
					memset(reg_str,0,sizeof(reg_str)); 
					memcpy(reg_str,Content,infolen);											
 					rt_kprintf("\r\n 复位电话号码 %s \r\n",reg_str);  
	                break;
	 case 0x0042:   //   恢复出厂设置电话，可采用该电话号码是终端恢复出厂设置

	                break;
	 case 0x0045:   //  终端电话接听策略 0 自动接听  1 ACC ON自动接听 OFF时手动接听

	                break;
	 case 0x0046:   //  每次通话最长时间 ，单位  秒
                    
	                break;
	 case 0x0047:   //  当月最长通话时间，单位  秒

	                break;
	 case 0x0048:   //  监听电话号码                    
					if(infolen==0)
						 break;
					memset(JT808Conf_struct.LISTEN_Num,0,sizeof(JT808Conf_struct.LISTEN_Num));
					memcpy(JT808Conf_struct.LISTEN_Num,Content,infolen); 										
					Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));  
					CallState=CallState_rdytoDialLis;  // 准备开始拨打监听号码 
					rt_kprintf("\r\n 立即拨打监听号码: %s \r\n",JT808Conf_struct.LISTEN_Num);  
	                break;  

	    //----------				
	 case 0x0050:  //  报警屏蔽字， 与位置信息中报警标志相对应。相应位为1时报警被屏蔽---
                    
                    if(infolen!=4)
						break;	
                    Warn_MaskWord[0]=Content[0];
					Warn_MaskWord[1]=Content[1];
					Warn_MaskWord[2]=Content[2];
					Warn_MaskWord[3]=Content[3];  
				    resualtu32=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8) +Content[3]; 
                    rt_kprintf("\r\n 报警屏蔽字: %x \r\n",resualtu32);    //
					break;
	 case 0x0052:  //  报警拍照开关， 与报警标志对应的位1时，拍照

	                break;
	 case 0x0053:  //  报警拍照存储  	与报警标志对应的位1时，拍照存储 否则实时上传

	                break;
	 case 0x0054:  //  关键标志  		与报警标志对应的位1  为关键报警
	                     if(infolen!=4)
						break;	
                    Key_MaskWord[0]=Content[0];
					Key_MaskWord[1]=Content[1];
					Key_MaskWord[2]=Content[2];
					Key_MaskWord[3]=Content[3];  
				    resualtu32=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8) +Content[3]; 
                    rt_kprintf("\r\n 关键报警标志: %x \r\n",resualtu32);    // 
		 

	                break;
        //---------  
					
	 case 0x0055:  //  最高速度   单位   千米每小时
                   if(infolen!=4)
						break;
				    JT808Conf_struct.Speed_warn_MAX=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8)	+Content[3];
				   memset(reg_str,0,sizeof(reg_str));
				   memcpy(reg_str,& JT808Conf_struct.Speed_warn_MAX,4);
				   memcpy(reg_str+4,&JT808Conf_struct.Spd_Exd_LimitSeconds,4);
				    Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
				   rt_kprintf("\r\n 最高速度: %d km/h \r\n", JT808Conf_struct.Speed_warn_MAX); 
				   Spd_ExpInit();
	                break;
	 case 0x0056:  //  超速持续时间    单位 s
                   if(infolen!=4)
						break;
				   JT808Conf_struct.Spd_Exd_LimitSeconds=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8)	+Content[3];
				   memset(reg_str,0,sizeof(reg_str));
				   memcpy(reg_str,& JT808Conf_struct.Speed_warn_MAX,4);
				   memcpy(reg_str+4,&JT808Conf_struct.Spd_Exd_LimitSeconds,4); 
				    Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
				   rt_kprintf("\r\n 超时持续时间: %d s \r\n",JT808Conf_struct.Spd_Exd_LimitSeconds); 
				   Spd_ExpInit();
	                break;
	 case 0x0057:  //  连续驾驶时间门限 单位  s
					 if(infolen!=4)
						  break;
				   TiredConf_struct.TiredDoor.Door_DrvKeepingSec=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8)   +Content[3];
                               Api_Config_write(tired_config,0,(u8*)&TiredConf_struct,sizeof(TiredConf_struct));				  
				   Warn_Status[3]&=~0x04;  //BIT(2)	接触疲劳驾驶报警 
				   TIRED_Drive_Init();    // 清除疲劳驾驶状态      
				    rt_kprintf("\r\n 连续驾驶时间门限: %d s \r\n",TiredConf_struct.TiredDoor.Door_DrvKeepingSec);  
	               break;
	 case 0x0058:  //  当天累计驾驶时间门限  单位  s
				   if(infolen!=4)
						break;
				   TiredConf_struct.TiredDoor.Door_DayAccumlateDrvSec=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8)   +Content[3];
                               Api_Config_write(tired_config,0,(u8*)&TiredConf_struct,sizeof(TiredConf_struct));			
				   TiredConf_struct.Tired_drive.ACC_ONstate_counter=0;
				   TiredConf_struct.Tired_drive.ACC_Offstate_counter=0;
                                Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct)); 
                               rt_kprintf("\r\n 当天累计驾驶时间: %d s \r\n",TiredConf_struct.TiredDoor.Door_DayAccumlateDrvSec); 
	                break;
     case 0x0059:  //  最小休息时间  单位 s
				   if(infolen!=4)
						break;
				    TiredConf_struct.TiredDoor.Door_MinSleepSec=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8)   +Content[3];
                               Api_Config_write(tired_config,0,(u8*)&TiredConf_struct,sizeof(TiredConf_struct));				  
					rt_kprintf("\r\n 最小休息时间: %d s \r\n",TiredConf_struct.TiredDoor.Door_MinSleepSec);  
	                break;
	 case 0x005A:  //  最长停车时间   单位 s
					 if(infolen!=4)
						  break;
					TiredConf_struct.TiredDoor.Door_MaxParkingSec=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8)	 +Content[3];
                                   Api_Config_write(tired_config,0,(u8*)&TiredConf_struct,sizeof(TiredConf_struct));				
					TiredConf_struct.TiredDoor.Parking_currentcnt=0; 
					 Warn_Status[1]&=~0x08;  // 清除超时触发 
					rt_kprintf("\r\n 最长停车时间: %d s \r\n",TiredConf_struct.TiredDoor.Door_MaxParkingSec);   
	                break;
	     //--------- 
	 case  0x0070: //  图像/视频质量  1-10  1 最好

	                break;
	 case  0x0071: //  亮度  0-255

	                break;
	 case  0x0072: //  对比度  0-127

	                break;
	 case  0x0073: // 饱和度  0-127

	                break;
	 case  0x0074: // 色度   0-255

	                break;
		  //---------
	 case  0x0080: // 车辆里程表读数   1/10 km
	                // resualtu32=JT808Conf_struct.Distance_m_u32/100;
					 
					 resualtu32=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8)  +Content[3];					
                     Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
					 rt_kprintf("\r\n 中心设置里程:  %d  1/10km/h\r\n",resualtu32);  
					

	                break;
	 case  0x0081: // 车辆所在的省域ID
	                if(infolen!=2)
						  break;
					JT808Conf_struct.Vechicle_Info.Dev_ProvinceID=(Content[0]<<8)+Content[1];
                                   Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
					rt_kprintf("\r\n 车辆所在省域ID: 0x%X \r\n",JT808Conf_struct.Vechicle_Info.Dev_ProvinceID); 
	                break;
	 case  0x0082: // 车辆所在市域ID
	                if(infolen!=2)
						  break;
					JT808Conf_struct.Vechicle_Info.Dev_ProvinceID=(Content[0]<<8)+Content[1];
                                   Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
					rt_kprintf("\r\n 车辆所在市域ID: 0x%X \r\n",JT808Conf_struct.Vechicle_Info.Dev_ProvinceID); 
	                break;
	 case  0x0083: // 公安交通管理部门颁发的机动车号牌
	                if(infolen<4)
						  break;					
					memset(JT808Conf_struct.Vechicle_Info.Vech_Num,0,sizeof(JT808Conf_struct.Vechicle_Info.Vech_Num));
					memcpy(JT808Conf_struct.Vechicle_Info.Vech_Num,Content,infolen);
                                   Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
					rt_kprintf("\r\n 机动车驾驶证号: %s  \r\n",JT808Conf_struct.Vechicle_Info.Vech_Num);  
	                break;
	 case  0x0084: // 车牌颜色  按照国家规定
	                if(infolen!=1)
						  break;
					JT808Conf_struct.Vechicle_Info.Dev_Color=Content[0];           
                                   Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
					rt_kprintf("\r\n 车辆颜色: %d  \r\n",JT808Conf_struct.Vechicle_Info.Dev_Color);    

					//  redial();
										 Stop_Dial=1;
										// idip("clear");
	                break;
       //--------------- BD  新增----------------------------------
       case  0x001A: //  IC卡 主服务器或域名
                                    memset(reg_in,0,sizeof(reg_in)); 
					  memcpy(reg_in,Content,infolen);
					 //----------------------------	
					 
