nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
	 case 0xC4: //   设置初始里程	
	          
            /*   Time2BCD( Original_info + Original_info_Wr );                       // 记录仪实时时间
				Original_info_Wr					+= 6;
				Original_info[Original_info_Wr++]	= 0x13;                         // 初次安装时间
				Original_info[Original_info_Wr++]	= 0x03;
				Original_info[Original_info_Wr++]	= 0x01;
				Original_info[Original_info_Wr++]	= 0x08;
				Original_info[Original_info_Wr++]	= 0x30;
				Original_info[Original_info_Wr++]	= 0x26; 
			*/

			
			     // instr     + 12      设置初始里程的位置   BCD
			     
			reg_dis=(Instr[12]>>4)*10000000+(Instr[12]&0x0F)*1000000+(Instr[13]>>4)*100000+(Instr[13]&0x0F)*10000 \
			       +(Instr[14]>>4)*1000+(Instr[14]&0x0F)*100+(Instr[15]>>4)*10+(Instr[15]&0x0F);  

			JT808Conf_struct.Distance_m_u32=reg_dis*100;  
			Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct)); 
		/*	//--- 初始里程
			Original_info[Original_info_Wr++]	= 0x00;
			Original_info[Original_info_Wr++]	= 0x00;
			Original_info[Original_info_Wr++]	= 0x00;
			Original_info[Original_info_Wr++]	= 0x00;
			// -- 累积里程 3个字节 单位0.1km    6位
			regdis								= JT808Conf_struct.Distance_m_u32 / 100; //单位0.1km
			reg2								= regdis / 100000;
			Original_info[Original_info_Wr++]	= 0x00;
			Original_info[Original_info_Wr++]	= ( reg2 << 4 ) + ( regdis % 100000 / 10000 );
			Original_info[Original_info_Wr++]	= ( ( regdis % 10000 / 1000 ) << 4 ) + ( regdis % 1000 / 100 );
			Original_info[Original_info_Wr++]	= ( ( regdis % 100 / 10 ) << 4 ) + ( regdis % 10 );
			*/
	              
	             break;
	 default:
	 	        Recode_Obj.Error=2; // 设置错误
				break;
   }


}
//-----------------------------------------------
u8  CentreSet_subService_FF01H(u32 SubID, u8 infolen, u8 *Content )
{  
 
 
  u32  baud=0;
  u8    u3_Txstr[40];
  u8    Destu3_Txstr[40];
  u8    len=0;
		u8 i=0;


   rt_kprintf("\r\n    收到扩展终端设置命令 SubID=%X \r\n",SubID);  
	   
  switch(SubID)
   {
	 case 0x0003:  //  BNSS NMEA 输出更新率               
                    if(infolen!=4)
						break;					
 		       BD_EXT.BD_OutputFreq=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8) +Content[3];
                     switch(BD_EXT.BD_OutputFreq)
                     	{
                                 case 0x00: 
							 baud=500;
							 gps_write("$PCAS02,500*1A\r\n",16);	
 							 rt_thread_delay(5);	
							 break;
				     case 0x01:
					 	          baud=1000;
							  gps_write("$PCAS02,1000*2E\r\n",16);
							  rt_thread_delay(5);	
							  break;
				     case 0x02: 			  
							  baud=2000;
							 gps_write("$PCAS02,2000*2D\r\n",16);
							 rt_thread_delay(5);	
							  break;
				     case  0x03:
					 	         baud=3000;
							 gps_write("$PCAS02,3000*2C\r\n",16);
							 rt_thread_delay(5);	
							 break;
				     case  0x04:
					 	        baud=4000;
							 gps_write("$PCAS02,4000*2B\r\n",16);
							 rt_thread_delay(5);	
							 break;

                     	}
			     // BD_EXT_Write();   
			      rt_kprintf("\r\n  GNSS 输出更新: %dms\r\n",baud);  
	                break;
	 case 0x0004:  // GNSS 采集NMEA 数据频率               
                    if(infolen!=4)
						break;					
			 BD_EXT.BD_SampleFrea=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8) +Content[3];
                       rt_kprintf("\r\n GNSS 采集频率: %d s\r\n", BD_EXT.BD_SampleFrea);   
	                break;
	 case 0x0005:  //  CAN 1  参数设置               
                    if(infolen!=4)
						break;					
			BD_EXT.CAN_1_Mode=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8) +Content[3];
                     CAN_App_Init();
			//BD_EXT_Write();   
			rt_kprintf("\r\n 中心设置CAN1 : 0x%08X\r\n",BD_EXT.CAN_1_Mode); 
			break;
	 case 0x0006:  //  CAN2   参数设置    ----- 要和小板通信
                    if(infolen!=4)
						break;					
			BD_EXT.CAN_2_Mode=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8) +Content[3];
                    // BD_EXT_Write();  
			memset( u3_Txstr,0,sizeof(u3_Txstr));
			memset( Destu3_Txstr,0,sizeof(Destu3_Txstr));	 	 
			u3_Txstr[0]=0x7E;       // 头
		       u3_Txstr[1]=0x33;		//  CAN 相关
		       u3_Txstr[2]=0x01;    //  参数设置 
		       u3_Txstr[3]=(BD_EXT.CAN_2_Mode>>24);
			u3_Txstr[4]=(BD_EXT.CAN_2_Mode>>16);   	
	              u3_Txstr[5]=(BD_EXT.CAN_2_Mode>>8);	       
                     u3_Txstr[6]=(BD_EXT.CAN_2_Mode);	  
			u3_Txstr[7]=0x7E;	              				 

                     Destu3_Txstr[0]=0x7E;
			len=Protocol_808_Encode(Destu3_Txstr+1, u3_Txstr+1, 6);
			Destu3_Txstr[len+1]=0x7E;
		
			rt_kprintf("\r\n U3_orginal:");
			for(i=0;i<8;i++)
				rt_kprintf("% 02X",u3_Txstr[i]); 
			rt_kprintf("\r\nU3_len=%d \r\n",len);
			for(i=0;i<len+2;i++)
				rt_kprintf("% 02X",Destu3_Txstr[i]);     
			 // U3_PutData(Destu3_Txstr,len+2);  //  发送给串口	
			rt_device_write(&Device_CAN2,0, Destu3_Txstr,len+2);       
			rt_kprintf("\r\n 中心设置CAN2 : 0x%08X\r\n",BD_EXT.CAN_2_Mode);    
	                break; 
        case 0x0007:  //  碰撞参数设置
                    if(infolen!=4)
						break;					
			BD_EXT.Collision_Check=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8) +Content[3];
                     //BD_EXT_Write();   
			memset( u3_Txstr,0,sizeof(u3_Txstr));
			memset( Destu3_Txstr,0,sizeof(Destu3_Txstr));		 
			u3_Txstr[0]=0x7E;       // 头
		       u3_Txstr[1]=0x32;		//  CAN 相关 
		       u3_Txstr[2]=0x01;    //  参数设置 
		       u3_Txstr[3]=(BD_EXT.Collision_Check>>24);
			u3_Txstr[4]=(BD_EXT.Collision_Check>>16);   	
	              u3_Txstr[5]=(BD_EXT.Collision_Check>>8);	       
                     u3_Txstr[6]=BD_EXT.Collision_Check;	 
			u3_Txstr[7]=0x7E;	               				 

			Destu3_Txstr[0]=0x7E;
			len=Protocol_808_Encode(Destu3_Txstr+1, u3_Txstr+1, 6);
			Destu3_Txstr[len+1]=0x7E;

			//   设置配置碰撞参数
			mma8451_config((uint16_t) (BD_EXT.Collision_Check>>16),(uint16_t) (BD_EXT.Collision_Check));
			rt_kprintf("\r\n 中心设置碰撞参数: 0x%08X\r\n",BD_EXT.Collision_Check);; 
	              break; 
		
	 default: 
				return false; 
   }
   rt_thread_delay(20);	   	  
    return true;
}
//--------------------------------------------------
u8  CentreSet_subService_FF03H(u32 SubID, u8 infolen, u8 *Content )
{  
    u8  i=0;
    u8    u3_Txstr[40];
    u8    Destu3_Txstr[40];
    u8    len=0;


   rt_kprintf("\r\n    收到扩展终端参数设置1 命令 SubID=%X \r\n",SubID);  
	   
