nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
  switch(SubID)
   {
     case 0x0001:  // CAN ID 设置
                    if(infolen<4)
						break;			 		
		        // Content[0];  //  设置属性
			  //Content[1] ;//本消息中包含CAN ID 的数量
		     //------------------------------------	  
			//Content[2];  //  CAN ID 的ID 			
		     if(Content[3]&0x80)//  CAN ID   的属性  
		     	{
			      BD_EXT.CAN_2_ID=(Content[4]<<24)+(Content[5]<<16)+(Content[6]<<8)+Content[7];// 
                            if(Content[3]&0x40)
					 BD_EXT.CAN_2_Type=1; // 标准帧
				else 
					 BD_EXT.CAN_2_Type=0;  
			      BD_EXT.CAN_2_TransDuration=(Content[9]<<8)+Content[10];   // 0   表示停止

				 
				//     得有个和小板通信的处理
				memset( Destu3_Txstr,0,sizeof(Destu3_Txstr));		 
				u3_Txstr[0]=0x7E;       // 头
			       u3_Txstr[1]=0x33;		//  CAN 相关
			       u3_Txstr[2]=0x02;    //  参数设置 
			       u3_Txstr[3]=Content[3]; // 属性
			       u3_Txstr[4]=Content[4]; //  ID 
				u3_Txstr[5]=Content[5];   	
		              u3_Txstr[6]=Content[6];	       
	                     u3_Txstr[7]=Content[7];
				u3_Txstr[8]=Content[8]; // ID 		 
				u3_Txstr[9]=Content[9]; 	//
				u3_Txstr[10]=Content[10]; 	
				u3_Txstr[11]=0x7E;	              				 

				 Destu3_Txstr[0]=0x7E;
			        len=Protocol_808_Encode(Destu3_Txstr+1, u3_Txstr+1, 10);  
			        Destu3_Txstr[len+1]=0x7E;

			       rt_kprintf("\r\nU3_len=%d   :\r\n",len);  
			       for(i=0;i<len+2;i++)
				        rt_kprintf("% 02X",Destu3_Txstr[i]);     	 
				   
			       // U3_PutData(Destu3_Txstr,len+2);  //  发送给串口	
			       rt_device_write(&Device_CAN2,0, Destu3_Txstr,len+2);       
				rt_kprintf("\r\n 中心设置CAN2 : 0x%08X   Dur: %d s\r\n",BD_EXT.CAN_2_ID,BD_EXT.CAN_2_TransDuration);     
			        //----------------------------------
			 } 
			 else
     			   {
      			       BD_EXT.CAN_1_ID=(Content[4]<<24)+(Content[5]<<16)+(Content[6]<<8)+Content[7];// 
                             if(Content[3]&0x40)   
					 BD_EXT.CAN_1_Type=1; // 标准帧
				else 
					 BD_EXT.CAN_1_Type=0;   
				 BD_EXT.CAN_1_TransDuration=(Content[9]<<8)+Content[10];  // 0   表示停止  

				rt_kprintf("\r\n 中心设置CAN1 : 0x%08X   Dur: %d s\r\n",BD_EXT.CAN_1_ID,BD_EXT.CAN_1_TransDuration);    

			   }   
                    BD_EXT_Write();    
                    break;
	 case 0x0002:  // 文本信息标志含义     
	            // Content[0]; // 没用
	              //if((Content[1]==0)||(Content[1]==1))  //  部分类型都给显示屏 
	             	{
				memset( TextInfo.TEXT_Content,0,sizeof(TextInfo.TEXT_Content));
				DwinLCD.TxInfolen=AsciiToGb(TextInfo.TEXT_Content,infolen-2,Content+2);
				//memcpy(TextInfo.TEXT_Content,Content+2,infolen-2);
				TextInfo.TEXT_SD_FLAG=1;	// 置发送给显示屏标志位  // ||||||||||||||||||||||||||||||||||
                            rt_kprintf("\r\n  CAN 文本:  "); 
				for(i=0;i<DwinLCD.TxInfolen;i++) 
							 rt_kprintf("%c",TextInfo.TEXT_Content[i]);
				  rt_kprintf("\r\n ");
			}	

		          #ifdef LCD_5inch
						           //======  信息都在屏幕上显示  
                                                   memset(DwinLCD.TXT_content,0,sizeof(DwinLCD.TXT_content)); 
                                                   DwinLCD.TXT_contentLen=AsciiToGb(DwinLCD.TXT_content,infolen-2,Content+2);  						  
							  DwinLCD.Type=LCD_SDTXT;  						
							   
			   #endif  		

		      break;
	 default: 
				return false;
   }
    return true;
}
//-------------------------------------------
void  Media_Start_Init( u8  MdType , u8  MdCodeType)
{  
  MediaObj.Media_Type=MdType;//	指定当前传输多媒体的类型   0  表示图片
  MediaObj.Media_CodeType=MdCodeType;  //  多媒体编码格式   0  表示JPEG	格式 
  MediaObj.SD_media_Flag=1;   //  置多媒体事件信息发送标志位  ，开始图片传输  
  MediaObj.SD_Eventstate=1;		  //  开始处于发送状态 
  MediaObj.RSD_State=0;  
  MediaObj.RSD_Timer=0;
  MediaObj.RSD_total=0;
  MediaObj.RSD_Reader=0;
  MediaObj.SD_Data_Flag=0; 
  MediaObj.Media_transmittingFlag=0;      
   //------------  add  for debuging   --------------
  // Media_Clear_State();  //  clear  
 /*  if(0==MediaObj.Media_Type)
	{
	   Photo_sdState.photo_sending=enable; 
	   Photo_sdState.SD_packetNum=1; // 第一包开始  
	   rt_kprintf("\r\n 开始上传照片! ....\r\n");  												
    }
  */
   //---------------------------------------------------- 
}

void Media_Clear_State(void)
{
     // 不清楚Meia Type
    MediaObj.MaxSd_counter=0;
    MediaObj.SD_Eventstate=0;
    MediaObj.SD_timer=0;
    MediaObj.SD_media_Flag=0;	
	MediaObj.SD_Data_Flag=0; 
	MediaObj.RSD_State=0;
	MediaObj.RSD_Timer=0;
	MediaObj.RSD_total=0;
	MediaObj.RSD_Reader=0;
	MediaObj.Media_transmittingFlag=0;
}
void  Media_Timer(void)
{
  if(1==MediaObj.SD_Eventstate) 
  	{
  	  MediaObj.SD_timer++;
      if(MediaObj.SD_timer>6) 
      	{
            MediaObj.SD_timer=0;			
            MediaObj.SD_media_Flag=1; 
			MediaObj.MaxSd_counter++;
			if(MediaObj.MaxSd_counter>5)
                   Media_Clear_State();  
      	}

  	}
}
void Media_RSdMode_Timer(void)
{
    if((1==MediaObj.RSD_State))
	   	{ 
	        MediaObj.RSD_Timer++;
			if(MediaObj.RSD_Timer>35) 
				{
	              MediaObj.RSD_Timer=0;
				  MediaObj.SD_Data_Flag=1; // 置重传发送多媒体信息标志位
				  switch(MediaObj.Media_Type)    //   图片重传包数
				  	{
				  	 case 0://  图像
				  	         Photo_sdState.SD_packetNum=MediaObj.Media_ReSdList[MediaObj.RSD_Reader];
	                                    Photo_sdState.SD_flag=1;
							 break;
					 case 1:// 音频                             
				  	         Sound_sdState.SD_packetNum=MediaObj.Media_ReSdList[MediaObj.RSD_Reader];
	                                     Sound_sdState.SD_flag=1;  
					         break;
					 case 2:// 视频
							 Video_sdState.SD_packetNum=MediaObj.Media_ReSdList[MediaObj.RSD_Reader];
							 Video_sdState.SD_flag=1;   					          
					         break;
				     default:
					 	     break;

				  	}	
				        //-----  重传列表 递增 -----------
				      	   MediaObj.RSD_Reader++;
					   // rt_kprintf("\r\n	  MediaObj.RSD_Reader++  =%d\r\n",MediaObj.RSD_Reader);      
					   if(MediaObj.RSD_Reader==MediaObj.RSD_total)
					   	    MediaObj.RSD_State=2; //  置位等待状态，等待着中心再发重传指令

				}
	   	} 
      else
	  if(2==MediaObj.RSD_State)
	  {
          MediaObj.RSD_Timer++;		  
		  if(MediaObj.RSD_Timer>140)   //   如果状态一直在等待且超过30s择清除状态 
		  { 
		     switch (MediaObj.Media_Type)
	         {
	          case 0 : // 图像
	                  Photo_send_end();  // 拍照上传结束
	                  
			          break;
			  case 1 : // 音频
			         Sound_send_end();  
			          break;
			  case 2 : // 视频
                               Video_send_end();
			          break;
			  default:
			  	      break;
	         } 
            Media_Clear_State();
			rt_kprintf("\r\n 信息重传超时结束! \r\n");
			
