nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
			//Check_MultiTakeResult_b4Trans();  // 多路摄像头拍照状态检测
			
		  }

	  }
   


	
}
#ifdef   MEDIA
//-------- photo send -------------------------------------
void Photo_send_start(u16 Numpic)  
{
  
//  UINT ByteRead;  
 // FIL FileCurrent; 

        rt_kprintf("   \r\n  Photo_send_start =%d \r\n",Numpic); 
        Photo_sdState.photo_sending=disable;  
	 Photo_sdState.SD_flag=0;  
	 Photo_sdState.SD_packetNum=1; // 从1 开始
        Photo_sdState.Exeption_timer=0;
	 
	if(Camera_Number==1)
	             PicFileSize=Api_DFdirectory_Query(camera_1, 1);
	else
	if(Camera_Number==2)
		     PicFileSize=Api_DFdirectory_Query(camera_2, 1);	   
	else
	if(Camera_Number==3)
		     PicFileSize=Api_DFdirectory_Query(camera_3, 1);   
	else
	if(Camera_Number==4)
		     PicFileSize=Api_DFdirectory_Query(camera_4, 1);    		
		
		
      //	 DF_ReadFlash(pic_current_page, 0,PictureName, 23);
     //      Camera_Number=PictureName[18]; 
     //      memcpy((u8*)&PicFileSize,PictureName+19,4); 
	 //pic_current_page++; //指向文件内容 
	 //pic_PageIn_offset=0;// 图片读取页内偏移地址 
	// rt_kprintf("\r\n    open Pic =%s",PictureName); 
	  
	  if(PicFileSize%512)
	     Photo_sdState.Total_packetNum=PicFileSize/512+1;
	  else
	  	 Photo_sdState.Total_packetNum=PicFileSize/512;

	 rt_kprintf("\r\n    Camera %d  ReadpicStart total :%d ，Pagesize: %d Bytes\r\n\r\n",Camera_Number,Photo_sdState.Total_packetNum,PicFileSize);    
	 if((Camera_Number==0)||(Photo_sdState.Total_packetNum==0))
	 {
	   Photo_send_end(); // clear  state 
       rt_kprintf("\r\n  图片总包数为空 ，摄像头序号为0 ，发送拍照失败到中心 \r\n");    
	 }


      // -------  MultiMedia Related --------
      Media_Start_Init(0,0);

}





u8  Sound_send_start(void)
{
  u8 sound_name[20]; 
  u16  i;
//  u8  oldstate=0;
//  u16 i2,j; 
 // u8  WrieEnd=0,LeftLen=0; 
  

  Sound_sdState.photo_sending=disable;  
  Sound_sdState.SD_flag=0;  
  Sound_sdState.SD_packetNum=1; // 从1 开始
  Sound_sdState.Exeption_timer=0;
   
 //---  Speex_Init();	 // speachX 初始化	 
  // 1. 查找最新的文件
/*  memset((u8*)&MediaIndex,0,sizeof(MediaIndex)); 
  for(i=0;i<8;i++)
  {
	 Api_RecordNum_Read(voice_index, i+1, (u8*)&MediaIndex, sizeof(MediaIndex));
        if(MediaIndex.Effective_Flag==1)
        {  
            break;
	  }       
  }
  if(MediaIndex.Effective_Flag)  	
  { 
	rt_kprintf("\r\n 索引filename:%s\r\n",MediaIndex.FileName);
  }	
  else
  	{
  	   rt_kprintf("\r\n 没有已存储的音频文件 \r\n");
  	   return false	;
  	}

*/
    
	//	2.	创建wav 文件   

	//	3. 文件大小
	  // file name
	memset(sound_name,0,sizeof(sound_name));
	DF_ReadFlash(SoundStart_offdet, 4, sound_name,20);
       SrcFileSize=Api_DFdirectory_Query(voice, 1);
     //  Sound_sdState.Total_packetNum=(SrcFileSize/512); // 每包100个字节
        if(SrcFileSize%512)
	     Sound_sdState.Total_packetNum=SrcFileSize/512+1;
	  else
	  	 Sound_sdState.Total_packetNum=SrcFileSize/512; 
	rt_kprintf("\r\n	文件名: %s大小: %d Bytes  totalpacketnum=%d \r\n",sound_name,SrcFileSize,Sound_sdState.Total_packetNum);
  
    // -------  MultiMedia Related --------
    //  Media_Start_Init(1,5); // 音频  wav 格式   0:JPEG ;   1: TIF ;   2:MP3;  3:WAV  4: WMV  其他保留   
                                           //    5   amr
         Media_Start_Init(1,17);                                            
     return true;  
}

u8  MP3_send_start(void) 
{
   u8   mp3_name[13];
  mp3_sendstate=1;
  Sound_sdState.photo_sending=disable;  
  Sound_sdState.SD_flag=0;  
  Sound_sdState.SD_packetNum=1; // 从1 开始
    Sound_sdState.Exeption_timer=0;

    memset(mp3_name,0,sizeof(mp3_name));
	memcpy(mp3_name,"ch12.mp3",8);
	
	if(mp3_fsize%512)
	   Sound_sdState.Total_packetNum=mp3_fsize/512+1;
	else
	   Sound_sdState.Total_packetNum=mp3_fsize/512;

	rt_kprintf("\r\n  mp3文件名称:%s    文件大小  %d Bytes  \r\n",mp3_name,mp3_fsize);
  
    // -------  MultiMedia Related --------
    Media_Start_Init(1,2); // 音频  wav 格式       
	return true;
}

u8  Video_send_start(void)
{
   u8 video_name[13];
   	
  wmv_sendstate=1;
  Video_sdState.photo_sending=disable;  
  Video_sdState.SD_flag=0;  
  Video_sdState.SD_packetNum=1; // 从1 开始
  Video_sdState.Exeption_timer=0;

    memset(video_name,0,sizeof(video_name));
	memcpy(video_name,"ch1.wmv",7);
	
    if(wmv_fsize%512)
	   Video_sdState.Total_packetNum=wmv_fsize/512+1;
	else
	   Video_sdState.Total_packetNum=wmv_fsize/512;  

	rt_kprintf("\r\n  wmv文件名称:%s    文件大小  %d Bytes  \r\n",video_name,wmv_fsize);
  
    // -------  MultiMedia Related --------
    Media_Start_Init(2,4); // 音频  wav 格式       
	return true; 
}



void Photo_send_end(void)
{
        Photo_sdState.photo_sending=0;
	 Photo_sdState.SD_flag=0;
	 Photo_sdState.SD_packetNum=0;
	 Photo_sdState.Total_packetNum=0;
	 Photo_sdState.Exeption_timer=0;
	 MediaObj.Media_transmittingFlag=0;  // clear  
	 Media_Clear_State(); 
} 
void Sound_send_end(void) 
{
       Sound_sdState.photo_sending=0;
	 Sound_sdState.SD_flag=0;
	 Sound_sdState.SD_packetNum=0;
	 Sound_sdState.Total_packetNum=0;
	  Sound_sdState.Exeption_timer=0;
	 MediaObj.Media_transmittingFlag=0;  // clear  
	 mp3_sendstate=0;
	 VocREC.running=0;   // clear
	 Media_Clear_State(); 
} 

void Video_send_end(void)  
{
       Video_sdState.photo_sending=0;
	 Video_sdState.SD_flag=0;
	 Video_sdState.SD_packetNum=0;
	 Video_sdState.Total_packetNum=0;
	 Video_sdState.Exeption_timer=0;
	 MediaObj.Media_transmittingFlag=0;  // clear  
	 wmv_sendstate=0;
	 Media_Clear_State(); 
} 

void Video_Timer(void)
{
  
  if((Video_sdState.photo_sending==enable)&&(2==MediaObj.Media_Type)) // 视频
  {
	 if((Video_sdState.SD_packetNum<=Video_sdState.Total_packetNum+1)&&(2!=MediaObj.RSD_State))  
	  {  //  一下定时器在	在顺序发送过过程中	 和   收到重传开始后有效
		  Video_sdState.Data_SD_counter++;
		  if( Video_sdState.Data_SD_counter>40)   
			  {
				 Video_sdState.Data_SD_counter=0;
				 Video_sdState.SD_flag=1;
				 MediaObj.SD_Data_Flag=1; 
				 Video_sdState.Exeption_timer=0;
				 //rt_kprintf("\r\n Video send Flag \r\n"); 
				 
			  }
	  }   
  }
}

void Sound_Timer(void)
{
  
  if((Sound_sdState.photo_sending==enable)&&(1==MediaObj.Media_Type)) // 音频
  {
	 if((Sound_sdState.SD_packetNum<=Sound_sdState.Total_packetNum+1)&&(2!=MediaObj.RSD_State))  
	  {  //  一下定时器在	在顺序发送过过程中	 和   收到重传开始后有效
		  Sound_sdState.Data_SD_counter++;
		  if( Sound_sdState.Data_SD_counter>20)         
			  {
				 Sound_sdState.Data_SD_counter=0;
				  Sound_sdState.Exeption_timer=0;
				 Sound_sdState.SD_flag=1;
				 MediaObj.SD_Data_Flag=1; 
				 
