nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
											   Sound_sdState.photo_sending=enable; 
											   Sound_sdState.SD_packetNum=1; // 第一包开始 
											   PositionSD_Enable();  //   使能上报 
											   Current_UDP_sd=1;
											   rt_kprintf("\r\n 开始上传音频! ....\r\n");    												
                            	            }	
											else
											if(2==MediaObj.Media_Type)
											{
											   MediaObj.Media_transmittingFlag=1;   
											   PositionSD_Enable();  //   使能上报
											   Current_UDP_sd=1;
											   Video_sdState.photo_sending=enable; 
											   Video_sdState.SD_packetNum=1; // 第一包开始   
											   rt_kprintf("\r\n 开始上传视频! ....\r\n");    												
                            	            }	
											break;
						    case 0x0702: 
                                          rt_kprintf("\r\n  驾驶员信息上报---中心应答!  \r\n"); 							       
											 
							           break;
							case 0x0701: 
                                           rt_kprintf("\r\n  电子运单上报---中心应答!  \r\n"); 							       
											 
							           break;		   
						       case 0x0705:     //
                                                                  rt_kprintf("\r\n can-ack"); 
							           break; 
									   
							default	 :
								       break;
					   	}
					   
					    //-------------------------------
				      break;
           case  0x8100:    //  监控中心对终端注册消息的应答		
                       //-----------------------------------------------------------
					   switch(UDP_HEX_Rx[15])
                        	{
                               case 0: rt_kprintf("\r\n   ----注册成功\r\n");
							           memset(JT808Conf_struct.ConfirmCode,0,sizeof(JT808Conf_struct.ConfirmCode));
                                       memcpy(JT808Conf_struct.ConfirmCode,UDP_HEX_Rx+16,infolen-3);

									   memset(Reg_buf,0,sizeof(Reg_buf));
							           memcpy(Reg_buf,JT808Conf_struct.ConfirmCode,20);
									   JT808Conf_struct.Regsiter_Status=1; 
							           Reg_buf[20]=JT808Conf_struct.Regsiter_Status;
                                Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));   
									   rt_kprintf("鉴权码: %s\r\n		   鉴权码长度: %d\r\n",JT808Conf_struct.ConfirmCode,strlen((const char*)JT808Conf_struct.ConfirmCode)); 
                                       //-------- 开始鉴权 ------
									   DEV_Login.Operate_enable=1;  
									   break;
							   case 1: rt_kprintf("\r\n   ----车辆已被注册\r\n");
									   break;	
							   case 2: rt_kprintf("\r\n   ----数据库中无该车辆\r\n");
									   break;
							   case 3: rt_kprintf("\r\n   ----终端已被注册\r\n");  
							           if(0==JT808Conf_struct.Regsiter_Status)  
                                        {
                                          ;//JT808Conf_struct.Regsiter_Status=2;  // not  1
                                          //DEV_regist.DeRegst_sd=1;
							           	}  
									   else
									   if(1==JT808Conf_struct.Regsiter_Status) 
							                    DEV_Login.Operate_enable=1; //开始鉴权 
							          
									   break;		    
                               case 4: rt_kprintf("\r\n   ----数据库中无该终端\r\n");  
									   break;
                        	}					    
		              break;
		   case  0x8103:    //  设置终端参数   
		               //  Ack_Resualt=0;
		               Fail_Flag=0;
                      if(contentlen)
                       {                       // 和中心商议好了每次只下发操作一项设置
                         Total_ParaNum=UDP_HEX_Rx[13]; // 中心设置参数总数
                         rt_kprintf("\r\n Set ParametersNum =%d  \r\n",Total_ParaNum);
						 //------------------------------------------------------------------- 
						 ContentRdAdd=14;
						 Process_Resualt=0;  // clear resualt
						 for(i=0;i<Total_ParaNum;i++)
						 {
						   //  数类型是DWORD 4 个字节
						   SubCMD_8103H=(UDP_HEX_Rx[ContentRdAdd]<<24)+(UDP_HEX_Rx[ContentRdAdd+1]<<16)+(UDP_HEX_Rx[ContentRdAdd+2]<<8)+UDP_HEX_Rx[ContentRdAdd+3]; 
                           //  子信息长度
						   SubInfolen=UDP_HEX_Rx[ContentRdAdd+4];
						   //  处理子信息 如果设置成功把相应Bit 位置为 1 否则保持 0
						   if(CentreSet_subService_8103H(SubCMD_8103H,SubInfolen,UDP_HEX_Rx+ContentRdAdd+5))
                                Process_Resualt|=(0x01<<i);						   
						   //  移动偏移地址
						   ContentRdAdd+=5+UDP_HEX_Rx[ContentRdAdd+4]; // 偏移下标
						 } 						   

                         //--------------判断所有的设置结果  ---------------
                        /* for(i=0;i<Total_ParaNum;i++)
                         {
                             if(!((Process_Resualt>>0)&0x01))
						     	{
                                  Ack_Resualt=1; //  1  表示失败
                                  break; 
						     	}
							 if(i==(Total_ParaNum-1))  //  设置到最后一个确认成功
							 	Ack_Resualt=0;  //  成功/确认
                         }*/

						 if(Fail_Flag==0)
						     Ack_Resualt=0;
						 else
						 	 Ack_Resualt=1;// 返回失败
                      }	
					  
						 //-------------------------------------------------------------------
						 if(SD_ACKflag.f_CentreCMDack_0001H==2)
						 {                  
						    Ack_Resualt=0;
							SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
						 }
						 else
                         if(SD_ACKflag.f_CentreCMDack_0001H==0)
						 {
						     SD_ACKflag.f_CentreCMDack_0001H=1;
							 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
                         } 	 
						  rt_kprintf("\r\n  Set Device !\r\n");   
						  
		              break;  
	    case  0x8104:    //  查询终端参数
                      SD_ACKflag.f_SettingPram_0104H=1;  // 不管什么内容回复统一结果
                      rt_kprintf("\r\n  中心查询终端参数 !\r\n");   
			          break;
           case  0x8105:     // 终端控制
                    // Ack_Resualt=0; 
                        rt_kprintf("\r\ny  终端控制 -1!\r\n"); 
                     if(contentlen)
                      {                       // 和中心商议好了每次只下发操作一项设置
                         Total_ParaNum=UDP_HEX_Rx[13]; //  终端控制命令字 
                         rt_kprintf("\r\n Set ParametersNum =%d  \r\n",Total_ParaNum); 
						 //------------------------------------------------------------------- 
			      if(CentreSet_subService_8105H(Total_ParaNum,contentlen-1,UDP_HEX_Rx+14)) 
                                Ack_Resualt=0;   // 返回成功						   
                       }	
					 
						 //-------------------------------------------------------------------
						 Ack_Resualt=0;
					   if(SD_ACKflag.f_CentreCMDack_0001H==0)
						 {
						     SD_ACKflag.f_CentreCMDack_0001H=1;
							 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
                         }	 
						  rt_kprintf("\r\ny  终端控制 -1!\r\n"); 
						  
		              break;
		   case  0x8201:     // 位置信息查询    位置信息查询消息体为空
		               SD_ACKflag.f_CurrentPosition_0201H=1;		
					   rt_kprintf("\r\n  位置信息查询 !\r\n");  
		              break;
		   case  0x8202:     // 临时位置跟踪控制
		                 Ack_Resualt=0;

