nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
								   }	
							  
							   } 

                          //----------------
                      // if(SD_ACKflag.f_CentreCMDack_0001H==0)
 					     {
	 						 SD_ACKflag.f_CentreCMDack_0001H=1;
	 						 Ack_Resualt=0;
	 						 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
 					      }
		              break;
		   case  0x8605:    //  删除多边区域
                         rt_kprintf("\r\n  删除多边形区域 \r\n");
                        if(0==UDP_HEX_Rx[13])   // 区域数
                             RailPolygen_Init();  // 删除所有区域
						 else
						 	{						 	  
							  memset((u8*)&Rail_Polygen,0,sizeof(Rail_Polygen));  //  clear all  first
						 	  for(i=0;i<UDP_HEX_Rx[13];i++)
						 	  {
						 	    Rail_Polygen.Area_ID=(UDP_HEX_Rx[14+i]<<24)+(UDP_HEX_Rx[15+i]<<16)+(UDP_HEX_Rx[16+i]<<8)+UDP_HEX_Rx[17+i];
                                if((Rail_Polygen.Area_ID>8)||(Rail_Polygen.Area_ID==0))
										   	Rail_Polygen.Area_ID=1;	
								Rail_Polygen.Effective_flag=0;   
                                                         Api_RecordNum_Write(Rail_polygen,Rail_Polygen.Area_ID, (u8*)&Rail_Polygen,sizeof(Rail_Polygen)); 	 
						 	  }   
						 	}

                          //----------------
                      // if(SD_ACKflag.f_CentreCMDack_0001H==0)
 					 {
 						 SD_ACKflag.f_CentreCMDack_0001H=1;
 						 Ack_Resualt=0;
 						 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
 					 } 
		              break;
		   case  0x8606:    //  设置路线
		                           rt_kprintf("\r\n  设置路线 \r\n");
						memset((u8*)&ROUTE_Obj,0,sizeof(ROUTE_Obj));  //  clear all  first			
                                          ROUTE_Obj.Route_ID=(UDP_HEX_Rx[13]<<24)+(UDP_HEX_Rx[14]<<16)+(UDP_HEX_Rx[15]<<8)+UDP_HEX_Rx[16];  
 						ROUTE_Obj.Route_attribute=(UDP_HEX_Rx[17]<<8)+UDP_HEX_Rx[18];  						
						memcpy(ROUTE_Obj.StartTimeBCD,UDP_HEX_Rx+19,6); 
						memcpy(ROUTE_Obj.EndTimeBCD,UDP_HEX_Rx+25,6); 
						ROUTE_Obj.Points_Num=(UDP_HEX_Rx[31]<<8)+UDP_HEX_Rx[32];  
						rt_kprintf("\r\n ROUTE_Obj.ID:  %d  \r\n ",ROUTE_Obj.Route_ID);    
						rt_kprintf("\r\n ROUTE_Obj.attribute:  %04X  \r\n ",ROUTE_Obj.Route_attribute); 
						rt_kprintf("\r\n ROUTE_Obj.Points_Num:  %d  \r\n ",ROUTE_Obj.Points_Num);   
						//if(ROUTE_Obj.Points_Num<3)       // cheat  mask   
						{ 
 						   SD_ACKflag.f_CentreCMDack_0001H=1;
 						   Ack_Resualt=0;
 						    SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;

                                              line_warn_enable=1;
						    rt_kprintf("\r\n  line_enable start \r\n");       
							
						  break;
						}  
						reg_u32=33;
						for(i=0;i<6;i++)  // 拐点数目
						{						  
						   // if((infolen+32)<reg_u32)   
							//	 break;   
							   
						  ROUTE_Obj.RoutePoints[i].POINT_ID=(UDP_HEX_Rx[reg_u32]<<24)+(UDP_HEX_Rx[reg_u32+1]<<16)+(UDP_HEX_Rx[reg_u32+2]<<8)+UDP_HEX_Rx[reg_u32+3]; 
						  reg_u32+=4;
						  rt_kprintf("\r\n PointID=%08x\r\n",ROUTE_Obj.RoutePoints[i].POINT_ID);
						  ROUTE_Obj.RoutePoints[i].Line_ID=(UDP_HEX_Rx[reg_u32]<<24)+(UDP_HEX_Rx[reg_u32+1]<<16)+(UDP_HEX_Rx[reg_u32+2]<<8)+UDP_HEX_Rx[reg_u32+3]; 
						  reg_u32+=4;
                                            rt_kprintf("\r\n LineID=%08x\r\n",ROUTE_Obj.RoutePoints[i].Line_ID);
						  ROUTE_Obj.RoutePoints[i].POINT_Latitude=(UDP_HEX_Rx[reg_u32]<<24)+(UDP_HEX_Rx[reg_u32+1]<<16)+(UDP_HEX_Rx[reg_u32+2]<<8)+UDP_HEX_Rx[reg_u32+3]; 
						  reg_u32+=4;
                                             rt_kprintf("\r\n LatiID=%08x\r\n",ROUTE_Obj.RoutePoints[i].POINT_Latitude); 
						  ROUTE_Obj.RoutePoints[i].POINT_Longitude=(UDP_HEX_Rx[reg_u32]<<24)+(UDP_HEX_Rx[reg_u32+1]<<16)+(UDP_HEX_Rx[reg_u32+2]<<8)+UDP_HEX_Rx[reg_u32+3]; 
						  reg_u32+=4;
                                                rt_kprintf("\r\n LongID=%08x\r\n",ROUTE_Obj.RoutePoints[i].POINT_Longitude); 
						  ROUTE_Obj.RoutePoints[i].Width=UDP_HEX_Rx[reg_u32++];  
						     rt_kprintf("\r\n Width=%02x\r\n",ROUTE_Obj.RoutePoints[i].Width); 
						  ROUTE_Obj.RoutePoints[i].Atribute=UDP_HEX_Rx[reg_u32++]; 
						   rt_kprintf("\r\n atrit=%02x\r\n\r\n",ROUTE_Obj.RoutePoints[i].Atribute);         
						   if(ROUTE_Obj.RoutePoints[i].Atribute==0)
                                                            ;
						   else
						    if(ROUTE_Obj.RoutePoints[i].Atribute==1) 
                                                      ROUTE_Obj.RoutePoints[i].MaxSpd=(UDP_HEX_Rx[reg_u32++]<<8)+UDP_HEX_Rx[reg_u32++]; 
                                             else
							 { 
									  ROUTE_Obj.RoutePoints[i].TooLongValue=(UDP_HEX_Rx[reg_u32++]<<8)+UDP_HEX_Rx[reg_u32++]; 
									  ROUTE_Obj.RoutePoints[i].TooLessValue=(UDP_HEX_Rx[reg_u32++]<<8)+UDP_HEX_Rx[reg_u32++];   
									  ROUTE_Obj.RoutePoints[i].MaxSpd=(UDP_HEX_Rx[reg_u32++]<<8)+UDP_HEX_Rx[reg_u32++]; 
									  ROUTE_Obj.RoutePoints[i].KeepDur=(UDP_HEX_Rx[reg_u32++]<<8)+UDP_HEX_Rx[reg_u32++];    
						     	}

						}	
                           
						  if((ROUTE_Obj.Route_ID>Route_Mum)||(ROUTE_Obj.Route_ID==0))
									  ROUTE_Obj.Route_ID=1;		
						  ROUTE_Obj.Effective_flag=1;
						  Api_RecordNum_Write(route_line,ROUTE_Obj.Route_ID, (u8*)&ROUTE_Obj,sizeof(ROUTE_Obj));// 删除对应的围栏 



                           //----------------
                    // if(SD_ACKflag.f_CentreCMDack_0001H==0)
 					 {
 						 SD_ACKflag.f_CentreCMDack_0001H=1;
 						 Ack_Resualt=0;
 						 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
 					 }
		              break;
		   case  0x8607:    //  删除路线
                         rt_kprintf("\r\n  删除路线 \r\n");  
			                         if(0==UDP_HEX_Rx[13])   // 区域数
			                             RouteLine_Init();  // 删除所有区域
						 else
						 	{						 	  
							  memset((u8*)&ROUTE_Obj,0,sizeof(ROUTE_Obj));  //  clear all  first
						 	  for(i=0;i<UDP_HEX_Rx[13];i++)
						 	  {
						 	    ROUTE_Obj.Route_ID=(UDP_HEX_Rx[14+i]<<24)+(UDP_HEX_Rx[15+i]<<16)+(UDP_HEX_Rx[16+i]<<8)+UDP_HEX_Rx[17+i];
                                                          if((ROUTE_Obj.Route_ID>Route_Mum)||(ROUTE_Obj.Route_ID==0))
										   	ROUTE_Obj.Route_ID=1;	
								ROUTE_Obj.Effective_flag=0;       
								     Api_RecordNum_Write(route_line,ROUTE_Obj.Route_ID, (u8*)&ROUTE_Obj,sizeof(ROUTE_Obj)); 	  // 删除对应的围栏
						 	  }   
						 	}  

                           //----------------
                    // if(SD_ACKflag.f_CentreCMDack_0001H==0)
 					 {
 						 SD_ACKflag.f_CentreCMDack_0001H=1;        
 						 Ack_Resualt=0;
 						 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
 					 }
		              break;
           case  0x8700:    //  行车记录仪数据采集命令
								  /*
															 行车记录仪发送出发开始
								   */
								  rt_kprintf( "\r\n  记录仪采集命令 \r\n" );
								  Recode_Obj.Float_ID = Centre_FloatID;
								  //Recode_Obj.CMD=UDP_HEX_Rx[13];
								  //	Stuff  Hardly
								  switch( UDP_HEX_Rx[13] )
								  {
									  case 0x00:
									  case 0x01:
									  case 0x02:
									  case 0x03:	
									  case 0x04:
									  case 0x05:
									  case 0x06:
									  case 0x07:	
									  case 0x08:
									  case 0x09:
									  case 0x10:
									  case 0x11:
									  case 0x12:
									  case 0x13:
									  case 0x14:
									 // case 0x15: 	
									  	  Recode_Obj.CMD   = UDP_HEX_Rx[13]; 
										  Recode_Obj.SD_Data_Flag = 1;
										  Recode_Obj.CountStep	  = 1; 
										  break;
									  //--------- Lagre  block -------
								  
								  
