nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
					   Start_Camera(Camera_Number);   //开始拍照  
					   SingleCamera_TakeRetry=0;   // clear 
					}	   
					rt_kprintf("\r\n   中心及时拍照  Camera: %d    \r\n",Camera_Number);	

                                    if(UDP_HEX_Rx[18]==0x01)    // 拍照不上传
                                      {    
                                          Camera_Take_not_trans=1;
                                           rt_kprintf("\r\n   拍照不上传\r\n");
                                      }				
					else
						Camera_Take_not_trans=0;  
					  
                     // if(SD_ACKflag.f_CentreCMDack_0001H==0)   //mask below  use   0805H
 			//		 {
 				//		 SD_ACKflag.f_CentreCMDack_0001H=1;
 					//	 Ack_Resualt=0;
 						// SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
 				//	 }
                      break;
		   case  0x8802:   //    存储多媒体数据检索
		                 SD_ACKflag.f_QueryEventCode=UDP_HEX_Rx[15];    
                         switch(UDP_HEX_Rx[13])
                         {
                            case 0:  // 图像
                                     SD_ACKflag.f_MediaIndexACK_0802H=1;
									 rt_kprintf("\r\n  中心查询图像索引 \r\n");   
							       break;
							case 1:  //  音频
                                     SD_ACKflag.f_MediaIndexACK_0802H=2;
									  rt_kprintf("\r\n  中心查询音频索引 \r\n"); 	 
							case 2:  //  视频
							         SD_ACKflag.f_MediaIndexACK_0802H=3;
						    default:
								     break; 
						}						 
						
		              break;
		   case  0x8803:   //    存储多媒体数据上传命令
                      rt_kprintf("\r\n 多媒体数据上传\r\n"); 
                       switch(UDP_HEX_Rx[13])
                         {
                            case 0:  // 图像
									 rt_kprintf("\r\n   上传固有图片\r\n");    
							       break;
							case 1:  //  音频
                                     MP3_send_start();
									  rt_kprintf("\r\n  上传固有音频 \r\n"); 
								   break;	  
							case 2:  //  视频
							        // Video_send_start();
							         // MP3_send_start();
									  rt_kprintf("\r\n  上传固有视频  不操作了 用音频\r\n"); 
								   break;	  
						    default:
								     break; 
						}				
					  
                     //----------------------------------------------------------
                     // if(SD_ACKflag.f_CentreCMDack_0001H==0)
 					 {
 						 SD_ACKflag.f_CentreCMDack_0001H=1;
 						 Ack_Resualt=0;
 						 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
 					 }
		              break;
		   case  0x8804:   //    录音开始命令
		   
		            //#if  1			     
                       switch(UDP_HEX_Rx[13])
                       	{ 
                       	  case 0x00:  // 停录音
                       	                      // VOC_REC_STOP(void);
						    //   VOC_REC_Stop();
							/* 					  
	                                     Dev_Voice.CMD_Type='0';
										 Dev_Voice.info_sdFlag=0;    
										 Dev_Voice.Voice_FileOperateFlag=0;
										 Dev_Voice.Centre_RecordFlag=0; // 清空中心录音标志位
										 if(TF_Card_Status()==1)	
												{
												  //memset(Dev_Voice.Voice_Reg,0,512);//clear left
												  //edit_file(Dev_Voice.FileName,Dev_Voice.Voice_Reg,512); //写信息到TF
												  //Dev_Voice.Voice_FileSize+=500; //add  											  
												  rt_kprintf("\r\n ---------   语音文件的最后地址	  VoiceFileSize %d Bytes  \r\n",Dev_Voice.Voice_FileSize);
												}   
										Api_DFdirectory_Write(voice, Dev_Voice.Voice_Reg,500);  
		                                 Dev_Voice.Voice_FileSize+=500;
		                                 Sound_SaveEnd();  */
						            break;
						  case 0x01:  // 开始录音
                                                       
								     VOC_REC_Start();
						 					   
					 /*
						          if(MMedia2_Flag==0)
						          	{
                                       MP3_send_start();
									   rt_kprintf("\r\n  上传固有音频 \r\n"); 
									   MMedia2_Flag=1;
									   break;
						          	}
                                    Dev_Voice.Rec_Dur=(UDP_HEX_Rx[14]<<8)+UDP_HEX_Rx[15];
									Dev_Voice.SaveOrNotFlag=UDP_HEX_Rx[16];

                                    // ------------   录音文件名 -----------
                                    if(TF_Card_Status()==1)
	                                { 
	                                    memset(Dev_Voice.FileName,0,sizeof(Dev_Voice.FileName)); 	    									
										sprintf((char*)Dev_Voice.FileName,"%d%d%d%d.spx",time_now.day,time_now.hour,time_now.min,time_now.sec);    
	                                   // creat_file(Dev_Voice.FileName); //创建文件名了 
	                                    Sound_SaveStart(); 
										rt_kprintf("\r\n			  中心录音文件名称: %s \r\n",Dev_Voice.FileName);	
										Save_MediaIndex(1,Dev_Voice.FileName,0,0);     
                                     }
                                    Dev_Voice.Centre_RecordFlag=1;//中心开始录音标志位
									              
									Dev_Voice.CMD_Type='1';
									Dev_Voice.info_sdFlag=2;									
									Dev_Voice.Voice_FileSize=0; //clear size
									Dev_Voice.Voice_FileOperateFlag=1; 
									MMedia2_Flag=0;  
					   */				
							        break;

                       	}
					  
					      
					  //------------------------------
					 //if(SD_ACKflag.f_CentreCMDack_0001H==0)
 					 {
 						 SD_ACKflag.f_CentreCMDack_0001H=1;
 						 Ack_Resualt=0;
 						 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
 					 }
		              break;
		 case  0x8900:   //    数据下行透传                  
                                   switch(UDP_HEX_Rx[13]) // 透传消息类型  // BD
                                   {
                                         case  0x41 : // 串口1  透传消息
                                               rt_kprintf("\r\n 串口1 透传:"); 
                                                  for(i=0;i<(infolen-1);i++)
                                                       rt_kprintf("%c",UDP_HEX_Rx[14+i]);   
											   rt_kprintf("\r\n");  	  
												  	   
								         break;
									case  0x42:  //  串口2 透传消息
									           rt_kprintf("\r\n 串口2 透传:"); 
                                               for(i=0;i<(infolen-1);i++)
                                                       rt_kprintf("%c",UDP_HEX_Rx[14+i]);   
											   rt_kprintf("\r\n");  

									                   break;
									case  0x0B:  //  IC  卡 信息
                                                             memcpy(IC_MOD.IC_Rx,UDP_HEX_Rx+14,infolen-1);
								     rt_kprintf("\r\n IC 卡透传len=%dBytes  RX:",infolen-1);
									 for(i=0;i<infolen-1;i++)
									 	rt_kprintf("%2X ",UDP_HEX_Rx[14+i]); 
								     rt_kprintf("\r\n");	 
                                                             //------ 直接发送给IC 卡模块-----
                                                             Reg_buf[0]=0x00;
								     memcpy(Reg_buf,IC_MOD.IC_Rx,infolen-1);
                                                             DeviceData_Encode_Send(0x0B,0x40,Reg_buf,infolen); 									 
						                   return;  

