nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
                                    }
		                       //---------------------------------------------------   
		                      if(LinkNum==0)
		                     {
                                     DataTrans.TYPE=UDP_HEX_Rx[13];
					  memset(DataTrans.DataRx,0,sizeof(DataTrans.DataRx)); 
                                     memcpy(DataTrans.DataRx,UDP_HEX_Rx+14,infolen-1);
					  DataTrans.Data_RxLen=infolen-1;   

					  //--------- 送给小屏幕---------- 	
					  	memset( TextInfo.TEXT_Content,0,sizeof(TextInfo.TEXT_Content));
						AsciiToGb(TextInfo.TEXT_Content,infolen-1,UDP_HEX_Rx+14); 
						TextInfo.TEXT_SD_FLAG=1;	// 置发送给显示屏标志位  // ||||||||||||||||||||||||||||||||||

						//========================================
						   

						     #ifdef LCD_5inch
						 
							 DwinLCD.Type=LCD_SDTXT;
							  memset(DwinLCD.TXT_content,0,sizeof(DwinLCD.TXT_content)); 
                                                   DwinLCD.TXT_contentLen=AsciiToGb(DwinLCD.TXT_content,infolen-1,UDP_HEX_Rx+14);  						  
				   
							#endif  
					 // if(SD_ACKflag.f_CentreCMDack_0001H==0)
 					 {
 						 SD_ACKflag.f_CentreCMDack_0001H=1;
 						 Ack_Resualt=0;
 						 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
 					 }
		   	        }
		              break;
		   case  0x8A00:   //    平台RSA公钥

		   
                    // if(SD_ACKflag.f_CentreCMDack_0001H==0) 
 					 {
 						 SD_ACKflag.f_CentreCMDack_0001H=1;
 						 Ack_Resualt=0;
 						 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
 					 } 
				      break;	
			//---------  BD  add -------------------------------
                  /*   case  0x8003: // BD--8.4 分包请求上传
                                          Detach_PKG.Original_floatID=(UDP_HEX_Rx[13]<<8)+UDP_HEX_Rx[14];//原始消息流水号
                                          Detach_PKG.NumOf_Resend=UDP_HEX_Rx[15];
						//  重传列表
						reg_u32=0;// 借用做下标计数器
						for(i=3;i<infolen;i+=2)
						{
                                             Detach_PKG.List_Resend[reg_u32]=(UDP_HEX_Rx[16+2*reg_u32]<<24)+UDP_HEX_Rx[17+2*reg_u32+1];
						   reg_u32++; 
						}

				             {
	 						 SD_ACKflag.f_CentreCMDack_0001H=1;
	 						 Ack_Resualt=0;
	 						 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
 					       } 	
 					     
				              break;	*/				 
			case  0x8106://BD--8.11 查询指定终端参数
			                //7E 81 06 00 05 01 39 01 23 45 05 00 2A 01 00 00 00 21 D2 7E
			                //7E81060005013901234505002A0100000021D27E
			                //7E81060005013901234505002A03000000210000009400000055D27E
			                Setting_Qry.Num_pram=UDP_HEX_Rx[13];// 个数
			                if(Setting_Qry.Num_pram>90)
								     Setting_Qry.Num_pram=90;
                            reg_u32=0;// 借用做下标计数器

                          //  CMD_U32ID=(UDP_HEX_Rx[14+4*reg_u32]<<24)+(UDP_HEX_Rx[14+4*reg_u32+1]<<16)+(UDP_HEX_Rx[14+4*reg_u32+2]<<8)+(UDP_HEX_Rx[14+4*reg_u32+3]);
							
							for(i=0;i<Setting_Qry.Num_pram;i++)  
							{
	                           Setting_Qry.List_pram[reg_u32]=(UDP_HEX_Rx[14+4*reg_u32]<<24)+(UDP_HEX_Rx[14+4*reg_u32+1]<<16)+(UDP_HEX_Rx[14+4*reg_u32+2]<<8)+(UDP_HEX_Rx[14+4*reg_u32+3]); 
							   rt_kprintf("ID:  %4X ",Setting_Qry.List_pram[reg_u32]); 
							   reg_u32++;     
							}
							

							

						     SD_ACKflag.f_SettingPram_0104H=2;	// 中心查询指定参数	 		   
			                 break;
			case  0x8107:// BD--8.14 查询终端属性   
                                             SD_ACKflag.f_BD_DeviceAttribute_8107=1; // 消息体为空
			                       break;
                     case   0x8108://BD--8.16 下发终端升级包   远程升级  (重要)

                                           //   1.  分包判断bit 位  
                                            if(UDP_HEX_Rx[3]&0x20) 
						  	{   //  分包判断
						  	     BD_ISP.Total_PacketNum=(UDP_HEX_Rx[13]<<8)+UDP_HEX_Rx[14];  // 总包数
						            BD_ISP.CurrentPacket_Num=(UDP_HEX_Rx[15]<<8)+UDP_HEX_Rx[16]; // 当前包序号从1 开始
						  	} 
						 else
						 	{
							 	//------------   ACK   Flag -----------------
							  	 SD_ACKflag.f_CentreCMDack_0001H=1;
		 						 Ack_Resualt=0;
		 						 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
						 	}	
						//   2.  检测 
						if(BD_ISP.CurrentPacket_Num==1)
						{	
	                                                BD_ISP.Update_Type=UDP_HEX_Rx[17];  //升级包类型
		                                            //----  Debug ------
								  switch(BD_ISP.Update_Type)
								  {
								      case  0:   
									  	      rt_kprintf("\r\n 升级类型: 终端\r\n");
										      break;
								      case  12:   
									  	      rt_kprintf("\r\n 升级类型: IC 卡读卡器\r\n");
										      break;
								      case  52:   
									  	      rt_kprintf("\r\n 升级类型: 北斗模块\r\n");
										      break;
								  }
		                                            //----------------------
		                                            memcpy(BD_ISP.ProductID,UDP_HEX_Rx+18,5);// 制造商ID
		                                            BD_ISP.Version_len=UDP_HEX_Rx[23]; // 版本号长度
								  memcpy(BD_ISP.VersionStr,UDP_HEX_Rx+20,BD_ISP.Version_len);	// 软件版本号
								  i=24+BD_ISP.Version_len;
								  BD_ISP.Content_len=(UDP_HEX_Rx[i]<<24)+(UDP_HEX_Rx[i+1]<<16)+(UDP_HEX_Rx[i+2]<<8)+UDP_HEX_Rx[i+3];// 升级包长度
								  i+=4;  
		                                             rt_kprintf("\r\n 升级包长度:%d Bytes\r\n",BD_ISP.Content_len);

								  infolen=infolen-11-BD_ISP.Version_len;// infolen 					 

								  BD_ISP.PacketRX_wr=0; // clear
								  BD_ISP.ISP_running=1;					 
						}					  
						   //--------  升级包内容  -------------					 
						  if(infolen)      //  升级内容以后根据类型往不同的存储区域写
                                              {
                                                  memcpy(BD_ISP.ContentData,UDP_HEX_Rx+i+4,infolen); // 升级包内容
                                                  BD_ISP.PacketRX_wr+=infolen;   
						    }
						   //------------   ACK   Flag -----------------
						  	 SD_ACKflag.f_CentreCMDack_0001H=1;
	 						 Ack_Resualt=0;
	 						 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;	
						   //------------------------------------------------------------------------	 
                                            break;
            case   0x8203://BD--8.22  人工确认报警消息
                                     rt_kprintf( "\r\n收到8203!\r\n"); 
                             	    if (Warn_Status[3]&0x01)  //紧急报警
									  {
											  StatusReg_WARN_Clear();			  
											  f_Exigent_warning = 0;
											  warn_flag=0;
											  Send_warn_times=0; 
											   StatusReg_WARN_Clear();	
											   rt_kprintf( "\r\n紧急报警收到应答，得清除!\r\n");   
									  }
			 
