nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
                                            HumanConfirmWarn.Warn_FloatID=(UDP_HEX_Rx[13]<<8)+UDP_HEX_Rx[14];
                                            HumanConfirmWarn.ConfirmWarnType=(UDP_HEX_Rx[15]<<24)+(UDP_HEX_Rx[16]<<16)+(UDP_HEX_Rx[17]<<8)+UDP_HEX_Rx[18];
                                            if(HumanConfirmWarn.Warn_FloatID==0x00)
                                            	{    //  如果为0 表示所有消息
                                            	     Warn_Status[3] &= ~0x01;  // bit 0
							     Warn_Status[3]&=~0x08;	// bit3
							     Warn_Status[1]&=~0x10;	// bit20 进出区域报警 
							     Warn_Status[1]&=~0x20;    // bit 21 进出线路报警
							     Warn_Status[1]&=~0x40; 	// bit 22  路段行驶时间不足报警 
							     Warn_Status[0]&=~0x08;    // bit 27  确认车辆非法点火报警
							     Warn_Status[0]&=~0x10;    // bit 28  确认车辆非法报警
                                                      Warn_Status[0]&=~0x80;    //bit 31  非法开门 (终端不设置区域时，车门开关无效) 
                                            	}
						  else
						  	{
						  	     	  //--------------------------------
									  if ((Warn_Status[3]&0x01)&&(0x00000001&HumanConfirmWarn.ConfirmWarnType))  //紧急报警
									  {
											  StatusReg_WARN_Clear();		 	  
											  f_Exigent_warning = 0;
											  warn_flag=0;
											  Send_warn_times=0; 
											   StatusReg_WARN_Clear();	
											   rt_kprintf( "\r\n紧急报警收到应答，得清除!\r\n");   
									  }
			                                      	  if( (Warn_Status[3]&0x08)&&(0x00000008&HumanConfirmWarn.ConfirmWarnType))   //危险报警-BD
									    {
														  Warn_Status[3]&=~0x08;
									     }
									  
									  //------------------------------------
				                                     if((Warn_Status[1]&0x10)&&(0x00001000&HumanConfirmWarn.ConfirmWarnType)) // 进出区域报警
				                                     {
										                  InOut_Object.TYPE=0;//圆形区域
										                  InOut_Object.ID=0; //  ID
										                  InOut_Object.InOutState=0;//  进报警 
										                  Warn_Status[1]&=~0x10;
				                                     } 
									if((Warn_Status[1]&0x20)&&(0x00002000&HumanConfirmWarn.ConfirmWarnType)) // 进出路线报警
				                                     {
										                  InOut_Object.TYPE=0;//圆形区域
										                  InOut_Object.ID=0; //  ID
										                  InOut_Object.InOutState=0;//  进报警 
										                  Warn_Status[1]&=~0x20;  
				                                     } 
									 if((Warn_Status[1]&0x40)&&(0x00004000&HumanConfirmWarn.ConfirmWarnType))  // 路段行驶时间不足、过长
									 {
				                                                  Warn_Status[1]&=~0x40; 
									 }
									  //-----------------------------------------
									   if((Warn_Status[0]&0x08)&&(0x08000000&HumanConfirmWarn.ConfirmWarnType))  //车辆非法点火
									  {
                                                                              Warn_Status[0]&=~0x08; 
									  }
									   if((Warn_Status[0]&0x10)&&(0x10000000&HumanConfirmWarn.ConfirmWarnType))  //车辆非法位移
									  {
                                                                              Warn_Status[0]&=~0x10; 
									  } 
									      if((Warn_Status[0]&0x80)&&(0x80000000&HumanConfirmWarn.ConfirmWarnType))  //非法开门报警(终端未设置区域时，不判断非法开门)
                                                                {              
                                                                        Warn_Status[0]&=~0x80; 
									  }
									  //------------------------------------  
						  	}

                             		   //------------   ACK   Flag -----------------
						  	 SD_ACKflag.f_CentreCMDack_0001H=1;
	 						 Ack_Resualt=0;
	 						 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;	
							    //---------  报警确认后发送，立即发送定位包				
                                                     PositionSD_Enable();
							    Current_UDP_sd=1;	
						  break;					
                     case   0x8702:// BD-8.47-  上报驾驶员身份信息请求
                                             SD_ACKflag.f_DriverInfoSD_0702H=1; // 消息体为空
					         break;
		       case  0x8805:   //BD--8.55    单条存储多媒体数据检索上传命令	---- 补充协议要求

	                                    reg_u32=(UDP_HEX_Rx[13]<<24)+(UDP_HEX_Rx[14]<<16)+(UDP_HEX_Rx[15]<<8)+UDP_HEX_Rx[16];
						  rt_kprintf("\r\n单条存储多媒体数据检索上传 MeidiaID=%d 删除标志: %d ",reg_u32,UDP_HEX_Rx[17]);

                                           Camera_Number=1; 
                                           Photo_send_start(Camera_Number);  //在不是多路拍照的情况下拍完就可以上传了
							  //------------------------------
						 // if(SD_ACKflag.f_CentreCMDack_0001H==0)
	 					 {
	 						 SD_ACKflag.f_CentreCMDack_0001H=1; 
	 						 Ack_Resualt=0;
	 						 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
	 					 }
		                               break;
			     case  0x8003:  //    补传分包请求 

                                            	   MediaObj.RSD_State=1;   //   进入重传状态
						  	   MediaObj.RSD_Timer=0;   //   清除重传定时器   
						  	   MediaObj.RSD_Reader=0;
							   MediaObj.RSD_total=UDP_HEX_Rx[15];    // 重传包总数
							   
                                                    //   获取重传列表 
							   j=0;						
							   for(i=0;i<MediaObj.RSD_total;i++)
							   	{
                                                               MediaObj.Media_ReSdList[i]=(UDP_HEX_Rx[16+j]<<8)+UDP_HEX_Rx[17+j];
									j+=2;
								}							   
	                                             rt_kprintf("\r\n  8003 重传列表Total=%d: ",MediaObj.RSD_total);
							   for(i=0;i<MediaObj.RSD_total;i++)
							         rt_kprintf("%d,",MediaObj.Media_ReSdList[i]);  
							   rt_kprintf("\r\n");  

							      {
	 						 SD_ACKflag.f_CentreCMDack_0001H=1;
	 						 Ack_Resualt=0;
	 						 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
 					       } 

				                 break; 
                      //--------  BD  add  Over  -------------------------------- 
		    default:
				      break;  	    
	    } 

		//-----------------  memset  ------------------------------------- 
		//memset(UDP_HEX_Rx, 0, sizeof(UDP_HEX_Rx));	
		//UDP_hexRx_len= 0; 
        return;  

