nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
}


void Time2BCD(u8 *dest)
 {
	dest[0]=((time_now.year/10)<<4)+(time_now.year%10);  	   	
	dest[1]=((time_now.month/10)<<4)+(time_now.month%10); 
	dest[2]=((time_now.day/10)<<4)+(time_now.day%10);
	dest[3]=((time_now.hour/10)<<4)+(time_now.hour%10);
	dest[4]=((time_now.min/10)<<4)+(time_now.min%10);
	dest[5]=((time_now.sec/10)<<4)+(time_now.sec%10);     
	
 }

void AvrgSpd_MintProcess(u8 hour,u8 min, u8 sec)  
{
	   //------- 系统启动时处理   若 标志位为0 且年月日都为 0，表面是系统刚刚启动，这时获取当前时间把当前时间给BAK------
	 if((0==Avrgspd_Mint.saveFlag)&&(Avrgspd_Mint.datetime_Bak[0]==0)&&(Avrgspd_Mint.datetime_Bak[1]==0)&&(Avrgspd_Mint.datetime_Bak[2]==0))
	 {
	    Time2BCD(Avrgspd_Mint.datetime);  
		memcpy(Avrgspd_Mint.datetime_Bak,Avrgspd_Mint.datetime,6);//将当前时间给BAK
		avgspd_Mint_Wr=time_now.min; //分钟既是下标	 5-----4	
	 }	
	 else
	 {     // 若不是系统启动开始   
	    if(min==0) //  把秒数写为非0 ，以便留出时间去存储上1小时的数据 
	    {
	    avgspd_Mint_Wr=0;//(xj)分钟数为0，清0
		     if(sec==2)  //存储上一小时每分钟的平均速度 ==2是因为要保证第59分钟速度已经被存储到相应的寄存器中
		     {
			      memcpy(Avrgspd_Mint.datetime_Bak,Avrgspd_Mint.datetime,6);//将当前时间给BAK
			      Avrgspd_Mint.datetime_Bak[4]=0;// 分钟为0
				  Avrgspd_Mint.datetime_Bak[5]=0;// 秒也为0 
			      Avrgspd_Mint.saveFlag=1;//使能存储      到NandFlag  标志位
				  Time2BCD(Avrgspd_Mint.datetime);//获取新的时间
		      } 
			 if(sec==8)    //存储完后  清除时间下标  
			    avgspd_Mint_Wr=0;
	    }

	 }
	 if(sec==0)  // 秒为0时存储上1分钟的数据
	  {
	    //-----------------------------------------------------------------------------------------
	    //avgspd_Mint_Wr=(Avrgspd_Sec.datetime_Bak[4]>>4)*10+(0x0f&Avrgspd_Sec.datetime_Bak[4]); 
	    if(AspdCounter)
		   Avrgspd_Mint.avgrspd[avgspd_Mint_Wr]=PerMinSpdTotal/AspdCounter;//第几分钟的平均速度	
		else   
		   Avrgspd_Mint.avgrspd[avgspd_Mint_Wr]=0; 	
		//---------------------------------------------------------------------------------------------
	   // rt_kprintf("\r\n	  %2X:%2X  每分钟的平均速度  avrgSpd=%d \r\n",Avrgspd_Sec.datetime_Bak[3],Avrgspd_Sec.datetime_Bak[4], Avrgspd_Mint.avgrspd[avgspd_Mint_Wr]);  
	    //--------------------------------------------------   
		PerMinSpdTotal=0;  // clear   
		AspdCounter=0;	   // clear    
	  }
	 else
	 {
	   if(UDP_dataPacket_flag==0x02 ) 
	   {
		 AspdCounter++;
		 PerMinSpdTotal+=GPS_speed/10;   // 只要求精确到 km/h   所以要除 10
	   } 
	 }  

}

//==================================================================================================
// 第四部分 :   以下是行车记录仪相关协议 即 附录A   
//==================================================================================================

//  1.  上载数据命令字相关  
/*
u8 In_Type  :   传输类型
u8* InStr   :   参数字符串
u8 TransType:   传输方式   串口  或  GPRS

*/
void Device_Data(u8 In_Type,u8 TransType) 
{
  u8   UpReg[500];
  u16  Up_wr=0,SregLen=0,Greglen=0,Swr=0;//,Gwr=0; // S:serial  G: GPRS
  u8   Sfcs=0, Gfcs=0;  
  u16  i=0;
//  u16  packet_len=0;
  u8   Reg[70];  
  u32  regdis=0,reg2=0;
  u8    QueryRecNum=0;
  
  memset(UpReg,0,500);
  Up_wr=0;

  
  if(TransType)  //-------  GPRS  得添加 无线协议头
  {
    memcpy(UpReg+Up_wr,"*GB",3); // GPRS 起始头
    Up_wr+=3;
	
    UpReg[Up_wr++]=0x00;  // SIM 号码   最先两个字节填写0x00
	UpReg[Up_wr++]=0x00;
	memcpy(UpReg+Up_wr,SIM_code,6);
	Up_wr+=6;
	
	Greglen=Up_wr;                      // 长度
	Up_wr+=2;
	
	UpReg[Up_wr++]=0x00; //消息序号 默认 0x00

	UpReg[Up_wr++]=0x20; //参数  bit5 bit4 10 选择应答遵照协议 

    UpReg[Up_wr++]=0xF0; // 命令字  无线传输RS232数据

	//   以下是数据内容
  }  
  //---------------填写 A 协议头 ------------------------
  Swr=Up_wr;  // reg save
  UpReg[Up_wr++]=0xAA;  // 起始头
  UpReg[Up_wr++]=0x75;
  //---------------根据类型分类填写内容------------------
  switch(In_Type)  
  	{
  	    //---------------- 上传数类型  -------------------------------------
		case  A_Up_DrvInfo  :      //  当前驾驶人信息
		                     UpReg[Up_wr++]=In_Type; //命令字

							 SregLen=0x00;           // 信息长度
                             UpReg[Up_wr++]=0x00;    // Hi
                             UpReg[Up_wr++]=39;      // Lo
                             
                             UpReg[Up_wr++]=0x00;    // 保留字 
                             
                             
                             memcpy(UpReg+Up_wr,JT808Conf_struct.Driver_Info.DriverCard_ID,18); //信息内容
                             Up_wr+=18;
							 memcpy(UpReg+Up_wr,JT808Conf_struct.Driver_Info.DriveName,21);
							 Up_wr+=21;
							 
			                 break;
		case  A_Up_RTC      :      //  采集记录仪的实时时钟
                             UpReg[Up_wr++]=In_Type; //命令字

							 SregLen=0x00;           // 信息长度
                             UpReg[Up_wr++]=0x00;    // Hi
                             UpReg[Up_wr++]=6;      // Lo
                             
                             UpReg[Up_wr++]=0x00;    // 保留字
                             
                             Time2BCD(UpReg+Up_wr);   //信息内容  
                             Up_wr+=6;
                             break;
		case  A_Up_Dist     :    //  采集里程
                             UpReg[Up_wr++]=In_Type; //命令字

							 SregLen=0x00;           // 信息长度
                             UpReg[Up_wr++]=0x00;    // Hi
                             UpReg[Up_wr++]=16;      // Lo
                             
                             UpReg[Up_wr++]=0x00;    // 保留字
                             //   信息内容
                             Time2BCD(UpReg+Up_wr);
							 Up_wr+=6;
                             memcpy(UpReg+Up_wr,(u8*)JT808Conf_struct.FirstSetupDate,6);
							 Up_wr+=6;
							 regdis=JT808Conf_struct.Distance_m_u32/100;  //单位0.1km 
							 reg2=regdis/10000000;
							 UpReg[Up_wr++]=(reg2<<4)+((regdis%10000000)/1000000);
							 UpReg[Up_wr++]=((regdis%1000000/100000)<<4)+(regdis%100000/10000);
							 UpReg[Up_wr++]=((regdis%10000/1000)<<4)+(regdis%1000/100);
							 UpReg[Up_wr++]=((regdis%100/10)<<4)+(regdis%10); 
							 

		case  A_Up_PLUS     :    //  采集记录仪速度脉冲系数
                             UpReg[Up_wr++]=In_Type; //命令字

							 SregLen=0x00;           // 信息长度
                             UpReg[Up_wr++]=0x00;    // Hi
                             UpReg[Up_wr++]=10;      // Lo
                             
