nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
                             UpReg[Up_wr++]=0x00;    // 保留字

							 //  信息内容
							 Time2BCD(UpReg+Up_wr);
							 Up_wr+=6;
                             UpReg[Up_wr++]=(u8)(JT808Conf_struct.Vech_Character_Value<<24);
							 UpReg[Up_wr++]=(u8)(JT808Conf_struct.Vech_Character_Value<<16);
							 UpReg[Up_wr++]=(u8)(JT808Conf_struct.Vech_Character_Value<<8);
							 UpReg[Up_wr++]=(u8)(JT808Conf_struct.Vech_Character_Value); 
							 
                             break;
		case  A_Up_VechInfo :    //  车辆信息
		                     UpReg[Up_wr++]=In_Type; //命令字

							 SregLen=0x00;           // 信息长度
                             UpReg[Up_wr++]=0x00;    // Hi
                             UpReg[Up_wr++]=41;      // Lo
                             
                             UpReg[Up_wr++]=0x00;    // 保留字                              
                             
                             memcpy(UpReg+Up_wr,JT808Conf_struct.Vechicle_Info.Vech_VIN,17); //信息内容
                             Up_wr+=17;
							 memcpy(UpReg+Up_wr,JT808Conf_struct.Vechicle_Info.Vech_Num,12);
                             Up_wr+=12;
							 memcpy(UpReg+Up_wr,JT808Conf_struct.Vechicle_Info.Vech_Type,12);  
                             Up_wr+=12;

		                     break;
		case  A_Up_AvrgMin  :      //  每分钟平均速度记录      // 默认填写最新7分钟记录
                                       UpReg[Up_wr++]=In_Type; //命令字
			
									   SregLen=455;		   // 信息长度
									   UpReg[Up_wr++]=(u8)(SregLen>>8);    // Hi
									   UpReg[Up_wr++]=(u8)SregLen;		   // Lo	65x7    
									   
									   UpReg[Up_wr++]=0x00;    // 保留字	 
									   //-----------  信息内容  --------------		
									       //----------------------
										  QueryRecNum=Api_DFdirectory_Query(spdpermin,0);   //查询当前疲劳驾驶记录数目
										 if(QueryRecNum>7)								   
										        QueryRecNum=7;			
								
										    SregLen=QueryRecNum*65;     // 改写信息长度
			                                                      UpReg[Up_wr-3]=(u8)(SregLen>>8);	  // Hi
			                                                      UpReg[Up_wr-2]=(u8)SregLen;	  // Lo    65x7    

																  
										 for(i=0;i<QueryRecNum;i++)			   // 从最新处读取存储填写
										  {
											 Api_DFdirectory_Read(spdpermin,Reg,70,0,i); // 从new-->old  读取
											  memcpy(UpReg+Up_wr,Reg+5,60);	// 只填写速度
											Up_wr+=65;	    
										  }
									       //------------------------------
									   
		                     break; 
		case  A_Up_Tired    :     //  疲劳驾驶记录
		                               UpReg[Up_wr++]=In_Type; //命令字
			
									   SregLen=180;		   // 信息长度
									   UpReg[Up_wr++]=(u8)(SregLen>>8);    // Hi
									   UpReg[Up_wr++]=(u8)SregLen;		   // Lo	30x6   
									   
									   UpReg[Up_wr++]=0x00;    // 保留字	   


									   //----------------------------------									    
                                                                   	QueryRecNum=Api_DFdirectory_Query(tired_warn,0);   //查询当前疲劳驾驶记录数目
										 if(QueryRecNum>6)								   
										        QueryRecNum=6;		
										 
                                                                  SregLen=30*QueryRecNum;		   // 信息长度
									   UpReg[Up_wr-3]=(u8)(SregLen>>8);    // Hi
									   UpReg[Up_wr-2]=(u8)SregLen;		   // Lo	65x7  
										 
										 for(i=0;i<QueryRecNum;i++)			   // 从最新处读取存储填写
										  {
											 Api_DFdirectory_Read(tired_warn,Reg,31,0,i); // 从new-->old  读取
                                                                              memcpy(UpReg+Up_wr,Reg,30); 
											 Up_wr+=30; 	    
										  }
									  //----------------------------------	 
                                                                    

		                     break;
		//------------------------ 下传数据相关命令 ---------------------
	    case  A_Dn_DrvInfo  :       //  设置车辆信息
                              
							  //-----------------------------------------------------------------------
							/*  memset(JT808Conf_struct.Vechicle_Info.Vech_VIN,0,18);
							  memset(JT808Conf_struct.Vechicle_Info.Vech_Num,0,13);
							  memset(JT808Conf_struct.Vechicle_Info.Vech_Type,0,13); 
							  
							  memcpy(JT808Conf_struct.Vechicle_Info.Vech_VIN,InStr,17);
							  memcpy(JT808Conf_struct.Vechicle_Info.Vech_Num,InStr+17,12);
							  memcpy(JT808Conf_struct.Vechicle_Info.Vech_Type,InStr+29,12);  
							  
							  Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));  
							  */
		                    // break;
                           
		case  A_Dn_RTC      :        //  设置记录仪时间
		                    
		                     UpReg[Up_wr++]=In_Type; //命令字

							                    // 信息长度
                             UpReg[Up_wr++]=0x00;    // Hi
                             UpReg[Up_wr++]=0;      // Lo   20x8
                             
                             UpReg[Up_wr++]=0x00;    // 保留字  

		                     break;
		case  A_Dn_Plus     :        //  设置速度脉冲系数
                             
						//	 JT808Conf_struct.Vech_Character_Value=((u32)(*InStr)<<24)+((u32)(*InStr+1)<<16)+((u32)(*InStr+2)<<8)+(u32)(*InStr+3); // 特征系数	速度脉冲系数
						//	 Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));  
                             //-------------------------------------------------------------  
							 UpReg[Up_wr++]=In_Type; //命令字
							                    // 信息长度
                             UpReg[Up_wr++]=0x00;    // Hi
                             UpReg[Up_wr++]=0;      // Lo   20x8                             
                             UpReg[Up_wr++]=0x00;    // 保留字   
		                     break;
		default :
                             rt_kprintf("Error:   Device Type Error! \r\n");
			                 return; 
							 
  	}
  //---------------  填写计算 A 协议  Serial Data   校验位  -------------------------------------
  Sfcs=0;						//	计算S校验 从OxAA 开始 
  for(i=Swr;i<Up_wr;i++)
	 Sfcs^=UpReg[i];
  UpReg[Up_wr++]=Sfcs;			 // 填写FCS  
  //-----------------------------------------------------------------------------
  if(TransType)  //-------通过  GPRS  
  {
    
