nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
    //----stuff Ginfolen ----
    UpReg[Greglen]=(u8)((Up_wr-2)<<8);  //长度不算头 
	UpReg[Greglen+1]=(u8)(Up_wr-2);   
	
    Gfcs=0;                 //  计算从电话号码开始到校验前数据的异或和  G 协议校验 
	for(i=3;i<Up_wr;i++)
		Gfcs^=UpReg[i];
	
    UpReg[Up_wr++]=Gfcs;  // 填写G校验位

	
    UpReg[Up_wr++]=0x0D;  // G 协议尾
	UpReg[Up_wr++]=0x0A;
    //=================================================================================================
    //---------通过 GPRS 发送  --------------    
	GPRS_infoWr_Tx=0;	//--------------  clear  --------- 
	//-----------------------------------------------------------------------
	memcpy(GPRS_info+GPRS_infoWr_Tx,UpReg,Up_wr); // 拷贝内容到发送缓存区
	GPRS_infoWr_Tx+=Up_wr; 	
	//-----------  Add for Debug ---------------------------------
#if  0   	
	 memset(UDP_AsciiTx,0,sizeof(UDP_AsciiTx)); 	 
	 strcat((char*)UDP_AsciiTx,"AT%IPSENDX=1,\"");
	 packet_len=14;//strlen((const char*)UDP_AsciiTx);	
	 UDP_AsciiTx_len=HextoAscii(GPRS_info, GPRS_infoWr_Tx,UDP_AsciiTx+packet_len);
	
	 packet_len+=UDP_AsciiTx_len;	 
	 strcat((char*)UDP_AsciiTx,"\"\r\n");  
 
	  以后再说吧
	 if(DispContent==2)
		Uart1_PutData((uint8_t *) UDP_AsciiTx, packet_len+3);		
	 GSM_PutData((uint8_t*)UDP_AsciiTx,packet_len+3);  
	 rt_kprintf("\r\n	SEND DriveRecord -UP-Data! \r\n");  
#endif	
  }  
  else	 
  {                 //-----  通过串口输出
    for(i=0;i<Up_wr;i++)
		rt_kprintf("%c",UpReg[i]); 
  }


} 

//------------------------------------------------------------------
void  Process_GPRSIN_DeviceData(u8 *instr, u16  infolen)
{
   u8  fcs=0;
   u16 i=0;



   //   caculate  and   check fcs
   for(i=0;i<infolen-1;i++)
   	  fcs^=instr[i];
   
   if(fcs!=instr[infolen-1])
   	  return;
   //  classify  cmd             
   switch(instr[2])   // AAH 75H CMD
   	{
   	  //  上行
      case 0x00:  // 采集行车记录仪执行标准版本号
                 Adata_ACKflag.A_Flag__Up_Ver_00H=0xff;
				 break;
	  case 0x01:  // 采集当前驾驶人信息
	             Adata_ACKflag.A_Flag_Up_DrvInfo_01H=instr[2];
				 break;
	  case 0x02:  // 采集记录仪的实时时钟
	             Adata_ACKflag.A_Flag_Up_RTC_02H=instr[2];
				 break;
	  case 0x03:  // 采集行驶里程
	             Adata_ACKflag.A_Flag_Up_Dist_03H=instr[2];
				 break;
	  case 0x04:  // 采集记录仪速度脉冲系数
	             Adata_ACKflag.A_Flag_Up_PLUS_04H=instr[2];
				 break;
	  case 0x06:  // 采集车辆信息
	             Adata_ACKflag.A_Flag_Up_VechInfo_06H=instr[2];
				 break;
	  case 0x08:  // 采集记录仪状态信号配置信息
	             Adata_ACKflag.A_Flag_Up_SetInfo_08H=instr[2];
				 break;
	  case 0x16:  // 采集记录仪唯一编号
	             Adata_ACKflag.A_Flag_Up_DevID_16H=instr[2];
				 break;
	  case 0x09:  // 采集指定的每秒钟平均速度记录            
	             Adata_ACKflag.A_Flag_Up_AvrgSec_09H=instr[2];  // 有起始结束时间
	  	         break;
	  case 0x05: // 采集指定的每分钟平均速度记录
	             Adata_ACKflag.A_Flag_Up_AvrgMin_05H=instr[2]; // 有起始结束时间
	             break;
	  case 0x13: // 采集指定的位置信息记录
	             Adata_ACKflag.A_Flag_Up_Posit_13H=instr[2];
				 break;
	  case 0x07: // 采集事故疑点记录
	             Adata_ACKflag.A_Flag_Up_Doubt_07H=instr[2];  // 有起始结束时间
	             break;
	  case 0x11: // 采集指定的疲劳驾驶记录
	             Adata_ACKflag.A_Flag_Up_Tired_11H=instr[2]; // 有起始结束时间
				 break;
	  case 0x10: // 采集指定的登录退出记录
	             Adata_ACKflag.A_Flag_Up_LogIn_10H=instr[2]; // 有起始结束时间
	             break;
	  case 0x14: // 采集指定的记录仪外部供电记录
	            Adata_ACKflag.A_Flag_Up_Powercut_14H=instr[2]; // 有起始结束时间
				break;
	  case 0x15: // 采集指定的记录仪参数修改记录
	            Adata_ACKflag.A_Flag_Up_SetMdfy_15H=instr[2];
				break;
	  //  下行
	  case 0x82: // 设置车辆信息                 
				    memset(JT808Conf_struct.Vechicle_Info.Vech_VIN,0,sizeof(JT808Conf_struct.Vechicle_Info.Vech_VIN));
				    memset(JT808Conf_struct.Vechicle_Info.Vech_Num,0,sizeof(JT808Conf_struct.Vechicle_Info.Vech_Num));
				    memset(JT808Conf_struct.Vechicle_Info.Vech_Type,0,sizeof(JT808Conf_struct.Vechicle_Info.Vech_Type)); 	
                 
					 //-----------------------------------------------------------------------
					 memcpy(JT808Conf_struct.Vechicle_Info.Vech_VIN,instr,17);
					 memcpy(JT808Conf_struct.Vechicle_Info.Vech_Num,instr+17,12);
					 memcpy(JT808Conf_struct.Vechicle_Info.Vech_Type,instr+29,12); 
					 
			
				 	Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));   

                 Adata_ACKflag.A_Flag_Dn_DrvInfo_82H=instr[2];
				    
					Settingchg_Status=0x82;//设置车辆信息 					
					NandsaveFlg.Setting_SaveFlag=1;  //存储参数修改记录
	  case 0x83:  // 设置初次安装日期
                             memcpy(JT808Conf_struct.FirstSetupDate,instr,6); 
				  Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
                 Adata_ACKflag.A_Flag_Dn_SetupDate_83H=instr[2];
				 Settingchg_Status=0x83;//设置车辆信息 				 
				 NandsaveFlg.Setting_SaveFlag=1;  //存储参数修改记录
				 break;
	  case 0x84:  // 设置状态量信息	
	             Settingchg_Status=0x84;//设置车辆信息 	             
				 NandsaveFlg.Setting_SaveFlag=1;  //存储参数修改记录
	             break;
	  case 0xc2: // 设置记录仪时钟
                 Adata_ACKflag.A_Flag_Dn_RTC_C2H=instr[2];
				 Settingchg_Status=0xc2;//设置车辆信息 				 
				 NandsaveFlg.Setting_SaveFlag=1;  //存储参数修改记录
				 break;
	  case 0xc3: // 设置记录仪速度脉冲系数                 
				  JT808Conf_struct.Vech_Character_Value=(u32)(instr[0]<<24)+(u32)(instr[1]<<16)+(u32)(instr[2]<<8)+(u32)(instr[3]); // 特征系数	速度脉冲系数
				  Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));   
		         Adata_ACKflag.A_Flag_Dn_Plus_C3H=instr[2];   
				 Settingchg_Status=0xc3;//设置车辆信息  				 
				 NandsaveFlg.Setting_SaveFlag=1;  //存储参数修改记录
				 break;
	  default:

		         break;
				 
				 	


   	}
}

u8 Send_Device_Data(void)  //  给行车记录仪发送数据
{
  u8  j=0,i=0,reg=0;;

   j=sizeof(Adata_ACKflag);
  for(i=0;i<j;i++)
  	{
  	    reg=(*((u8*)&Adata_ACKflag+i)); 
        if(reg)
        {
		    if(reg!=0xff)
			{
			  Device_Data(reg,1);
		    }
			else
			   Device_Data(0x00,1);	   // 采集行车记录仪执行标准版本号 命令为0x00 置位时填写0xFF,所以单独处理
            (*((u8*)&Adata_ACKflag+i))=0;  // clear flag 
            return true;
		}  
		
