nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
  	}
   return false; 

}


#if 0

u8 RecordSerial_output_Str(const char *fmt,...) 
{
    u8 regstr[100],fcs=0;
	u16 reglen=0,i=0;
	
	va_list args;
	va_start(args, fmt);
	  memset(regstr,0,sizeof(regstr));  
	regstr[0]=0x55; // 协议头    
    regstr[1]=0x7A;
	regstr[2]=0xFE; // 命令字 ，用预留命令字表示调试输出	
	//  3,4 为长度字节最后填写
	regstr[5]=0x00; // 备用字  0x00

	reglen= vsprintf((char*)regstr+6, fmt, args);
	va_end(args); 
	regstr[3]=(u8)(reglen>>8);  // 填写长度  ，长度为信息内容的长度 
	regstr[4]=(u8)reglen;   
	
	reglen+=6;
	fcs=0;	
	for(i=0;i<reglen;i++)
		fcs^=regstr[i];
	regstr[reglen]=fcs;
	reglen++; 
	for(i=0;i<reglen;i++)
	     rt_kprintf("%c",regstr[i]);  
	
	return 1;
}

#endif

void SpeedWarnJudge(void)  //  速度报警判断 
{

               //---------------------------------
              //  判断非法位移 
              if(SleepState==1)//休眠
              {
                     if(GPS_speed>100 )	// 速度大于10 km
                     {
                         spd_sleepDur++;
						 if(spd_sleepDur>=10) //  速度大于10s
						 {
							   if(spd_sleepDur==10)
							   {
									if((Warn_Status[3]&0x10)==0x00)
									{
			                             //-------- 非法位移了----
										 Warn_Status[3]|=0x10;
										 PositionSD_Enable();  
							             Current_UDP_sd=1;  
										 rt_kprintf("\r\n  非法位移报警\r\n"); 
									}
									else
										rt_kprintf("\r\n  非法位移已触发，尚未解除报警\r\n");  
						   	   }	
						 }
					 }
					 else
					 {
                         spd_sleepDur=0;   
					 }

			  }
              //----------------------------------
  					 //--------  速度报警  -------	 
					 if(  JT808Conf_struct.Speed_warn_MAX >0 )   //> 0 
					 {
			            
						 //----- GPS  即时速度	0.1 km/h  ---------
							 if  ( GPS_speed>( JT808Conf_struct.Speed_warn_MAX*10) )							 	
							// if( DebugSpd > ( JT808Conf_struct.Speed_warn_MAX*10) ) 
							 {
											 speed_Exd.dur_seconds++;
											 if ( speed_Exd.dur_seconds >JT808Conf_struct.Spd_Exd_LimitSeconds)   
											 {
													 speed_Exd.dur_seconds = 0;  
													 if ( speed_Exd.speed_flag!= 1 )
													 {				   
														 speed_Exd.speed_flag = 1;			 
														 //PositionsSD_Enable();	  //  回报GPS 信息	 
														if((Warn_MaskWord[3]&0x02)==0x02) 
                                                       { 
                                                            rt_kprintf("\r\n  超速报警触发，但被屏蔽\r\n"); 
													   }
														else
														{PositionSD_Enable();  
				                                          Current_UDP_sd=1;  
														  
														 StatusReg_SPD_WARN(); //  超速报警状态
														 StatusReg_SPD_PreNORMAL();// 预报警结束
														 rt_kprintf("\r\n  超速报警\r\n"); 
														 TTS_play(" 超速报警触发");
													    }
													 } 
													 //---------------------------------------------
													 Time2BCD(speed_Exd.ex_startTime); //记录超速报警起始时间
													 if(speed_Exd.current_maxSpd<GPS_speed) //找最大速度
														  speed_Exd.current_maxSpd=GPS_speed;
													 speed_Exd.excd_status=1;
													 speed_Exd.dur_seconds++;		
			 
												   //---------------------------------------------- 
											 }
											 
											 if(speed_Exd.excd_status==1) // 使能flag 后开始计时 
											  {
												 speed_Exd.dur_seconds++; 
												 if(speed_Exd.current_maxSpd<GPS_speed) //找最大速度
														  speed_Exd.current_maxSpd=GPS_speed;
											   } 
									 
							 }
							 else    // 预警判断
							 if(GPS_speed<(JT808Conf_struct.Speed_warn_MAX*10)&&(GPS_speed>(JT808Conf_struct.Speed_warn_MAX*10-JT808Conf_struct.BD_MaxSpd_preWarnValue)))
							 {
							       if((Warn_Status[2]&0x20)==0x00)
							       	{
							       	       rt_kprintf("\r\n  超速预报警触发\r\n"); 
										         StatusReg_SPD_PreWARN();
                                           PositionSD_Enable();  
				                           Current_UDP_sd=1;  
							       	}
								   StatusReg_SPD_NORMAL(); //  清除速度报警状态寄存器  

							 }
							 else
							 { 
							              StatusReg_SPD_NORMAL(); //  清除速度报警状态寄存器  
							              StatusReg_SPD_PreNORMAL();// 预报警结束
										  
										  if(speed_Exd.excd_status!=2)
										  {
										    StatusReg_SPD_NORMAL(); //  清除速度报警状态寄存器
											speed_Exd.dur_seconds = 0;
											speed_Exd.speed_flag = 0; 	
										  } 											   
											//----------------------------------------------
											if(speed_Exd.excd_status==1)  
		                                                     {		
											    Time2BCD(speed_Exd.ex_endTime); //记录超速报警结束时间 
												speed_Exd.excd_status=2;
							 	            }
											else
											if(speed_Exd.excd_status==0)
												Spd_ExpInit();
											//---------------------------------------------- 
							 }
					  }//------- 速度报警 over	 ---


}


u16  Protocol_808_Encode(u8 *Dest,u8 *Src, u16 srclen)
{
  u16  lencnt=0,destcnt=0;

  for(lencnt=0;lencnt<srclen;lencnt++)
  {
     if(Src[lencnt]==0x7e)  // 7e 转义
     {
       Dest[destcnt++]=0x7d;
	   Dest[destcnt++]=0x02;
     }
     else
	 if(Src[lencnt]==0x7d) //  7d  转义 	
	 {
       Dest[destcnt++]=0x7d;
	   Dest[destcnt++]=0x01; 
	 }
	 else
        Dest[destcnt++]=Src[lencnt]; // 原始信息
  }

  return destcnt; //返回转义后的长度

}
//-------------------------------------------------------------------------------
void Protocol_808_Decode(void)  // 解析指定buffer :  UDP_HEX_Rx  
{
	//-----------------------------------
	  u16 i=0;

    // 1.  clear  write_counter
	  UDP_DecodeHex_Len=0;//clear DecodeLen

	// 2   decode process   
	for(i=0;i<UDP_hexRx_len;i++)
	 {
		if((UDP_HEX_Rx[i]==0x7d)&&(UDP_HEX_Rx[i+1]==0x02))
		{
		   UDP_HEX_Rx[UDP_DecodeHex_Len]=0x7e;
		   i++;
		}
		else
		if((UDP_HEX_Rx[i]==0x7d)&&(UDP_HEX_Rx[i+1]==0x01))
		{
		   UDP_HEX_Rx[UDP_DecodeHex_Len]=0x7d;
		   i++;
		}
		else  
		{
		  UDP_HEX_Rx[UDP_DecodeHex_Len]=UDP_HEX_Rx[i];  
		}
	    UDP_DecodeHex_Len++;
	 }	
    //  3.  The  End
}
//---------  拐点补传测试程序  ---------------------------
//#if 0
/*
void Inflexion_Process(void)
{            //
  u16  once_delta=0;


	Inflexion_Current=GPS_direction;  //  update new
   //----------------------------------------------------------------------- 
    if(Inflexion_Current>Inflexion_Bak)   // 初步判断大小  
    	{  // 增大
            if((Inflexion_Current-Inflexion_Bak)>300)  // 判断是否倒置减小
			{   //  如果差值大于300 ，说明是小于
			     once_delta=Inflexion_Bak+360-Inflexion_Current;  //判断差值绝对值
			     InflexDelta_Accumulate+=once_delta;
				 if((once_delta>=15)&&(once_delta<=60)) // 角度最小变化率不得小于15度  拐点补传角度不大于180 要求连续3s  所以每秒不大于60
				 {
					    if((Inflexion_chgcnter>0)&&(InflexLarge_or_Small==2))  //判断之前是否一直是小于
					    	{
		                        Inflexion_chgcnter++;
								if((InflexDelta_Accumulate>=3)&&(InflexDelta_Accumulate>JT808Conf_struct.DURATION.SD_Delta_maxAngle)&&(InflexDelta_Accumulate<=180))
									{     //要求至少持续3s	累计拐角补传角度不得大于180
                                           InflexLarge_or_Small=0;
										   Inflexion_chgcnter=0;
										   InflexDelta_Accumulate=0;
										   PositionSD_Enable=1; // 发送拐点标志位
										   rt_kprintf("\r\n 拐点上报 --1\r\n");
									}
								else
								  InflexLarge_or_Small=2; // 这次是小于
					    	}
						else
							{
							   InflexLarge_or_Small=2;  // 这是第一次小于 
							   Inflexion_chgcnter=1;
							   InflexDelta_Accumulate=once_delta;
							}
				 }
				 else
				 {    //  小于 15 就算等于
				   InflexLarge_or_Small=0;
				   Inflexion_chgcnter=0;
				   InflexDelta_Accumulate=0;
				 }
				 	
