nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
            } 
			else		// current真真正正的比Bak 大
			{  
			   once_delta=Inflexion_Current-Inflexion_Bak;  //判断差值绝对值
			   InflexDelta_Accumulate+=once_delta;
			   if((once_delta>=15)&&(once_delta<=60)) // 角度最小变化率不得小于15度  拐点补传角度不大于180 要求连续3s  所以每秒不大于60
			   {
	               if((Inflexion_chgcnter>0)&&(InflexLarge_or_Small==1)) //判断之前是否一直大于
				   {
				       Inflexion_chgcnter++;					   
					   if((InflexDelta_Accumulate>=3)&&(InflexDelta_Accumulate>JT808Conf_struct.DURATION.SD_Delta_maxAngle)&&(InflexDelta_Accumulate<=180))
						   {	 //要求至少持续3s	累计拐角补传角度不得大于180
								  InflexLarge_or_Small=0;
								  Inflexion_chgcnter=0;
								  InflexDelta_Accumulate=0;
								  PositionSD_Enable(); // 发送拐点标志位
								  rt_kprintf("\r\n 拐点上报 --2\r\n");
						   }
					   else
					     InflexLarge_or_Small=1; // 这次是大于
	               }	
				   else
				   	{  
                       InflexLarge_or_Small=1;  // 这是第一次大于
					   Inflexion_chgcnter=1;
					   InflexDelta_Accumulate=once_delta; 
				   	}
			   }
			    else
				 {     // 小于15度就算等于
				   InflexLarge_or_Small=0;
				   Inflexion_chgcnter=0;
				   InflexDelta_Accumulate=0;
				 }

			}  
    	}
	else
	 if(Inflexion_Current<Inflexion_Bak)	
	 	{  // 减小
               if((Inflexion_Bak-Inflexion_Current)>300)  // 判断是否倒置增大
               { //  如果差值大于300 ，说明是大于
                  once_delta=Inflexion_Current+360-Inflexion_Bak;  //判断差值绝对值
			      InflexDelta_Accumulate+=once_delta;
				  if((once_delta>=15)&&(once_delta<=60)) // 角度最小变化率不得小于15度	拐点补传角度不大于180 要求连续3s  所以每秒不大于60
                  {   // 最小变化率 不小于 15
                     if((Inflexion_chgcnter>0)&&(InflexLarge_or_Small==1))  //判断之前是否一直是大于
					    	{
		                        Inflexion_chgcnter++;
								if((InflexDelta_Accumulate>=3)&&(InflexDelta_Accumulate>JT808Conf_struct.DURATION.SD_Delta_maxAngle)&&(InflexDelta_Accumulate<=180))
									{     //要求至少持续3s	累计拐角补传角度不得大于180
                                           InflexLarge_or_Small=0;
										   Inflexion_chgcnter=0;
										   InflexDelta_Accumulate=0;
										   PositionSD_Enable(); // 发送拐点标志位
										   rt_kprintf("\r\n 拐点上报 --3\r\n");
									}
								else
								  InflexLarge_or_Small=1; // 这次是大于
					    	}
						else
							{
							   InflexLarge_or_Small=1;  // 这是第一次大于 
							   Inflexion_chgcnter=1;
							   InflexDelta_Accumulate=once_delta;
							}

                  }
				  else
				  {    //  小于 15 就算等于
				   InflexLarge_or_Small=0;
				   Inflexion_chgcnter=0;
				   InflexDelta_Accumulate=0;
				  }
			  }//---------------------------
			   else 	   // current 真真正正的比Bak 小
			   {
				  once_delta=Inflexion_Bak-Inflexion_Current;  //判断差值绝对值
				  InflexDelta_Accumulate+=once_delta;
				  if((once_delta>=15)&&(once_delta<=60)) // 角度最小变化率不得小于15度	拐点补传角度不大于180 要求连续3s  所以每秒不大于60
				  {
					  if((Inflexion_chgcnter>0)&&(InflexLarge_or_Small==2)) //判断之前是否一直小于
					  {
						  Inflexion_chgcnter++; 					  
						  if((InflexDelta_Accumulate>=3)&&(InflexDelta_Accumulate>JT808Conf_struct.DURATION.SD_Delta_maxAngle)&&(InflexDelta_Accumulate<=180))
							  { 	//要求至少持续3s	累计拐角补传角度不得大于180
									 InflexLarge_or_Small=0;
									 Inflexion_chgcnter=0;
									 InflexDelta_Accumulate=0;
									 PositionSD_Enable(); // 发送拐点标志位
									 rt_kprintf("\r\n 拐点上报 --4\r\n"); 
							  }
						  else
						   InflexLarge_or_Small=2; // 这次是小于
					  }    
					  else
					   {  
						  InflexLarge_or_Small=2;  // 这是第一次小于
						  Inflexion_chgcnter=1;
						  InflexDelta_Accumulate=once_delta; 
					   }
				  }
				   else
					{	  // 小于15度就算等于
					  InflexLarge_or_Small=0;
					  Inflexion_chgcnter=0;
					  InflexDelta_Accumulate=0;
					}
			   
			   }
			  	
	

	 	}
	else
		{
		  InflexLarge_or_Small=0;
		  Inflexion_chgcnter=0;
		  InflexDelta_Accumulate=0;
		}  

    //--------------------------------------------------------
    Inflexion_Bak=Inflexion_Current; //  throw  old	 to  Bak

}*/
//#endif 

void  Sleep_Mode_ConfigEnter(void)
{
   if(SleepState==0)
		{
		   	 SleepCounter++;
			 if(SleepCounter>18000)   //15 old 防抖处理      30min  1800s     18000 
			 {
			      SleepCounter=0; 
			   	   SleepState=1;		
				   Sleep_IO_state=0x0002;  // 休眠状态 表32  bit 1  
				   if(JT808Conf_struct.RT_LOCK.Lock_state!=1)
				   Current_SD_Duration=JT808Conf_struct.DURATION.Sleep_Dur; // 5分钟 
				   //   修改间隔后立即发送
				   PositionSD_Enable();        //发送
				   Current_UDP_sd=1;
				    memcpy(BakTime,CurrentTime,3); // update    
				    
				   //JT808Conf_struct.DURATION.Heart_SDCnter=25; 
				 //JT808Conf_struct.DURATION.Heart_Dur=320; 
				  /*   天地通要求休眠不重新计时  ，不  
				    memcpy(BakTime,CurrentTime,3); // update  //gps开始计时 
				    systemTick_trigGPS_counter=0; // 系统定时 清除
				  */  
				   if(DataLink_Status())
	                                PositionSD_Enable();  //  在线就发送    河北天地通要求数据完整 
				    rt_kprintf("\r\n  30min 后进入休眠状态! \r\n");     
					
					SD_ACKflag.f_Worklist_SD_0701H=1; // 上报电子运单
			 }  
		 }
}

void  Sleep_Mode_ConfigExit(void)
{
    if(SleepState==1)
		   	{
		   	   SleepState=0;
			   rt_kprintf("\r\n 车台唤醒! \r\n");     
			   
			   SD_ACKflag.f_Worklist_SD_0701H=1; // 上报电子运单
		   	}
   if(JT808Conf_struct.RT_LOCK.Lock_state!=1)
       Current_SD_Duration=JT808Conf_struct.DURATION.Default_Dur; 
  // JT808Conf_struct.DURATION.Heart_Dur=90;  
   SleepState=0;
   SleepCounter=0; 

}

#if 0
u16 WaveFile_EncodeHeader(u32 inFilesize ,u8* DestStr)
{
   u32 Filesize=0,i=0;     // Header Len  =44Bytes  

    
	//  1. RIFF
    memcpy(DestStr,"RIFF",4); 
	i+=4;
	//  2. Wave 文件 大小  小端模式 
	Filesize=0x24+(inFilesize<<3); // 乘以16 加 36 wave 文件大小 
	rt_kprintf("\r\n .wav 文件大小: %d Rawdata: %d \r\n ",Filesize,(inFilesize<<3)); 
	DestStr[i++]=Filesize; // LL
	DestStr[i++]=(Filesize>>8);//LH
	DestStr[i++]=(Filesize>>16);//HL
	DestStr[i++]=(Filesize>>24);//HH
	//  3. WAVE string	
    memcpy(DestStr+i,"WAVE",4);
	i+=4;
	//  4. fmt string	
    memcpy(DestStr+i,"fmt ",4);
	i+=4;
    //  5. PCM Code    
	DestStr[i++]=0x10; // LL
	DestStr[i++]=0x00;//LH
	DestStr[i++]=0x00;//HL
	DestStr[i++]=0x00;//HH   
	//  6. Audio Format  PCM=1	
	DestStr[i++]=0x01; // L
	DestStr[i++]=0x00;//H
	//  7. NumChannels  通道数
	DestStr[i++]=0x01; // L
	DestStr[i++]=0x00;//H
	//  8. SampleRate     8000<=>0x00001F40    16000<=>0x00003E80      
	DestStr[i++]=0x40;//0x40; // LL
	DestStr[i++]=0x1F;//0x1F;//LH
	DestStr[i++]=0x00;//HL
	DestStr[i++]=0x00;//HH    
    //  9.ByteRate       == SampleRate * NumChannels * BitsPerSample/8  ==8000x1x8/8 
	DestStr[i++]=0x40;//0x40; // LL
	DestStr[i++]=0x1F;//0x1F;//LH
	DestStr[i++]=0x00;//HL
	DestStr[i++]=0x00;//HH   

	// 10.BlockAlign   	== NumChannels * BitsPerSample/8
	DestStr[i++]=0x01;//0x02;//0x01; // L 
	DestStr[i++]=0x00;//H
	// 11.BitsPerSample
	DestStr[i++]=0x08;//0x10;//0x08; // L
	DestStr[i++]=0x00;//H
    // 12.data string	
    memcpy(DestStr+i,"data",4);
	i+=4;
	// 13 .datasize
	Filesize=(inFilesize<<3); // 乘以16 加 36 wave 文件大小 
	DestStr[i++]=Filesize; // LL
	DestStr[i++]=(Filesize>>8);//LH
	DestStr[i++]=(Filesize>>16);//HL
	DestStr[i++]=(Filesize>>24);//HH

    return i;
}
#endif

