nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
	     	}	

              rt_kprintf("\r\n In judge area \r\n");  
		//rt_kprintf("\r\n   Current== Latitude:   %d     Longitude: %d     Point1== Latitude:   %d     Longitude: %d     Point2== Latitude:   %d     Longitude: %d\r\n",Cur_Lat,Cur_Longi,P1_Lat,P1_Longi,P2_Lat,P2_Longi);   

        //  3. 将差值差算成实际距离
             #if 0
		    x2=x2*0.0853; // a/1000000*85300=a 853/10000 m =a x 0.0853
                 y1=y1/9; //  a/1000000*111000=a/9.009	除以一百万得到度数 再乘以 111000 米得到实际距离 
                 x0=x0*0.0853;     
		   y0=y0/9; //  a/1000000*111000=a/9.009	    
	      #else
		   fx2=fx2*0.0853; // a/1000000*85300=a 853/10000 m =a x 0.0853
                 fy1=fy1/9; //  a/1000000*111000=a/9.009	除以一百万得到度数 再乘以 111000 米得到实际距离 
                 fx0=fx0*0.0853;     
		   fy0=fy0/9; //  a/1000000*111000=a/9.009	      
             #endif

	 //  4. 计算距离 
	       //Rabs=0-y1*x0-x2*y0+y1*x2;  
              // rt_kprintf("\r\n Test -y1*x0=%d -y0*x2=%d  y1*x2=%d   Rabs=%d  \r\n",0-y1*x0,0-y0*x2,0-y1*x2,Rabs);          
	  #if 0
	       Rabs=abs(-y1*x0-x2*y0+y1*x2);   
	       Rsqrt=sqrt(y1*y1+x2*x2); 
	        // distance=abs(-y1*x0-x2*y0-y1*x2)/sqrt(y1*y1+x2*x2); 
	       distance=Rabs/Rsqrt;
	  // rt_kprintf("\r\n Rabs=%d    Rsqrt=%d   d=%d",Rabs,Rsqrt,distance);        
        #else
             	fRabs=abs(-fy1*fx0-fx2*fy0+fy1*fx2);   
	       fRsqrt=sqrt(fy1*fy1+fx2*fx2); 
	        // distance=abs(-y1*x0-x2*y0-y1*x2)/sqrt(y1*y1+x2*x2); 
	       distance=(long) ((fRabs/fRsqrt)*1000);
	       // rt_kprintf("\r\n Rabs=%d    Rsqrt=%d   d=%d",Rabs,Rsqrt,distance);      
	  #endif
	  
	     
     return   distance;
}




 unsigned short int CRC16_file(unsigned short int num)  
{
#if  0
 unsigned short int i=0,j=0;
 unsigned char buffer_temp[514];
   memset(buffer_temp,0,sizeof(buffer_temp));
   for(i=0;i<num;i++)
	{
		if(i==0)   //第一包
			{
			Last_crc=0;   // clear first  
			crc_fcs=0;
			buffer_temp[0]=0;
	        buffer_temp[1]=51;
	        DF_ReadFlash(51,0,&buffer_temp[2],PageSIZE);
			 WatchDog_Feed(); 
			
			Last_crc=CRC16_1(buffer_temp,514,0xffff);
			rt_kprintf("\r\ni=%d,j=%d,Last_crc=%x",i,j,Last_crc);
			}
		else if(i==(num-1))  //最后一包
			{
            buffer_temp[0]=0;
	        buffer_temp[1]=50;
	        DF_ReadFlash(50,0,&buffer_temp[2],PageSIZE);
			FileTCB_CRC16=((unsigned short int)buffer_temp[512]<<8)+(unsigned short int)buffer_temp[513];
			crc_fcs=CRC16_1(buffer_temp,512,Last_crc);
			rt_kprintf("\r\ni=%d,j=%d,Last_crc=%x ReadCrc=%x ",i,j,crc_fcs,FileTCB_CRC16);
			}
		else  
			{             // 中间的包
			 j=i+51;
			 buffer_temp[0]=(char)(j>>8);
			 buffer_temp[1]=(char)j;
			 DF_ReadFlash(j,0,&buffer_temp[2],PageSIZE);
			 WatchDog_Feed(); 
			Last_crc=CRC16_1(buffer_temp,514,Last_crc);
			//rt_kprintf("\r\ni=%d,j=%d,Last_crc=%d",i,j,Last_crc);
			}
	   }
rt_kprintf("\r\n  校验结果 %x",crc_fcs);
return crc_fcs;
#endif
		  return 1;
}



//-------  JT808  Related   Save  Process---------
void  Save_Status(u8 year,u8 mon,u8 day,u8 hour,u8 min,u8 sec)
{   // 存储事故疑点 最近20s车辆的状态字，和当前最近的有效位置信息  

       
		u16 wr_add=3,j=0,cur=0;   
		u8	FCS;	 
		u8  regDateTime[6];		
		static uint8_t Statustmp[500]; 
//		u32  latitude=0,longitude=0;    
 
                       Time2BCD(regDateTime);  
                       //----------------------------------------------------------------------------
					   wr_add=0; 
					   memcpy(Statustmp,regDateTime,6);
					   wr_add+=6;		   
					   //-----------------------  Status Register   --------------------------------
					 cur=save_sensorCounter;  //20s的事故疑点
					 for(j=0;j<100;j++)
					 {
                         Statustmp[wr_add++]=Sensor_buf[cur].DOUBTspeed;    //速度
						 Statustmp[wr_add++]=Sensor_buf[cur].DOUBTstatus;   //状态    
                         cur++;
						 if(cur>100)
						 	cur=0;                            
					 }           
					 //---------------------------------------------------------------------------------------
					 FCS = 0;  
					 for( j=0;j<wr_add;j++)    
					 {
						FCS ^=Statustmp[j];	            
					 }				//求上边数据的异或和      不算校验 信息长度为   206
					 //------------------------------------------------------------------------------
					 Statustmp[wr_add++]=FCS; 
					   //----------------------------------------------------------------------------- 	 
					   rt_kprintf("\r\n 存储行车记录  Record  write: %d    SaveLen: %d    \r\n",Recorder_write,wr_add); 
                                      Api_DFdirectory_Write(doubt_data,Statustmp, wr_add);

					   
}
//-----------------------------------------------------------------------------------
void Save_AvrgSpdPerMin(void) 
{ /*
     Note: 存储单位小时每分钟平均速度 
  */
  u8   content[70];
  u8   saveLen=0,FCS=0,i;   
    
	 saveLen=0; 
	 memset(content,0,70);
	 memcpy(content+saveLen,Avrgspd_Mint.datetime_Bak,5);    //用BAKtime
	 saveLen+=5;
	 memcpy(content+saveLen,Avrgspd_Mint.avgrspd,60);    //用BAKtime
	 saveLen+=60;  
  //---------------------------------------------------------------------------------------
  FCS = 0;
  for ( i = 0; i < 69; i++ ) 
  {
	 FCS ^=content[i];    
  } 			 //求上边数据的异或和   
  content[69] = FCS;	 // 第8字节	       
  //----------------------------------------------------------------------------------------  
  Api_DFdirectory_Write(spdpermin, content, 70); 
  //-----------------------------------------------------------------
  memset(Avrgspd_Mint.avgrspd,0,60); // 存储后清除记录     
   if(DispContent)
        rt_kprintf("\r\n   存储单位小时每分钟平均速度   Save Time %X-%X-%X %x:%x     \r\n",\
  	Avrgspd_Mint.datetime_Bak[0],Avrgspd_Mint.datetime_Bak[1],\
  	Avrgspd_Mint.datetime_Bak[2],Avrgspd_Mint.datetime_Bak[3],Avrgspd_Mint.datetime_Bak[4]);   
  
}

  void Spd_Exp_Wr(void)
  {	
     u8  content[40];
     u8  wr_add=0,i=0,FCS=0; 	 

	 memset(content,0,sizeof(content));
	memcpy(content+wr_add,JT808Conf_struct.Driver_Info.DriverCard_ID,18);
	wr_add+=18;
	memcpy(content+wr_add,speed_Exd.ex_startTime,6);
	wr_add+=6;
	memcpy(content+wr_add,speed_Exd.ex_endTime,6);  
	wr_add+=6; 
	content[wr_add++]=speed_Exd.current_maxSpd/10; 

       FCS = 0;
	   for ( i = 0; i < 32; i++ )  
	   {
			 FCS ^=content[i];
	   }			  //求上边数据的异或和
	   content[wr_add++] = FCS;	  // 第31字节 
	   
       Api_DFdirectory_Write(spd_warn, (u8 *)content, 32); 
	  //----------- debug -----------------------
	  rt_kprintf("\r\n 超速报警  %X-%X-%X %X:%X:%X,MaxSpd=%d\r\n",speed_Exd.ex_endTime[0],speed_Exd.ex_endTime[1],speed_Exd.ex_endTime[2],speed_Exd.ex_endTime[3],speed_Exd.ex_endTime[4],speed_Exd.ex_endTime[5],speed_Exd.current_maxSpd); 
     //--------- clear status ----------------------------
     Spd_ExpInit(); 

