nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
  }

void Save_TiredDrive_Record(void)
{
  u8   content[40];
  u8   wr_add=0,FCS=0,i; 

        wr_add=0; 
	 memset(content,0,70);

	  Time2BCD(TiredConf_struct.Tired_drive.end_time); 
	 
         memcpy(content+wr_add,JT808Conf_struct.Driver_Info.DriverCard_ID,18);
	  wr_add+=18;
	  memcpy(content+wr_add,TiredConf_struct.Tired_drive.start_time,6);
	  wr_add+=6;
	  memcpy(content+wr_add,TiredConf_struct.Tired_drive.end_time,6);
	  wr_add+=6; 

	      FCS = 0;
	   for ( i = 0; i < 32; i++ )  
	   {
			 FCS ^=content[i];
	   }			  //求上边数据的异或和
	   content[wr_add++] = FCS;	  // 第31字节 
	   
       Api_DFdirectory_Write(tired_warn, (u8 *)content, 32); 
       //-----  clear status ---------------  
	  TIRED_Drive_Init();      
	  Status_TiredwhRst=0;
	 // DF_WriteFlashSector(DF_TiredStartTime_Page,0,(u8*)&Status_TiredwhRst,1); //清除O后要写入		
	   TIRED_Drive_Init(); //	休息了 
	   Warn_Status[3]&=~0x04;  //BIT(2)	疲劳驾驶  

}


void  JT808_Related_Save_Process(void)
{
       if(DF_LOCK)
	   	 return ;

	      if(Dev_Voice.CMD_Type!='1')  // 录音时不做以下处理  
      {           

		//-------------------------
		//    存储疑点数据
		if(1==NandsaveFlg.Doubt_SaveFlag) 
		{
			if(sensor_writeOverFlag==1)	
			{ 
			  time_now=Get_RTC();     //  RTC  相关 
			  Save_Status(time_now.year,time_now.month,time_now.day,time_now.hour,time_now.min,time_now.sec);
			  NandsaveFlg.Doubt_SaveFlag=0;
			  return;
			} 
		} 							 
		//  存储每分钟速度信息  
		if(1==Avrgspd_Mint.saveFlag) 
		{
			Save_AvrgSpdPerMin();
			Avrgspd_Mint.saveFlag=0; 
			return;
		}							  	  

		//-----------------  存储疲劳驾驶记录 ---------------			
		if( TiredConf_struct.Tired_drive.Tireddrv_status==2)   
		{
	             Save_TiredDrive_Record();
			return;	 
		}			
		//-----------------  超速报警 ----------------------
		if(speed_Exd.excd_status==2)
		{
		   Spd_Exp_Wr();   
		   return;
		}   
		 /*
		if(NandsaveFlg.Setting_SaveFlag==1)   // 参数 修改记录
		{
		  Save_Common(Settingchg_write,TYPE_SettingChgAdd); 
		  Settingchg_write++;
		  if(Settingchg_write>=Max_CommonNum)  
		  	Settingchg_write=0; 
		  DF_Write_RecordAdd(Settingchg_write,Settingchg_read,TYPE_SettingChgAdd);   
		  NandsaveFlg.Setting_SaveFlag=0; // clear flag
		} 
		*/
			
      	}           
	//	 定时存储里程
	if((Vehicle_RunStatus)&&((Systerm_Reset_counter&0xff)==0xff))
	{   //  如果车辆在行驶过程中，每255 秒存储一次里程数据    
                Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct)); 
		  return;		
	} 
			
	 //--------------------------------------------------------------

}

u8   Time_FastJudge(void) 
{
        u32  Date_value1=0,Time_value1=0;
	 u32  Date_valueRTC=0,Time_valueRTC=0;	 

	  Date_value1=Gps_Gprs.Date[0]*365+Gps_Gprs.Date[1]*30+Gps_Gprs.Date[2];	  	
	  Date_valueRTC=time_now.year*3600+time_now.day*60+time_now.day;
         Time_value1=Gps_Gprs.Time[0]*365+Gps_Gprs.Time[1]*30+Gps_Gprs.Time[2];
	  Time_valueRTC=time_now.hour*3600+time_now.min*60+time_now.sec; 
	  
        if(Date_value1>Date_valueRTC)
		{ 
		     rt_kprintf("\r\n  日期超前，Kick  OUT  !\r\n");
		     StatusReg_GPS_V();	  //  不定位
		     return false;
        	}	 
        if((Time_value1>Time_valueRTC) &&((Time_value1-Time_valueRTC)>120))
        	{
                  rt_kprintf("\r\n  时间超前，Kick  OUT  !\r\n");
		    StatusReg_GPS_V();	// 不定位	  
		     return false;
        	}
        return true;

}

/*
    打印输出 HEX 信息，Descrip : 描述信息 ，instr :打印信息， inlen: 打印长度
*/
void OutPrint_HEX(u8 * Descrip, u8 *instr, u16 inlen )
{
    u32  i=0;
     rt_kprintf("\r\n %s:",Descrip);
     for( i=0;i<inlen;i++)
          rt_kprintf("%2X ",instr[i]); 
     rt_kprintf("\r\n");
}

void  DeviceData_Encode_Send(u8 DeviceID,u8 CMD_TYPE,u8 *Srcstr, u16 inlen)
{
     u16  out_len=0,wr=0,i=0;
     u8  addFCS=0;	 
     u8  Reg[100]; 	 
     u8  reg2[100];	 

      //  stuff orginal info 
	 Reg[0]=0;// 留作校验
        Reg[1]=0x00;  // 版本编号
	 Reg[2]=0x00;	 
	 Reg[3]=0x00;   // 厂商ID 
	 Reg[4]=0x00;	
	 Reg[5]=DeviceID;  // 外设类型
	 Reg[6]=CMD_TYPE; // 命令类型
	 memcpy(Reg+7,Srcstr,inlen);  //  信息内容
        wr=7+inlen;

        // caculate  add fcs
         for(i=0;i<wr-1;i++)
         {
              Reg[0]+=Reg[1+i];
         }
	rt_kprintf("\r\n // Send  -------------------------");	 
	OutPrint_HEX ("原始信息",Reg,wr);
       //  Encode 1       reg2 is  A.2.1  格式内容
        memset(reg2,0,100);
	 reg2[0]=0x7e;   // head
        i=Protocol_808_Encode(reg2+1, Reg, wr);// Encode content
        reg2[i+1]=0x7e;// tail 		
	OutPrint_HEX("首次转义加头尾",reg2,i+2);	
       //  Packet again     需要再次填写，编码
        memset(Reg,0,100);
	 Reg[0]=0x7E;
	 Reg[1]=0x35;
	 Reg[2]=0x01;	  // head 
	 out_len=Protocol_808_Encode(Reg+3, reg2, i+2);// Encode content
	 Reg[out_len+3]=0x7e;	//tail
	 //  Encode 2
        OutPrint_HEX("发送的数据",Reg,out_len+4);  
	 rt_device_write(&Device_CAN2,0,( const char*)Reg,out_len+4);  
		rt_kprintf("// Send over -----------------------\r\n");	 
	 
}




void Tired_Check(void)
{
     		   if(DispContent==2) 
			  	rt_kprintf("\r\n				速度: %d Km/h    Debugspd=%d KM/h \r\n",GPS_speed/10,DebugSpd/10);	   
	          if(GPS_speed>60)  // GPS_speed 单位为0.1 km/h  速度大于6 km/h  认为是行驶 
	         // if(DebugSpd>60) 
			  {   								 
				 //-------------疲劳驾驶相关 ----------------------- 
				 TiredConf_struct.Tired_drive.ACC_ONstate_counter++;  // ACC 累计工作时间
				 if(DispContent==5)
				    rt_kprintf("\r\n  ACC ON = %d",TiredConf_struct.Tired_drive.ACC_ONstate_counter); 
				 if(TiredConf_struct.Tired_drive.ACC_ONstate_counter>3)	//ACC 开 485 外设开电，防抖处理 
				 {				   
					 Power_485CH1_ON;  // 第一路485的电 		上电工作
				 }
				 
				 TiredConf_struct.Tired_drive.ACC_Offstate_counter=0; // clear 
				 //------ 停车超时相关  -----------
				 TiredConf_struct.TiredDoor.Parking_currentcnt=0; // Clear  停车 计数器清 0 
				  Warn_Status[1]&=~0x08;  // 停车超时清除
				 //---------------------------------  
				 if( TiredConf_struct.Tired_drive.ACC_ONstate_counter==(TiredConf_struct.TiredDoor.Door_DrvKeepingSec-30)) //提前5分钟蜂鸣器提示注意疲劳驾驶 14100
					{  
					     TiredConf_struct.Tired_drive.Tgvoice_play=1;
					     TTS_play("您还有20秒就疲劳驾驶，请注意安全");	 
				 	}
                 //----------- 疲劳驾驶预报警  ----------------------------
                 if( TiredConf_struct.Tired_drive.ACC_ONstate_counter>=(TiredConf_struct.TiredDoor.Door_DrvKeepingSec-JT808Conf_struct.BD_TiredDrv_preWarnValue))
                 	{
                 	    if(TiredConf_struct.Tired_drive.ACC_ONstate_counter<TiredConf_struct.TiredDoor.Door_DrvKeepingSec)
					   {
						    if(((Warn_Status[2]&0x40)==0x00)&&((Warn_Status[3]&0x04)==0x00))
					     	{
								  rt_kprintf("\r\n  疲劳预报警触发\r\n"); 
								  StatusReg_Tired_PreWARN();
								   PositionSD_Enable();  
					               Current_UDP_sd=1;  
						    }
                 	   }
                 	}
				 else
				 	{    // 清除预报警
                         StatusReg_Tired_PreNORMAL();
				 	}

				 //----------------------------------------------------------------
				 
