nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
				 Status_TiredwhRst=1; // 没疲劳时为1
				 if(TiredConf_struct.Tired_drive.ACC_ONstate_counter>=(TiredConf_struct.TiredDoor.Door_DrvKeepingSec)) //14400 // 连续驾驶超过4小时算疲劳驾驶
				 {
				       TiredConf_struct.Tired_drive.Tgvoice_play=0; 
				       
					   Status_TiredwhRst=2;// 疲劳了就为2了
					   TiredConf_struct.Tired_drive.Tireddrv_status=1;	// 记录疲劳驾驶的状态 
					   if(TiredConf_struct.Tired_drive.ACC_ONstate_counter==(TiredConf_struct.TiredDoor.Door_DrvKeepingSec)) //14400 
						 {
							//Tired_drive.Tgvoice_play=1;  // 开始播放疲劳驾驶语音提示
						   // Tired_drive.voicePly_counter++;						
							Time2BCD(TiredConf_struct.Tired_drive.start_time);						
							rt_kprintf("\r\n   疲劳驾驶触发了! \r\n");	
							TTS_play("您已经疲劳驾驶，请注意休息"); 
							tts_bro_tired_flag=1;
							Warn_Status[3]|=0x04;  //BIT(2)  疲劳驾驶    
							StatusReg_Tired_PreNORMAL();
							//---- 触发即时上报数据-------
							PositionSD_Enable();    
					              Current_UDP_sd=1;	
							//-------------------------------------	   
							Rstart_time=1;
						}
						//--------- 蜂鸣器提示相关	关闭蜂鸣器 记录下疲劳驾驶  ------------
						Warn_Status[3]|=0x04;  //BIT(2)  疲劳驾驶    
						TiredConf_struct.Tired_drive.Tgvoice_play=0; 				  
				
				 }
				 TiredConf_struct.Tired_drive.Flag=1;   


				  //-------- 当天累计驾驶时间判断 -------------------------
				  if(JT808Conf_struct.PositionSd_Stratage==0)
				  {
				      //----------------------------------------------------------------------
                      TiredConf_struct.Tired_drive.CurrentDay_DriveTimer_0++;
					  if(TiredConf_struct.Tired_drive.CurrentDay_DriveTimer_0>= TiredConf_struct.TiredDoor.Door_DayAccumlateDrvSec)
					  	{					  	    
							if(TiredConf_struct.Tired_drive.CurrentDay_DriveTimer_0== TiredConf_struct.TiredDoor.Door_DayAccumlateDrvSec)
							{
                              	Warn_Status[1]|=0x04;  //BIT(3)  当天累计驾驶超时
								//---- 触发即时上报数据-------
								PositionSD_Enable();    
						        Current_UDP_sd=1;	
							}
					  	}
					  //---------------------------------------------------------------------
				  }
				  else
				  if(JT808Conf_struct.PositionSd_Stratage==1)
				  {
				      //     Driver 1 
				      if(strncmp(JT808Conf_struct.Driver_Info.BD_DriveName,"张三三",6)==0)
				      {
						  //----------------------------------------------------------------------
						  TiredConf_struct.Tired_drive.CurrentDay_DriveTimer_Driver_1++;
						  if(TiredConf_struct.Tired_drive.CurrentDay_DriveTimer_Driver_1>= TiredConf_struct.TiredDoor.Door_DayAccumlateDrvSec)
							{							
								if(TiredConf_struct.Tired_drive.CurrentDay_DriveTimer_0== TiredConf_struct.TiredDoor.Door_DayAccumlateDrvSec)
								{
									Warn_Status[1]|=0x04;  //BIT(3)  当天累计驾驶超时
									//---- 触发即时上报数据-------
									PositionSD_Enable();	
									Current_UDP_sd=1;	
								}
							}
						  //---------------------------------------------------------------------

						
				      }
                      //     Driver 2 
				      if(strncmp(JT808Conf_struct.Driver_Info.BD_DriveName,"李四四",6)==0)
				      	{
						  //----------------------------------------------------------------------
						  TiredConf_struct.Tired_drive.CurrentDay_DriveTimer_Driver_2++; 
						  if(TiredConf_struct.Tired_drive.CurrentDay_DriveTimer_Driver_2>= TiredConf_struct.TiredDoor.Door_DayAccumlateDrvSec)
							{							
								if(TiredConf_struct.Tired_drive.CurrentDay_DriveTimer_0== TiredConf_struct.TiredDoor.Door_DayAccumlateDrvSec)
								{
									Warn_Status[1]|=0x04;  //BIT(3)  当天累计驾驶超时 
									//-------- 触发即时上报数据--------- 
									PositionSD_Enable();	
									Current_UDP_sd=1;	
								}
							}
						  //---------------------------------------------------------------------
				      	}

				  }




				 
			  }
			 else
			  { 
				  //------------ 疲劳驾驶相关  ----------------------
			    if(TiredConf_struct.Tired_drive.Flag==1)  //只有从ACCon切换过来时才做以下处理，如果长期关着，没有必要了 
			   	{
			   	   //-- ACC 没有休息前还算AccON 的状态  ---------------			   	   
				   TiredConf_struct.Tired_drive.ACC_ONstate_counter++;  // ACC 累计工作时间
                   
				   if(DispContent==5)
					  rt_kprintf("\r\n	ACC ON 2 = %d, GPS_speed = %d",TiredConf_struct.Tired_drive.ACC_ONstate_counter,GPS_speed); 
                                if( TiredConf_struct.Tired_drive.ACC_ONstate_counter==(TiredConf_struct.TiredDoor.Door_DrvKeepingSec-30)) //提前5分钟蜂鸣器提示注意疲劳驾驶 14100
					{  
					     TiredConf_struct.Tired_drive.Tgvoice_play=1;
					     TTS_play("您还有20秒就疲劳驾驶，请注意安全");	 
				 	}

                   //----------- 疲劳驾驶预报警  ----------------------------
                 if( TiredConf_struct.Tired_drive.ACC_ONstate_counter>=(TiredConf_struct.TiredDoor.Door_DrvKeepingSec-JT808Conf_struct.BD_TiredDrv_preWarnValue))
                 	{
                 	   if(TiredConf_struct.Tired_drive.ACC_ONstate_counter<TiredConf_struct.TiredDoor.Door_DrvKeepingSec)
					   {
						    if(((Warn_Status[2]&0x40)==0x00)&&((Warn_Status[3]&0x04)==0x00))
					     	{
								  rt_kprintf("\r\n  疲劳预报警触发2\r\n"); 
								  StatusReg_Tired_PreWARN();
								   PositionSD_Enable();  
					               Current_UDP_sd=1;  
						    }
                 	   	}
                 	}
				 else
				 	{    // 清除预报警
                         StatusReg_Tired_PreNORMAL();
				 	}

				 //----------------------------------------------------------------				   
				   if(((Warn_Status[2]&0x40)==0x00)&&(TiredConf_struct.Tired_drive.ACC_ONstate_counter >= TiredConf_struct.TiredDoor.Door_DrvKeepingSec)) //14400 // 连续驾驶超过4小时算疲劳驾驶
				   {   // 不在预警情况下 
						 
						 Status_TiredwhRst=2;// 疲劳了就为2了
						 TiredConf_struct.Tired_drive.Tireddrv_status=1;   // 记录疲劳驾驶的状态 
						 if(TiredConf_struct.Tired_drive.ACC_ONstate_counter==(TiredConf_struct.TiredDoor.Door_DrvKeepingSec)) //14400 
						   {
							  Time2BCD(TiredConf_struct.Tired_drive.start_time); 					  
							  rt_kprintf("\r\n	 速度小，但未满足休息门限时间 疲劳驾驶触发了! \r\n"); 
							  TTS_play("您已经疲劳驾驶，请注意休息"); 
							  tts_bro_tired_flag=1;
							  Warn_Status[3]|=0x04;  //BIT(2)  疲劳驾驶   
							  StatusReg_Tired_PreNORMAL();
							 //---- 触发即时上报数据-------
							 PositionSD_Enable();    
					               Current_UDP_sd=1;	
							 //-------------------------------------	   
							  Rstart_time=1;
						  }
						 Warn_Status[3]|=0x04;  //BIT(2)  疲劳驾驶    
				   } 
				  //------------------------------------------------------------------------------
				  TiredConf_struct.Tired_drive.ACC_Offstate_counter++;
				  if(DispContent==5) 
				    rt_kprintf("\r\n  ACC OFF = %d, GPS_speed = %d",TiredConf_struct.Tired_drive.ACC_Offstate_counter,GPS_speed);
				  if(TiredConf_struct.Tired_drive.ACC_Offstate_counter>=TiredConf_struct.TiredDoor.Door_MinSleepSec)//1200	// ACC 关20分钟视为休息
					{
					 
