nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
					  if(TiredConf_struct.Tired_drive.ACC_Offstate_counter==TiredConf_struct.TiredDoor.Door_MinSleepSec)
					  {
					  TiredConf_struct.Tired_drive.ACC_Offstate_counter=0;
					  TiredConf_struct.Tired_drive.ACC_ONstate_counter=0;
						  Warn_Status[3]&=~0x04;  //BIT(2)	疲劳驾驶  
						  StatusReg_Tired_PreNORMAL();
						  if(tts_bro_tired_flag==1)
						    {   
						        TTS_play("您的疲劳驾驶报警已经解除"); 
							  tts_bro_tired_flag=0;  	 
						    }
						 // Status_TiredwhRst=0;
						 // DF_WriteFlashSector(DF_TiredStartTime_Page,0,(u8*)&Status_TiredwhRst,1); //清除O后要写入
                                            //---- 触发即时上报数据-------
							PositionSD_Enable();    
					               Current_UDP_sd=1;	
						  //-------------------------------------	   						  rt_kprintf("\r\n   ACC  休息了 \r\n"); 		
						  if(Rstart_time==1)
							  	{
							  	TiredConf_struct.Tired_drive.Flag=0;///////
							  	//Tired_drive.ACC_ONstate_counter=0;
								
							  	Rstart_time=0;
							  	TiredConf_struct.Tired_drive.Tireddrv_status=2 ;
								//rt_kprintf("\r\n疲劳结束时间写入");
							  	}
					  
					  }	
					 
					} 
		 
				} 		

				
				  //----------  超长停车相关 ------------------------------------------------------
				if(GPS_speed<3)//(GPS_speed==0)  // 停车超时从速度为0时开始
				//if(DebugSpd<3)  
				{
				  TiredConf_struct.TiredDoor.Parking_currentcnt++;
				  //if(DispContent==2)
				   //  printf("\r\n @#@\r\n");
				  if(TiredConf_struct.TiredDoor.Parking_currentcnt>=TiredConf_struct.TiredDoor.Door_MaxParkingSec)//TiredDoor.Door_MaxParkingSec)
				  	{  //  停车大于门限值，就算停车了
				  	   
					   Warn_Status[1]|=0x08;  // 停车超时触发
		                       if(TiredConf_struct.TiredDoor.Parking_currentcnt==TiredConf_struct.TiredDoor.Door_MaxParkingSec)   
		                       	{
		                                   //---- 触发即时上报数据-------
							PositionSD_Enable();    
					               Current_UDP_sd=1;	
							//-------------------------------------
							TTS_play(" 超时停车触发"); 
						       rt_kprintf("\r\n 超时停车触发! \r\n"); 
		                       	} 
					} 
				}  
				else
					TiredConf_struct.TiredDoor.Parking_currentcnt=0; 
				  //-------------------------------------------------------------------------------- 
			 } 


}
//E:\work_xj\F4_BD\北斗行车记录仪过检(新协议)\2-21 RT-Thread_NewBoard-LCD2-Jiance\bsp\stm32f407vgt6_RecDrv\app_712\lcd\Menu_0_3_Sim.c
void CAN_struct_init(void)
{
      //-------  protocol variables
     CAN_trans.can1_sample_dur=0;  // can1 采集间隔  ms
     CAN_trans.can1_trans_dur=0;  // can1  上报间隔 s
     CAN_trans.can1_enable_get=0; // 500ms 

     CAN_trans.can2_sample_dur=0;  // can2 采集间隔  ms
     CAN_trans.can2_trans_dur=0;  // can2  上报间隔 s      
     
   //   u8      canid_1[8];// 原始设置
     CAN_trans.canid_1_Filter_ID=0;  // 接收判断用
      //u8      canid_1_Rxbuf[400]; // 接收buffer
     CAN_trans.canid_1_RxWr=0; // 写buffer下标
     CAN_trans.canid_1_SdWr=0;
      CAN_trans.canid_1_ext_state=0; // 扩展帧状态
     CAN_trans.canid_1_sample_dur=10;  // 改ID 的采集间隔
     CAN_trans.canid_ID_enableGet=0;   

      //------- system variables  
      CAN_trans.canid_timer=0;  //定时器
      CAN_trans.canid_0705_sdFlag=0;// 发送标志位	   

}

void  CAN_send_timer(void)
{
   u16 i=0,datanum=0;;
       if(CAN_trans.can1_trans_dur>0) 
      {  
            CAN_trans.canid_timer++;
	    // if( CAN_trans.canid_timer>=CAN_trans.can1_trans_dur)		
	      if( CAN_trans.canid_timer>=4)      	        
	      {	  
                   CAN_trans.canid_timer=0; 
		     //------  判断有没有数据项
		     if(CAN_trans.canid_1_RxWr)
		     	{
		     	      datanum=(CAN_trans.canid_1_RxWr>>3); 
		     	      memcpy(CAN_trans.canid_1_Sdbuf,CAN_trans.canid_1_Rxbuf,CAN_trans.canid_1_RxWr);
			      CAN_trans.canid_1_SdWr=CAN_trans.canid_1_RxWr;	
			      for(i=0;i<datanum;i++)
				       CAN_trans.canid_1_ID_SdBUF[i]=CAN_trans.canid_1_ID_RxBUF[i];  
				  
			      CAN_trans.canid_1_RxWr=0; // clear
		             CAN_trans.canid_0705_sdFlag=1;
		     	}
			else
			     rt_kprintf("\r\n rx=%d  dur=%ds   CAN send trigger ,no data \r\n",CAN_trans.canid_1_RxWr,CAN_trans.can1_trans_dur);   	

	     	}	 

       }
	else
       {
                  CAN_trans.canid_0705_sdFlag=0;
		    CAN_trans.canid_timer=0;
	}
}

//--------------  SMS Msg  Send Related  ------------------------
void SMS_send_init(void)
{
    SMS_send.Msg_sdState=0;
    SMS_send.Msg_step=0;
    SMS_send.Msg_timer=0;
}

void SMS_send_process(void)
{
       if(SMS_send.Msg_sdState==1)
       {
              switch(SMS_send.Msg_step)
              {
                      case 1:   // 发送命令AT+CMGS="13051953513"    //13602069191
                                      rt_hw_gsm_output("AT+CMGS=\"13051953513\"\r\n"); 	
                                      SMS_send.Msg_step=2;
					   SMS_send.Msg_timer=0;	 // clear  timer   and  start counter	
					   rt_kprintf("AT+CMGS=\"13051953513\"\r\n");  
					   break;
			case  2 :    break;
			case  4:    // 发送内容 0x1A 结束
                                       rt_hw_gsm_output("ProductNum:70420  Type: TW703  DeviceNum:03 ");
					    SMS_send.Msg_step=5;	
					    rt_kprintf("ProductNum:70420  Type: TW703  DeviceNum:03 \x1a");	
				          break;
		       case  7: 
                                      rt_hw_gsm_output("\x1a"); 
					   SMS_send.Msg_step=8; 				  
				          break;
		       default:
			   	          break; 

               }

       }
}

void  SMS_send_Step(u8  step)
{
       SMS_send.Msg_step=step;   
}

u8  SMS_send_stateQuery(void)
{
           return SMS_send.Msg_sdState;
}

void  SMS_send_enable(void)
{
       //  要发送短信	
	SMS_send.Msg_sdState=1;
       SMS_send.Msg_step=1;  
}

void  SMS_send_end(void)
{
       SMS_send_init(); 
}

void SMS_Send_timer(void)
{
    if(SMS_send.Msg_sdState==1)
    {
		  
		    SMS_send.Msg_timer++;
			 if(SMS_send.Msg_timer>=10)  // 2s	   
			 {
			      SMS_send.Msg_timer=0;
	                    SMS_send_end();
			      rt_kprintf(" \r\n   SMS send timeout !\r\n");		
			 }
		//-----------------------------	 
		 if(SMS_send.Msg_step==6)
		 	SMS_send.Msg_step=7;	
		 
