nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
		 if(SMS_send.Msg_step==5)
		 	SMS_send.Msg_step=6;	
		 
		 if(SMS_send.Msg_step==3)
	      	{
	            SMS_send.Msg_step=4;    
	      	}
		 
		 if(SMS_send.Msg_step==2)
	      	{
	                  rt_hw_gsm_output("\r\n");
	            SMS_send.Msg_step=3;  
	      	}
		//----------------------------- 
	 

    	}	

}

//--------------------------------------------------------------------------
int use_gpsSpd(void)
{	
	JT808Conf_struct.Speed_GetType=0;  
	JT808Conf_struct.DF_K_adjustState=0;					// clear  Flag
		   ModuleStatus&=~Status_Pcheck;

       Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));		  
	rt_kprintf(" \r\n  ------------------------设置从GPS获取速度  Speed_GetType= %d",JT808Conf_struct.Speed_GetType);
	return 1;
}
FINSH_FUNCTION_EXPORT(use_gpsSpd, usegpsspd);

int use_sensorspd(void)  
{	
	JT808Conf_struct.Speed_GetType=1; 
	JT808Conf_struct.DF_K_adjustState=1;					// clear  Flag 
       ModuleStatus|=Status_Pcheck;
       Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));  
       rt_kprintf(" \r\n  ------------------------设置从Sensor获取速度	Speed_GetType= %d",JT808Conf_struct.Speed_GetType);  
	return 1;
}
FINSH_FUNCTION_EXPORT(use_sensorspd, sensorSpd); 


void  Init_original(void)
{
      if(SysConf_struct.Version_ID==SYSID)   //  check  wether need  update  or not 
	          	{                    
					SysConf_struct.Version_ID=SYSID+1;   
					Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));
					Systerm_Reset_counter=Max_SystemCounter;
					ISP_resetFlag=2;    //   借助远程下载重启机制复位系统 
	          	}
       rt_kprintf("\r\n 手动恢复出厂设置 \r\n");   
}
FINSH_FUNCTION_EXPORT(Init_original, Init_original); 

void  apn_set(u8 * Content)
{
    u8  infolen=0;
	
     infolen=strlen(Content);
     memset(APN_String,0,sizeof(APN_String));					  
     memcpy(APN_String,(char*)Content,infolen);  
     memset((u8*)SysConf_struct.APN_str,0,sizeof(APN_String));	
     memcpy((u8*)SysConf_struct.APN_str,(char*)Content,infolen);  
     Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));
     DataLink_APN_Set(APN_String,1);   
     rt_kprintf("\r\n 手动设置APN \r\n");   	  
} 
FINSH_FUNCTION_EXPORT(apn_set, Set APN_String);   

void  dur(u8 *content)
{
  sscanf(content, "%d", (u32*)&Current_SD_Duration);
  rt_kprintf("\r\n 手动设置上报时间间隔 %d s\r\n",Current_SD_Duration);
  
       JT808Conf_struct.DURATION.Default_Dur=Current_SD_Duration;
	   GNSS_rawdata.SendDuration=Current_SD_Duration;
        Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));

}
FINSH_FUNCTION_EXPORT(dur, Set APN_String);   
void idset(u8 *ID)
{
    u8   len=0;

     if(strlen(ID)!=12)
	{      rt_kprintf("\r\nID  长度不够\r\n");	return; }

	    memcpy((char*)JT808Conf_struct.Vechicle_Info.Vech_sim,ID,12);
        Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));

				
	memcpy((char*)IMSI_CODE+3,(char*)JT808Conf_struct.Vechicle_Info.Vech_sim,12);
	IMSI_Convert_SIMCODE(); //  translate 
	rt_kprintf("\r\n ID=%s\r\n",ID); 

}
FINSH_FUNCTION_EXPORT(idset, idset); 

void recoverset(void)
{
    FirstRun_Config_Write();   // 里边更新了 SYSID      
}
FINSH_FUNCTION_EXPORT(recoverset, recoverset); 
void chepai(u8 *instr)
{    
    memset(JT808Conf_struct.Vechicle_Info.Vech_Num,0,sizeof(JT808Conf_struct.Vechicle_Info.Vech_Num));
    memcpy(JT808Conf_struct.Vechicle_Info.Vech_Num,instr,8); 
    Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));  
}
FINSH_FUNCTION_EXPORT(chepai, chepai);  


void  localtrig(u8 *instr)
{
    
     local_trig=instr[0]-0x30;
     if(local_trig)
	 {    GPS_getfirst=1;local_timer=0;} 
     else
	  {   GPS_getfirst=0; local_timer=0;} 	
     rt_kprintf("\r\n Enable local  time=%d  \r\n",local_trig);     
}
FINSH_FUNCTION_EXPORT(localtrig, localtrig);  

void  current(void)
{
    PositionSD_Enable();
    Current_UDP_sd=1;
   //  memcpy(BakTime,CurrentTime,3); // update   		 

}
FINSH_FUNCTION_EXPORT(current, current);  



void rec_mov(void)
{
    u32  i=0; 
    u8  C=0;	
	
   WatchDog_Feed();
       rt_kprintf("\r\n erase");
      SST25V_BlockErase_64KByte((CycleStart_offset)*PageSIZE);      // erase Sector		
      rt_kprintf("  Over\r\n");
	for(i=0;i<256*PageSIZE;i++)
     {
     
	    DF_ReadFlash(CycleStart_offset,i,(u8*)&C,1); 	
	    WatchDog_Feed();
	    DF_WriteFlash(DF_Record_Page,i,(u8*)&C,1); 	          

     }
}
FINSH_FUNCTION_EXPORT(rec_mov, rec_mov);  

void rec_rd(void)
{
     u32  i=0; 
         u8  C=0;	

      rt_kprintf("\r\n rec:");
      for(i=0;i<256*PageSIZE;i++)
      {     
	    DF_ReadFlash(DF_Record_Page,i,(u8*)&C,1);
	    rt_kprintf(" %2X",C);	
	    WatchDog_Feed();	
      }  
      rt_kprintf("\r\n");	 	
}
FINSH_FUNCTION_EXPORT(rec_rd, rec_rd);  


void txt_play(u8 *instr)
{
   u16  len=strlen(instr);
   
						    //--------------  播报----  
							  Dev_Voice.CMD_Type='2';
							  memset(Dev_Voice.Play_info,0,sizeof(Dev_Voice.Play_info));
                                                   memcpy(Dev_Voice.Play_info,instr,len);
							  Dev_Voice.info_sdFlag=1;

							//#ifdef LCD_5inch
							   //DwinLCD.Type=LCD_SDTXT;
							 // memset(DwinLCD.TXT_content,0,sizeof(DwinLCD.TXT_content)); 
                                                   //DwinLCD.TXT_contentLen=AsciiToGb(DwinLCD.TXT_content,infolen-1,UDP_HEX_Rx+14);  						  
							//#endif   
                                                   //  TTS  
							   TTS_Get_Data(instr,len);


						  #ifdef LCD_5inch
						           //======  信息都在屏幕上显示  
                                                	  DwinLCD.Type=LCD_SDTXT;
							  memset(DwinLCD.TXT_content,0,sizeof(DwinLCD.TXT_content)); 
                                                   DwinLCD.TXT_contentLen=AsciiToGb(DwinLCD.TXT_content,len,instr);  						  
   						#endif     



}
FINSH_FUNCTION_EXPORT(txt_play, txt_play);  

void ICack(void)
{
     u8  i=0;
    u8  ackreg[24]={0x00, 0x01, 0xf1 , 0xd8 , 0x37 , 0x25 , 0x61 , 0xe8 , 0x30 , 0x7c , 0x00 , 0x00 , 0x00 , 0x00 , 0x00 , 0x00 , 0x00 , 0x00 , 0x00 , 0x00 , 0x00 , 0x00 , 0xc6 , 0x39};

                                                                memcpy(IC_MOD.IC_Rx,ackreg,24);
								     rt_kprintf("\r\n IC 卡透传len=%dBytes  RX:",24);
									 for(i=0;i<24;i++)
									 	rt_kprintf("%2X ",ackreg[i]); 
								     rt_kprintf("\r\n");	 
                                                             //------ 直接发送给IC 卡模块-----
                                                             DeviceData_Encode_Send(0x0B,0x40,ackreg,24); 									 





