nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
} 
FINSH_FUNCTION_EXPORT(ICack, ICack);  


void  msg_send(void)
{
    SMS_send_enable();
     rt_kprintf("\r\n   收到使能发送短信\r\n");	 	
}
FINSH_FUNCTION_EXPORT(msg_send, msg_send);  


void close_com(void)
{
      JT808Conf_struct.Close_CommunicateFlag=1;  
      Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct)); 
      Close_DataLink();
      rt_kprintf("\r\nclose com\r\n");    	    
	
}
FINSH_FUNCTION_EXPORT(close_com, close_com);  

void open_com(void)
{
      JT808Conf_struct.Close_CommunicateFlag=0; 
      Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct)); 
	  rt_kprintf("\r\n open com\r\n");
}
FINSH_FUNCTION_EXPORT(open_com, open_com);   

void app_queenable(u8* instr)
{
     if(instr[0]=='0')
     	{
            app_que_enable=0;
	      AppQue.write_num=0;
	      AppQue.read_num=0; 	   
            rt_kprintf("\r\n app que disable\r\n");   
     	}
        if(instr[0]=='1')
     	{
     	   app_que_enable=1; 
          rt_kprintf("\r\n app que enable\r\n"); 
     	}
	 

}
FINSH_FUNCTION_EXPORT(app_queenable, app_queenable);    



void   stop_normal(u8 *instr)
{
     if(instr[0]=='0')
     	{
           stopNormal=0;
	   AppQue.sd_enable_flag=0;	   
           rt_kprintf("\r\n  stop_normal disable\r\n");   
     	}
        if(instr[0]=='1')
     	{
     	   stopNormal=1; 
	   AppQue.sd_enable_flag=0;	     
          rt_kprintf("\r\n stop_normal que enable -only  pos\r\n"); 
     	}
        if(instr[0]=='2')
     	{
     	   stopNormal=2; 
          rt_kprintf("\r\n stop_normal que enable-forbid all\r\n");  
     	}

} 
FINSH_FUNCTION_EXPORT(stop_normal, stop_normal[1|0]); 
void gpsspd(u8 *strin)   //  GPS 用假速度
{
   sscanf(strin, "%d", (u32*)&Speed_gps);
   rt_kprintf("\r\n set gpsspd= %d s\r\n",Speed_gps); 
 
   Jia_GPS_spdFlag=1; 
}
FINSH_FUNCTION_EXPORT(gpsspd, gpsspd);    

void normalspd(void)    // 恢复 GPS 用真速度
{
    Jia_GPS_spdFlag=0;
    Speed_gps_jiashi=0;	
    rt_kprintf("\r\n recover normal spd\r\n");   
}
FINSH_FUNCTION_EXPORT(normalspd, normalspd);     

void sensorspd(u8 *strin)   //  GPS 用假速度 
{
   sscanf(strin, "%d", (u32*)&Speed_cacu);
   rt_kprintf("\r\n set sensorspd= %d s\r\n",Speed_cacu);  

  //  JT808Conf_struct.Speed_GetType=1;  // 通过速度传感器 获取速度
    Jia_GPS_spdFlag=2;  
}
FINSH_FUNCTION_EXPORT(sensorspd, sensorspd1);    

void qianya(u8 *instr)
{

	if(instr[0]=='0')
	   {
			 Warn_Status[3]&=~0x80;  // bit 7
			 
			 rt_kprintf("\r\n  欠压 Recover!\r\n");	 
			PositionSD_Enable();
			Current_UDP_sd=1;
	   }
	   if(instr[0]=='1')
	   {
			  Warn_Status[3]|= 0x80;  
			  
			 rt_kprintf("\r\n 欠压 故障\r\n"); 
			 PositionSD_Enable();
			 Current_UDP_sd=1;  
	   }

}
FINSH_FUNCTION_EXPORT(qianya, qianya);    

void lcd(u8 *instr)
{
	if(instr[0]=='0')
	   {
			 Warn_Status[2]&=~0x02;  // bit 9
			 
			 rt_kprintf("\r\n  lcd Recover!\r\n");	 
			PositionSD_Enable();
			Current_UDP_sd=1;
	   }
	   if(instr[0]=='1')
	   {
			  Warn_Status[2]|= 0x02;  
			  
			 rt_kprintf("\r\n lcd 故障\r\n");  
			 PositionSD_Enable();
			 Current_UDP_sd=1;
	   }


}
FINSH_FUNCTION_EXPORT(lcd, lcd);    

void tts(u8 *instr)
{
	if(instr[0]=='0')
	   {
			 Warn_Status[2]&=~0x04;  // bit 10
			 
			 rt_kprintf("\r\n  tts Recover!\r\n");	 
			PositionSD_Enable();
			Current_UDP_sd=1;
	   }
	   if(instr[0]=='1')
	   {
			  Warn_Status[2]|= 0x04;  
			  
			 rt_kprintf("\r\n tts 故障\r\n"); 
			 PositionSD_Enable();
			 Current_UDP_sd=1;
	   }

}
FINSH_FUNCTION_EXPORT(tts, tts);    

void ic(u8 *instr)
{
	if(instr[0]=='0')
	   {
			 Warn_Status[2]&=~0x10;  // bit 12
			 
			 rt_kprintf("\r\n  ic Recover!\r\n");	 
			PositionSD_Enable();
			Current_UDP_sd=1;
	   }
	   if(instr[0]=='1')
	   {
			  Warn_Status[2]|= 0x10;  
			  
			 rt_kprintf("\r\n ic 故障\r\n"); 
			 PositionSD_Enable();
			 Current_UDP_sd=1;
	   }

}
FINSH_FUNCTION_EXPORT(ic, ic);    

void vss(u8 *instr)
{
     if(instr[0]=='0')
     	{
		      Warn_Status[0]&=~0x01;  // bit 24
			  
	          rt_kprintf("\r\n  Vss Recover!\r\n");   
		     PositionSD_Enable();
	         Current_UDP_sd=1;
     	}
        if(instr[0]=='1')
     	{
	     	   Warn_Status[0]|= 0x01;  
			   
	          rt_kprintf("\r\n Vss 故障\r\n"); 
			  PositionSD_Enable();
	          Current_UDP_sd=1;
     	}


}
FINSH_FUNCTION_EXPORT(vss, vss);    

void tired_clear(u8 *instr)
{   
    memset(JT808Conf_struct.Driver_Info.BD_DriveName,0,sizeof(JT808Conf_struct.Driver_Info.BD_DriveName)); 
	memcpy(JT808Conf_struct.Driver_Info.BD_DriveName,instr,strlen(instr)); 
    Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));		

	Warn_Status[1]&=~0x04;  //BIT(18)  当天累计驾驶超时  清除 
	//--------------------------------
    TIRED_Drive_Init();

}
FINSH_FUNCTION_EXPORT(tired_clear, tired_clear);   

void driver_name(u8 *instr)
{   
    memset(JT808Conf_struct.Driver_Info.BD_DriveName,0,sizeof(JT808Conf_struct.Driver_Info.BD_DriveName)); 
	memcpy(JT808Conf_struct.Driver_Info.BD_DriveName,instr,strlen(instr)); 
    Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));		
}
FINSH_FUNCTION_EXPORT(driver_name, set_driver_name );   


void oilvalue(u8 *instr)
{

   sscanf(instr, "%d", (u32*)&Oil_volum);
   rt_kprintf("\r\n set current Oil volum= %d 1/10L\r\n",Oil_volum);   

}
FINSH_FUNCTION_EXPORT(oilvalue, oilvalue set );   

void com1_data(u8 *instr)
{
  u16 i=0;

   RawTrans_Com1.datalen=strlen(instr);
   memcpy(RawTrans_Com1.RawData,instr,RawTrans_Com1.datalen);
   RawTrans_Com1.Enable_SD_Flag=1;

    rt_kprintf("\r\n com1 rx:");
	for(i=0;i<RawTrans_Com1.datalen;i++)
		{
               rt_kprintf("%c",RawTrans_Com1.RawData[i]);
		}
	 rt_kprintf("\r\n");

}
FINSH_FUNCTION_EXPORT(com1_data, com1_data );   

void com2_data(u8 *instr)
{
  u16 i=0;
  
   RawTrans_Com2.datalen=strlen(instr);
   memcpy(RawTrans_Com2.RawData,instr,RawTrans_Com2.datalen);
   RawTrans_Com2.Enable_SD_Flag=1;

     rt_kprintf("\r\n com2 rx:");  
	for(i=0;i<RawTrans_Com2.datalen;i++)  
		{
               rt_kprintf("%c",RawTrans_Com2.RawData[i]); 
		}
	 rt_kprintf("\r\n");

}
FINSH_FUNCTION_EXPORT(com2_data, com2_data );    


void handsms(u8 *instr)
{    
    //------------------------------------------------------------------------
    
	/*memset(SMS_Service.SMS_sd_Content,0,sizeof(SMS_Service.SMS_sd_Content));
	strcpy(SMS_Service.SMS_sd_Content,JT808Conf_struct.Vechicle_Info.Vech_Num);
	strcat(SMS_Service.SMS_sd_Content,"#");// Debug
	strcat(SMS_Service.SMS_sd_Content,DeviceNumberID);// Debug
*/
	//------------------------------------------------------------------------
    memset(SMS_Service.SMS_sd_Content,0,sizeof(SMS_Service.SMS_sd_Content)); 
    memcpy(SMS_Service.SMS_sd_Content,instr,strlen(instr));  
    SMS_Service.SMS_sendFlag=1;	  
	SMS_Service.SMS_come=1;
    rt_kprintf("手动发送:%s",SMS_Service.SMS_sd_Content);     
}
FINSH_FUNCTION_EXPORT(handsms, handsms);  


 void  warn_msg_sd(void)
 {
     u8  SMS_REGstr[70];

	 memset(SMS_REGstr,0,70);
	 strcpy(SMS_REGstr,JT808Conf_struct.Vechicle_Info.Vech_Num);
     strcat(SMS_REGstr,"|");
	 memcpy(SMS_REGstr+strlen(SMS_REGstr),JT808Conf_struct.Vechicle_Info.Vech_sim,12);
	 strcat(SMS_REGstr,"|EmgWarn|");
	 sprintf(SMS_REGstr+strlen(SMS_REGstr),"%s|%s|%s",Posit_Str.DateTime,Posit_Str.Lati_Str,Posit_Str.Longi_Str); 

	 rt_kprintf("\r\n	%s\r\n",SMS_REGstr);  

	 handsms(SMS_REGstr);  

 }
 FINSH_FUNCTION_EXPORT(warn_msg_sd, warn_msg_sd);   

 void  encode(void)
 	{
           Stuff_AccountPacket_0110H(0,1);//   

 	}
 
 FINSH_FUNCTION_EXPORT(encode, encode);  

// C.  Module
